{"post_id":115,"student_id":"10","student_name":"Jenny Lim","student_slug":"jenny-lim","advisor_id":"114","advisor_name":"Adaora Udoji","advisor_slug":"aeu4","project_title":"Awkward Thanksgiving","project_question":"I’ve recently noticed myself censoring my speech out of fear: fear of seeming ignorant, bigoted or worse. While I think it’s important to watch one’s words out of sensitivity and respect for others, I believe that self-censorship due to fear hinders discourse. For my thesis, I wanted to make a game that creates a safe space for people to discuss politics. \r\n<br />\r\n<br />\r\nIn Awkward Thanksgiving, players begin by adopting an ideology: libertarian, progressive, socialist, etc. This is the ideology that they must represent throughout the game. Some players choose ideologies because it’s fun to pretend to be on the other side. Others choose ideologies because it gives them the freedom to express opinions that their friends may not share.\r\n<br />\r\n<br />\r\nThe mechanics of the game force players to think beyond their initial stereotypes of their ideologies. Players must use Argument cards when they discuss a topic, and often players will find themselves with Argument cards that do not perfectly align with the “party line.” According to one player, “It’s fun to puzzle out, ‘How am I going to use this card?’ Making arguments that buck stereotype is really nice.”\r\n<br />\r\n<br />\r\nThe trickiest part of making a “serious” game is making it fun. It doesn’t matter how important a game’s mission is; if it’s not fun, no one will play it. Awkward Thanksgiving provides two kinds of fun: the relief of saying the unsayable, and the joy of improvising family history. During one playtest, two friends playing a divorced couple began bickering over a stolen lawnmower. The exchange provided some relief to a fairly serious discussion on Universal Basic Income.\r\n<br />\r\n<br />\r\nAwkward Thanksgiving has gone through 6 distinct iterations since mid-February. I’ve run over 12 playtests, with 4-8 players each time. The game is both fun and thought-provoking. I will continue to develop it after graduation.","short_description":"Can games change the way people think about complex issues? For my thesis, I developed a game called <i>Awkward Thanksgiving</i>, a roleplaying card game that creates a safe (and fun!) space for people to discuss political and social issues.","further_reading":"<p>I started my thesis with this question: How can games open players’ minds to other points of view?<br />\nThe project began as a game about economics. With its numerical and probabilistic outcomes, economics is amenable to a computerized game structure that generates different results and navigates forking paths. Also, players often don’t come in with strong economic opinions.</p>\n<p>When I first playtested this economics game (on February 14, 2018) it quickly became clear that the economic questions outshone the game’s ultimate goal. If you really want to capture the complexities of economic policy, the game has to provide a lot of information about the subject. But I didn’t want to make a game that teaches economics; I wanted to create a game that encourages people to think about politics in different ways.</p>\n<p>I’m very grateful to the kind folks who endured that first playtest (Denver, Greg, Mattia and Seth) because, as game designers, they all know how important early testing is, and they didn’t judge me for showing up with a few sad index cards.</p>\n<p>Thankfully, I had not wasted a bunch of time making the “perfect” game about economics (far from it). After briefly experimenting with another game idea – “The Spin Zone,” a quick-draw debate game – I decided to turn my focus to a concept I thought of last December with ITP classmate Melissa Parker: Uncomfortable Thanksgiving.</p>\n<p>Melissa and I created Uncomfortable Thanksgiving for Greg Trefry’s class Game Design and the Psychology of Choice. In our game, players would pair off and go around the circle having debates. Each pair had up to 3 minutes to debate a randomly drawn topic. Topics ranged from serious (the minimum wage) to silly (cats).</p>\n<p>Awkward Thanksgiving is (now) a roleplaying card game for 4-8 players in which players adopt different family personae: communist grandpa, anarchist brother, etc. If you'd like to learn more about the mechanics of the game (which is still in development), please refer to the video above. I like the concept of Awkward Thanksgiving for two reasons:</p>\n<p>1. The title “Awkward Thanksgiving” does a lot of work by establishing tone and narrative framing. </p>\n<p>2. The role of family in ideology: I’m a fan of the social intuitionist theory of moral judgment, which posits that our intuitions come first, and our moral judgments emerge as post-hoc rationalizations. For all that people like to believe that our ideas are rooted in logic or a coherent ethical framework, there’s really nothing quite as powerful as personal ties. The example I usually give of this is gay marriage: I don’t know anyone who changed their minds about gay marriage because they read enough op-eds. But I do know people who changed their minds about gay marriage because a friend or family member came out.</p>\n<p>I’ve run playtests of Awkward Thanksgiving with friends who all know each other. I’ve also run Awkward Thanksgiving with strangers. The important thing for me is that the game works in both circumstances. While I’d love if folks of different ideologies got together to play Awkward Thanksgiving, I know that people will probably play with like-minded fellows. Still, there’s often more diversity of thought within groups than one might suspect based on surface appearances. The goal of Awkward Thanksgiving is to create a space where players can safely voice unpopular opinions, regardless of the makeup of the group.</p>\n<p><b>References</b></p>\n<p><i>Games</i></p>\n<p>Balderdash, Laura Robinson and Paul Toyne (1984)<br />\nCards Against Humanity, Cards Against Humanity LLC (2011)<br />\nFunemployed, Anthony Conta (2014)<br />\nThe Landlord’s Game, Elizabeth Magie Phillips (1904)<br />\nSnake Oil, Jeff Ochs (2010)<br />\nThe Metagame, Local No. 12 (2018)</p>\n<p><i>Bibliography</i></p>\n<p>Berman, J., &amp; Bruckman, A. S. (2001). The Turing Game: Exploring Identity in an Online Environment. <i>Convergence, 7(3),</i> 83-102. http://journals.sagepub.com/doi/abs/10.1177/135485650100700307<br />\nHaidt, J. (2013). <i>The Righteous Mind: Why Good People Are Divided by Politics and Religion.</i> New York: Vintage Books.<br />\nHammer, J. (2014). <i>Playing Prejudice: The Impact of Game-Play on Attributions of Gender and Racial Bias</i> (Doctoral dissertation). Retrieved from https://academiccommons.columbia.edu/catalog/ac:175406<br />\nKling, A. S. (2017). <i>The Three Languages of Politics: Talking Across the Political Divides.</i> Washington, D.C.: Cato Institute.<br />\nRorty, R. (1997). Justice as a Larger Loyalty. <i>Ethical Perspectives, 4(3),</i> 139-151.<br />\nPatton, B., Stone, D., &amp; Heen, S. (2011). <i>Difficult Conversations: How to Discuss What Matters Most.</i> London: Portfolio/Penguin.<br />\nThaler, R. H., &amp; Sunstein, C. R. (2008). <i>Nudge: Improving Decisions About Health, Wealth and Happiness.</i> London: Penguin.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/TurkeyThumb_color.png","title":"Turkey_thumbnail","alt":"Turkey Is Not Happy","caption":""},"topics":[{"name":"Play","slug":"play"},{"name":"Society","slug":"society"}],"video_presentation_url":"https://player.vimeo.com/video/270189548","video_documentation_url":"","project_url":"https://www.jlimetc.com/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/TurkeyThumb_color.png","title":"Turkey_thumbnail","alt":"Turkey Is Not Happy","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/night6crop.png","title":"Cool Ladies Game Night","alt":"Friends Playing Awkward Thanksgiving","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/AT_table_thesisSite-1.png","title":"AT_table_thesisSite","alt":"Table diagram","caption":"Awkward Thanksgiving example table"}]}