{"post_id":126,"student_id":"101","student_name":"Jeffrey Park","student_slug":"jeffrey-park","advisor_id":"131","advisor_name":"Stefani Bardin","advisor_slug":"sb4840","project_title":"Responsibly.me","project_question":"Responsibly.me is a web platform for consumers to make more socially responsible purchasing decisions. Responsibly.me aggregates existing rankings on a company’s Corporate Social Responsibility initiatives and recommends similar products from brands with higher grades. Responsibly.me also provides a dashboard for users to understand their social responsibility values and purchasing habits in order to encourage them to shop more consciously.\r\n<br />\r\n<br />\r\nIn this current climate where we face a growing number of wicked problems, both the public and private sector need to do more to create a better world for all of us. According to the 2017 Cone Communications CSR study, 63% of Americans are hopeful businesses will take the lead to drive social and environmental change moving forward. This number increases to 71% for millennials and younger generations. However, only 39% of consumers “researched a company’s business practices or support of social and environmental issues” (2017 Cone Communications CSR study). The majority of users simply are not aware of the efforts corporations take to tackle these social issues and make their businesses more socially responsible.\r\n<br />\r\n<br />\r\nResponsibly.me aims to make these efforts more transparent and easier to access for regular consumers. I have collected data on 50 of the top 100 brands according to Forbes and have built a web extension in which users can learn about a brand’s social responsibility rankings. I have also created design wireframes for product recommendations and the user dashboard to get an idea of where I hope to take this project.","short_description":"A web platform for consumers to make more informed choices based on a company’s initiatives on sustainability, environmental health, and fairness in the workplace. Armed with this information, consumers can use their buying power to influence the Corporate Social Responsibility of companies.","further_reading":"<p><b>Inspiration</b></p>\n<p>Before ITP, I spent 5 years as a Product Marketer for a software company in Silicon Valley. I didn’t have anything against the company, but during my time in Silicon Valley, I began to see flaws in the system that I was deeply unhappy with. Companies were eager to market themselves as revolutionary companies changing the world for the better, but as I spent more time in Silicon Valley, I began to see that these benefits did not range beyond the privileged bubble of Silicon Valley. For all of its innovation and great work, Silicon Valley experienced gentrification, income inequality, and other social problems.</p>\n<p>On top of benefiting a select few, the tech industry seemed to be wasting a lot of resources. For example, it was common to pour tens of thousands of dollars into a marketing campaign. But it was also common for a successful campaign, on average, to convert around 2% of its audience. Conversion rates of 5% are good, and conversions of 10% or more are excellent. We rarely found campaigns that increased our ROI over 10%. If failing 9 out of 10 times is considered excellent, I figured there were probably better ways to fail that could actually change the world.</p>\n<p>I still believed in technology though, and I was looking for a creative outlet after my last job, so I came to ITP. While accidentally burning Arduinos for a Physical Computing project or creating your own instruments for NIME was a lot of fun, I tried to spend time at ITP finding impactful real-world applications for technology. Last spring, I worked for the NYC Mayor’s Office of Economic Opportunity where we designed web experiences for New York City residents to learn more about public programs and benefits eligibility. This past fall, I was a research fellow at NYU-X, an innovation lab at NYU Rory Meyers College of Nursing dedicated to the exploration of emerging technologies to promote innovative health care. At NYU-X, I designed and prototyped a smart-dresser system for caretakers of patients with early-onset dementia. These experiences pushed me to continue to explore innovative ways to design experiences to use technologies for larger social impact.</p>\n<p>I hope that Responsibly.me creates some competition between corporations to improve their Corporate Social Responsibility programs, align themselves with environmental and social issues, and help make this world a better place.</p>\n<p><b>Target Audience</b></p>\n<p>My initial target audience for Responsibly.me is socially-conscious millennial online shoppers. Millennials make up the most active consumer demographic, and according to a business insider study, millennials spend the most money online, despite having lower income levels than older adults.</p>\n<p>According to the Nielsen Global Corporate Sustainability Report, 73% of millennials surveyed were willing to spend more on a product if it came from a sustainable brand. Millennials are changing our understanding of the interplay between consumer behavior and social responsibility. They advocate for transparent, moral, and sustainable business practices, and they are interested in securing a livable world for all of us. Hence, they are the perfect audience for which to design Responsibly.me.</p>\n<p><b>Research</b></p>\n<p>My research process can be divided into literary research, industry experts, data collection, and user testing.</p>\n<p><b>Literary Research</b></p>\n<p>Economic papers on how Corporate Social Responsibility affects consumer behavior.</p>\n<p>Articles on consumer behavior and sustainability, demographic research, online shopping trends, and more.</p>\n<p><b>Industry Experts I have spoken with:</b></p>\n<p>Zach Weissmann – Partner @ Connective Impact, a social impact consultancy.</p>\n<p>Paul Pangaro – Associate Professor and Chair of the College for Creative Studies MFA Program in Interaction Design. Cybernetics.</p>\n<p>Daniel Hickey and Scott Collars — NYU Data Services to get guidance on creating a fair ranking system as well as resources for data.</p>\n<p><b>Data Collection</b></p>\n<p>I’ve collected data from independent watchdog organizations regarding Corporate Social Responsibility initiatives. There are a lot of studies and reports on this topic, but this research has not been curated for easy access for consumers. I intend to aggregate these rankings into a scoring system.</p>\n<p>I have collected data from the following sources:</p>\n<p>Greenpeace Catwalk<br />\nGreenpeace Clicking Clean<br />\nGreenpeace Greener Electronics<br />\nGreat Places to Work: Best Workplaces for Women<br />\nGreat Places to Work: Best Workplaces for Diversity<br />\nCorporate Knights: World’s Most Sustainable Companies<br />\nArabesque: S-Ray<br />\nHuman Rights Campaign: Corporate Equality Index<br />\nCorporate Websites</p>\n<p>From these sources, I have collected data on:</p>\n<p>Corporate Equality Index Rating<br />\nNumber of women on Board of Directors<br />\nBest Workplaces for Women Rating<br />\nBest Workplaces for Diversity Rating<br />\nESG Score<br />\nGC Score<br />\nCorporate Knights Sustainability Score<br />\nGreener Electronics Score<br />\nClean Energy Index<br />\nNatural Gas Index<br />\nCoal Intensity Index<br />\nNuclear Intensity Index<br />\nEnergy Transparency<br />\nRenewable Energy Procurement<br />\nAdvocacy of Renewable Energy<br />\nDetox 2020 Plan Rating<br />\nPFC Elimination Rating<br />\nEnvironmental Health Transparency</p>\n<p><b>User Tests/Impact</b></p>\n<p>So far, I have user-tested my platform with industry experts as well as fellow ITPers. Things I’ve learned:</p>\n<p>- A lot of people like the idea and can see the value it can have in the space. This was especially encouraging coming from those in the social impact space.<br />\n- Users don’t need a lot of credibility. They just need a box to check off that lets them know that their choice is good. Give them that option and let them go down the rabbit hole if they want.<br />\n- Users want to participate. They want to see how they are doing. How can we keep shoppers engaged?<br />\n- Users like the Chrome Extension experience. Continue to make it as non-intrusive as possible.<br />\n- Users want to get to the products that do good. Explore gamifying this action.<br />\n- Stats don’t mean much to some people, but mean a lot to others. Information means more. Explore making the stats engaging and real for users. But leave an option for users to go down rabbit holes to find the data they are interested in.<br />\n- Competitor information is the most relevant for users. Low scores are particularly influential.</p>\n<p><b>Precedence</b></p>\n<p>DoneGood is a company that searches thousands of products across hundreds of mission-driven companies and offers discounts to recommended items. They also function as a Chrome Extension, but they do not tell you about a company’s social responsibility efforts.</p>\n<p>GoodGuide provides consumers with the information they need to make better shopping decisions. They analyze product ingredients and rank products based on health and safety. They used to do more work around social and environmental impact but have scaled back these efforts.</p>\n<p>Environmental Working Group is a non-partisan non-profit organization dedicated to protecting human health and the environment. They publish research and consumer guides to help consumers choose healthier products.</p>\n<p>Amazon Smile donates 0.5% of the purchase price of eligible products to the charitable organization of your choice. Beyond this difference, the experience is very much like your ordinary Amazon experience.</p>\n<p>B-Corps is a certification that for-profit companies can acquire by meeting rigorous standards of social and environmental performance, accountability, and transparency.</p>\n<p>Obstacles</p>\n<p>Due to my previous experience in marketing, I initially sought to create a set of marketing campaigns that would use recently available technologies to align a brand’s values with a cause that made sense for them. However, I did not want to greenwash and brands were already hesitant towards those campaigns that have fallen flat (i.e. Burger King and Net Neutrality, Dodge Trucks and Martin Luther King Jr., etc.)</p>\n<p>Thus I pivoted to my current idea. The biggest obstacle has been obtaining data. Datasets have been largely private which means that they are expensive and lack transparency. For this initial proof of concept, I worked with data that was publicly available, and if I take this project further, I hope to seek funding in order to obtain datasets.</p>\n<p>On the technical side, I had never built a web app of this scale before nor have I built a Chrome Extension. In addition to learning how to build an extension, I had to learn how to develop using React.js and MongoDB.</p>\n<p><b>Next Steps</b></p>\n<p>Responsibly.me will aim to track consumer behavior data for both individuals and for corporations. For a Chrome Extension, we can track how many people have downloaded the extension and basic demographic data. We can add cookies to links within our page in order to track users’ clicking behavior to get a sense of their purchasing decisions. We can compile this information into a consumer dashboard (see next steps) that can add value back to users, and we can also use this information to inform corporations on specific steps they can take to improve their CSR rankings and improve their customer funnel. For example, I can go to a company like Nike and let them know that they lost X% of customers that fit Y demographic to Adidas because they lack Z initiatives that are important to them. Using this data, we can create an actionable plan on what a company can do to improve their CSR initiatives to win back customers and improve their bottom line.</p>\n<p>For next iterations of Responsibly.me, I wish to:</p>\n<p>- Build a recommendation engine for similar products from companies with better Responsibly scores.<br />\n- Expand data collection for both companies and users. I want to collect information on more brands and demand transparency from the brands I currently have.<br />\n- Create a dashboard for users to understand their values on sustainability, environmental health, fairness in the workplace and more, based on their shopping habits. Responsibly.me can find out the issues they care about and suggest non-profits and organizations to which they can donate. The platform can push content that is relevant and important to their values in order to keep them engaged and conscious of how their actions impact the bigger picture of social responsibility. We can begin to reward users for the positive actions they take, and users can feel empowered and informed of all the ways in which they are helping to make the world a better place.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ext-min-thumb.png","title":"extension-minimized","alt":"The Responsibly.me Extension","caption":"At a glance, learn how the brand you're shopping at is doing and learn how their competitors are doing."},"topics":[{"name":"Society","slug":"society"},{"name":"Tool\\Service","slug":"toolservice"}],"video_presentation_url":"https://player.vimeo.com/video/269232786","video_documentation_url":"","project_url":"https://jeff-park.com/work/responsibly","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ext-min-thumb.png","title":"extension-minimized","alt":"The Responsibly.me Extension","caption":"At a glance, learn how the brand you're shopping at is doing and learn how their competitors are doing."}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/responsiblymegif2.gif","title":"Responsible.me GIF","alt":"Click on the Extension to learn how Apple's CSR initiatives grade","caption":"Dive deep into the extension to learn how your favorite company's CSR initiatives rank."},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/similar-products.png","title":"similar-products","alt":"Shop from more responsible companies","caption":"Responsibly.me can recommend similar products from companies with higher responsibility scores"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/user-dashboard.png","title":"user-dashboard","alt":"Users can track how responsibly they are shopping","caption":"Based on users' purchasing and browsing habits, Responsibly.me lets users know how responsible their choices are, what values are important to them, and even what causes to donate to."},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/corporate-dashboard.png","title":"corporate-dashboard","alt":"corporate dashboard","caption":"With enough user data, Responsibly.me can even let brands know how their sustainability efforts stand compared to the industry, what their customers care about, and what they can do to improve their score."}]}