{"post_id":427,"student_id":"103","student_name":"Lindsey Daniels","student_slug":"lindsey-daniels","advisor_id":"131","advisor_name":"Stefani Bardin","advisor_slug":"sb4840","project_title":"Basic Ingredients","project_question":"If everyone eats and has food habits, then food is able to be used as a shared language among all people. And in that language, everyone proceeds to reveal a lot about themselves—history, socioeconomic status, personal hang-ups, weird quirks, how they handle time, etc. \r\n<br />\r\n<br />\r\nIt happens inadvertently and without notice; we can’t help but pour ourselves into that which we (in an ideal world) do everyday. \r\n<br />\r\n<br />\r\nAnd if the self is so wrapped up in what we eat and cook, when we offer to feed others, we offer that same self to be consumed. In this way, as we have become an ingredient, we engage in an act of emotional cannibalism.  \r\n<br />\r\n<br />\r\nBut while feeding others is a nurturing and compassionate act, acts of cannibalism usually manifest as a power exchange. Where is the power in my particular exchange? Is it equal?\t\r\n<br />\r\n<br />\r\n<i>Basic Ingredients</i> is a sound installation and personal exercise constructed from  recordings in home kitchens and facilitated discussions around the topic of food. What do people reveal about themselves by talking me through recipes? When moving through their own kitchens? If I ask about breakfast, lazy foods, or coffee, what do they tell me outside of eggs, milk, and sugar? \r\n<br />\r\n<br />\r\nFor my thesis, I ask people about food and they proceed to tell me about everything else. \r\n<br />\r\n<br />\r\nAnd while their answers and actions seemingly all differ, even the sound of the supposed common ones (the shapes of those sounds—how to break an egg, light a stove, measure an ingredient) act as fingerprints, all distinct to the individuals and their spaces. \r\n<br />\r\n<br />\r\nIf eating is an experience of the senses, I challenged myself to channel that experience through the limited scope of sound to make an individual available to be known by others, to be consumed by others.","short_description":"What, besides food, do we offer when when we cook for others? What do we inadvertently make available of ourselves to be consumed?","further_reading":"<p>Being particularly interested in people (nosy) and the things they eat, I read a lot about food. I also read a lot about rituals. Unfortunately if one tries to research “food rituals” most of your immediate results have to do with eating disorders, emotional eating, and how to stop. Your results are the extremes of what people find to be wrong or problematic in their food relationships.</p>\n<p>But arguably we are all emotional eaters. Being one of few things that we engage in on the regular and a small point of control in many people’s lives, food becomes a place where the details about ourselves are allowed to quietly manifest. Adding to that, it’s embedded in many cultures to mark emotional occasions in our human lives with food. Holidays, birthdays, funerals—we can’t actually stop the behavior because it’s baked into us. Despite this, there appears to be this drive to divorce eating from feelings and the self. </p>\n<p>I want to subvert this and instead tie them together.</p>\n<p>I started this process with simple interviews. I asked people people what their comfort and lazy foods were, who taught them to cook (if they learned at all), what was going wrong and what was going right. I couldn’t claim to know the state of a relationship if I didn’t ask.</p>\n<p>And while I learned incredible amounts about these people, I also found that for many - the perception of their food life is negative. They freely tell me all about this even after singing the praises of the ingredients they love, smells they crave, and meals they enjoy. It usually wasn’t even necessary to ask “what’s not working,” I would ask first for what was going well and they would tell me the exact opposite. This trend spoke to the disconnect I started at.</p>\n<p>Moving from these interviews, I hoped that by beginning to pull out the links and similarities in the food stories I was collecting, I could personalize the food experience in a way that allowed you to reflect upon yourself while relating to another. We’re very critical of ourselves and our own habits, but not so much of others. By consuming their stories, I was able to know them. By consuming their food, I wanted the same. Our hands and histories are always felt in the things we make. We are an ingredient just as much as butter or tomatoes. It’s close to “you are what you eat”, but more so “what you’re eating is yourself.” And if eating is universal and everyone does it, everyone can talk about it, it becomes a commonality and somewhat of an equalizer. This is as much an empathy exercise as it is a listening one. </p>\n<p>Another thing that comes up when researching ritualized eating? The lighter topic of ritualized cannibalism. I’m either a cannibal or a disordered eater. So let’s discuss cannibals and eating hearts and the implications of that. While there is a difference when the heart is forcibly taken (domination) versus given willingly (compassion), that heart is the seat of power regardless and its consumption a symbol of the exchange. People had been feeding me their metaphorical hearts through food story and opening up the power dynamic that exists in the act of feeding. It (like heart eating) is also one that changes based on situation. For example, the power in a restaurant kitchen is very different than in one’s mother’s or friend’s.</p>\n<p>Further, if we separate out the “ritual”—it has been shown that the act of ritual increases one’s enjoyment of a thing—even when the ritual isn’t our own. Patience and delayed gratification play a part in this. Are recipes not just rituals written down? meant to be repeated in a specific way and occasionally for specific occasions? </p>\n<p>But there are different ways to write recipes—old vs. new, recipes for those that know how to cook vs. those that don’t, for those we know vs. those we don’t, even for those that have cooked with us vs. those who haven’t (What is a pinch? Can they visualize what the “right” consistency is? Do I need to tell you to peel and dice the potatoes or do you know that’s just what “prepare” means). The way people cook and explain in their own kitchens is very different than what is written for recipe. Because the actions are rote, the space is familiar, while thinking about the cooking they’re also thinking about your presence in it.</p>\n<p>So I became a presence. In my own kitchen I started recording breakfasts and dinners, my morning coffee, even the occasional snack. I talk to myself more than I thought and make an impressive array of strange noises when crying over onions or accidentally spilling coffee into my stove. Of volunteers who let me in their kitchen, the only thing I requested beforehand was for them to make whatever felt good. And then I showed up with an assortment of microphones. Taped to cabinets and set up on shelves, I had participants talk me through process while I tried to follow, asked questions, and captured the sounds of our space. If I asked about spices I also get to learn about grandmas and dads; if I asked where to buy something I often learned about “home.” Sometimes my help was wanted, other times they preferred for me to just sit. The counter was always a mess. </p>\n<p>I had a group of people all crack an egg for me and tell me the best way to eat it. The shape of the soundwave made by that egg is different for every single person. There are one handers, table edge users, and a single individual who needed to use a spoon. One of the best ways to have that egg is some dish I’d never heard of and have to go to Mexico for. </p>\n<p>I pulled out the sounds of people’s stoves lighting and of their knives on cutting boards. </p>\n<p>I have become a collector of sounds but also of stories. Many of them I never directly needed to ask for at all, I just needed to ask for dinner. And they live on in the barest of a kitchen analogue—just counters, a few spoons. The texture and the life of this space is in the sound and from the people who’ve offered themselves to me. Installed as a multichannel piece over four speakers, there are moments of theatrics where everyone is one (all of those stoves lighting at once). And moments of narrative where narrators seemingly move through the space as they moved through their own kitchens. </p>\n<p>I stated previously that eating is an experience of the senses and so the choice to focus so intently on the one perhaps needs some explanation. I started this as a series of interviews and conversations, I wanted to talk to people, to know people. And then I wanted to know them better. I found the voice of the individuals themselves to be powerful and descriptive, the voices of their kitchens to be equally so while full of beautiful textural sounds. And I wanted to let those stories and sounds live! Because they can be just as much of a delight to consume as a perfectly cooked egg.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/icon1.jpg","title":"icon1","alt":"smallIcon","caption":"small icon"},"topics":[{"name":"Identity","slug":"identity"},{"name":"Sound","slug":"sound"}],"video_presentation_url":"https://player.vimeo.com/video/269194946","video_documentation_url":"","project_url":"basicingredients.lindseydoes.com","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/icon1.jpg","title":"icon1","alt":"smallIcon","caption":"small icon"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ld_pic4.jpg","title":"ld_pic4","alt":"ld_cuttingBoard","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/notateAud.png","title":"notateAud","alt":"audition","caption":"notate"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ld_pic2.jpg","title":"ld_pic2","alt":"ld_stove","caption":"open flames"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ld_pic5.jpg","title":"ld_pic5","alt":"ld_micPan","caption":"tofu?"}]}