{"post_id":470,"student_id":"104","student_name":"Laura Kerry","student_slug":"laura-kerry","advisor_id":"131","advisor_name":"Stefani Bardin","advisor_slug":"sb4840","project_title":"Beachcomber","project_question":"<i>Beachcomber</i> is an interactive storytelling experience premised on the idea that the things humans consume and cast aside tell the most vibrant stories about us and the places and times we live in. With objects found on the beach at Dead Horse Bay in Brooklyn—all bits of city trash from the 1850s to the 1950s—and a layer of technology, the installation piece transports users back to the moment in New York City history when each object was used. \r\n<br />\r\n<br />\r\nThe project invites users to choose an artifact from the collection, handle it, and place it onto a platform covered in sand. Using an NFC reader embedded in the platform and a chip on the object, the device recognizes the object and responds with its story, told through projected visuals and audio. This multimedia story environment includes historical documents, archival video, as well as recorded sound and video from Dead Horse Bay. \r\n<br />\r\n<br />\r\nDead Horse Bay offers a story about what’s discarded in New York—not only the landfill objects, but the people who lived and worked on its shores in the 1800s and those whose homes were destroyed and carted to the beach under the dictates of 1950s urban planning. By bringing history alive through tangible objects, <i>Beachcomber</i> aims to recover these discarded bits of New York City’s past and encourage those who live here to imagine what stories the things we consume and throw away might tell about us in the future. ","short_description":"How can technology help expose the historical and personal narratives contained within physical objects?","further_reading":"<p>The truth is that I don’t really like technology. I prefer things: words on textured paper, items with a weight and feel, objects with a history. </p>\n<p>When technology is used in combination with real things, though, it can create delightful, warm, and even magical experiences. It can augment and enhance the familiar, make us see something in  a new way. That’s the idea that has guided many of my past projects and has led me to this one. </p>\n<p>Dead Horse Bay in Brooklyn fascinates me because it allows intimate access to tangible objects that testify to New York City’s past. The beach—formerly called Barren Island—hosted a city landfill whose cap burst in the 1990s, exposing the remnants of neighborhoods razed in 1953 alongside fragments of horse bones from animal refineries built in the 1850s. Seeing and holding these artifacts sparks the imagination and brings the past close, generating images about the people who bought them, used them, played with them, touched them, lost them, threw them away, left them behind. For this project, I wanted to use technology to concretize and enhance what already happens in the imagination. </p>\n<p><i>Beachcomber</i> began on a trip to Dead Horse Bay three years ago and has gone through several iterations over the course of my time at ITP—first, in Marianne Petit’s 'Collective Narrative' class, where it took the form of invented stories of objects’ pasts; then in Alon Chitayat’s class, where I was tasked with exploring the communities around the beach, both historical and present; and finally, in Nancy Hechinger’s 'Cabinets of Wonder,' where it became a proposal for a location-specific museum.  </p>\n<p>For thesis, I began exploring the same place through two new lenses: discarded objects and urban planning. For the former, I drew inspiration from Walter Benjamin’s The Arcades Project; “The Bureau of Suspended Objects,” by artist Jenny Odell, a physical and technologically-basd collection of trash object from the Bay Area; the collection of New York City artifacts in the City Reliquary Museum and a conversation with its director, Dave Herman; the work of anthropologist-in-residence at the NYC Department of Sanitation, Robin Nagle; and the urban archeology of Dead Horse Bay expert Howard Warren. </p>\n<p>The second lens, urban planning, began as a small itch and soon grew to influence the whole project. From talking to Howard Warren, I discovered that all of the landfill on the beach, excluding the animal bones and other factory remnants, was collected between February and March 1953 (he and others have dated it using fragments of preserved newspapers). Instead of a slow accumulation of waste testifying to a gradual change over time, what lies on the Beach at Dead Horse is more like Pompei: lives preserved in a singular moment of interruption. But what was New York City’s Vesuvius?  </p>\n<p>The answer, I found, is Robert Moses. The 'master builder' of New York City altered the entire landscape of the city in the many years that he wielded power, constructing highways, buildings, and bridges, and clearing neighborhoods to make room for them. It is this last part that rendered the objects garbage and brought them to the beach landfill on Jamaica Bay. Carried out in the name of “slum clearance,” a 1950s-era initiative to clean up “ailing” neighborhoods, Moses ordered that certain neighborhoods be razed to make way for urban planning projects that reflected the ideals of the era (and, in many cases, benefited those could provide benefits to Moses). </p>\n<p>To find out what these neighborhoods and their occupants were like before urban planning scattered their remains, I turned to archives. In the Robert Moses Archive at the New York Public Library, though, the people appeared only as numbers in charts detailing the progress of their relocation. In videos from the Duke University Libraries, the Prelinger Archive, and other online collections of promotional, educational, and entertainment films of the era, they are absent altogether. The 1950s of these films was an era of happy children with pink cheeks and good washing habits, floral wallpaper, and small-waisted mothers making elaborate dinners in nice houses. When they appear, the so-called slums and their dwellers are accompanied by words like “<a href=\"https://archive.org/details/ManofAct1955\">filth</a>,” “<a href=\"https://www.youtube.com/watch?v=ngJsA8Zb2l4\">disease</a>.” </p>\n<p>Jane Jacob’s <i>The Death and Life of Great American Cities</i>—in addition to common sense—suggest another picture of the slums and their inhabitants: possibly in need of support, definitely not in need of complete eradication. The destruction of these neighborhoods meant not only removing people from their living spaces, but also their stores, places of worship, neighbors, and friends. In the pieces of decorated china, children’s toys, and glass bottles of cleaning products at Dead Horse Bay, you can find evidence of people who cared about the fixings of their lives. </p>\n<p>I still don’t know exactly which neighborhoods the objects at Dead Horse Bay come from (based on 1954 relocation documents and other sources, contenders include Corlears Hook, Columbus Circle, and Red Hook, among others), and I would love to try and track that information down and meet someone who lived there. </p>\n<p>In the meantime, though, the objects at Dead Horse Bay can help tell the stories of the lost neighborhoods—not only the cleared slums, but also the community of factory workers that existed at Barren Island before their houses were also lost to changing industries in and eventually, for those remaining, also to Moses’ influence. As Dead Horse Bay turns old trash into a living museum of treasures, <i>Beachcomber</i> seeks to highlight what has been discarded in the city's history.  </p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail-lk-e1524493107305.png","title":"thumbnail-lk","alt":"Shoe soles in sand","caption":""},"topics":[{"name":"Narrative","slug":"narrative"},{"name":"Society","slug":"society"}],"video_presentation_url":"https://player.vimeo.com/video/269233054","video_documentation_url":"","project_url":"http://laurakerry.com/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail-lk-e1524493107305.png","title":"thumbnail-lk","alt":"Shoe soles in sand","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/slideshow7-1024x576.png","title":"slideshow7","alt":"bottle on platform","caption":"Fragment of a bottle on sand platform with a projection of the shore at Dead Horse Bay"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/slideshow3.jpg","title":"slideshow3","alt":"Objects at Dead Horse Bay","caption":"A piece of bone, bottles, and a shoe sole on the beach at Dead Horse Bay"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/slideshow1.jpeg","title":"Toothbrush and Projections","alt":"Toothbrush from Dead Horse Bay","caption":"A Fuller toothbrush found at Dead Horse Bay, layered with a projection of a Slum Clearance Committee Document from the Robert Moses Archive"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/slideshow6-1024x576.png","title":"Dead Horse Bay","alt":"Dead Horse Bay view","caption":"Visitors searching for treasure at Dead Horse Bay among the remains from old buildings that used to stand at the site"}]}