{"post_id":103,"student_id":"107","student_name":"Nathaniel Padgett","student_slug":"nathaniel-padgett","advisor_id":"131","advisor_name":"Stefani Bardin","advisor_slug":"sb4840","project_title":"Open Kinetics","project_question":"An exciting aspect of the rapid proliferation of technology over the past decade is that much of it is open and remixable by anyone with access to a computer and the internet. This has created unprecedented opportunities for anyone to contribute to and use these technologies for research, to start businesses, or to make art. \r\n<br />\r\n<br />\r\nBut despite these advances, access to technology is still largely concentrated in the wealthiest communities. A major reason for this digital divide is cost. <i>Open Kinetics</i> addresses this problem with engaging DIY technology kits designed to be affordable and accessible. Students learn programming, electronics, and design by making a simple motion controller used to play free movement-based games that they can also remix and build themselves. Through building these kits, they learn to use technology for their own creative ends, developing technological agency and preparing them for careers of the future.   \r\n<br />\r\n<br />\r\nBy pairing hardware with games, <i>Open Kinetics</i> kits give context to what students can do once they have built their controller. <i>Open Kinetics</i> give students a virtually endless array of experiences to choose from, whether moving a character, playing virtual tennis, or making kinetic art. Because these games are movement-based, they engage students in active, physical participation that facilitates learning. Built for kids ages 8-16 but great for all ages, <i>Open Kinetics</i> turn players into makers and empowers students to contribute to rather than simply consume technology.\r\n<br />\r\n<br />\r\nOne simple project for <i>Open Kinetics</i> is a twist on the Atari classic Pong. In this game has players move paddles up and down the screen to deflect a puck and prevent their opponent from scoring. Rather than using joysticks or buttons, players use the <i>Open Kinetics</i> motion controller they build to move the paddles with their arm movements, making a sedentary game into an active one. ","short_description":"Low cost kits that inspire learners of all ages to explore programming and electronics through movement-based play. The aim of <i>Open Kinetics</i> is to create an affordable, accessible, and engaging platform that teachers can easily bring into their classrooms to foster technological agency in their students. ","further_reading":"<p><i>Open Kinetics</i> is an effort to bridge the digital divide at a time when half of the human population still lacks access to essential digital technologies and an even greater number lack the technical literacy to benefit from the proliferation of open-source software and hardware. According to the <a href=\"http://joanganzcooneycenter.org/publication/opportunity-for-all-technology-and-learning-in-lower-income-families/\">Joan Ganz Cooney Center at Sesame Workshop</a>, one-third of US families living under the poverty line still lack adequate access to digital technologies including high speed internet, further widening gap between the potential of these technologies to transform society and the reality of them doing so. </p>\n<p>By focusing on low-cost technology kits that allow students to build fun games rather than just assemble circuits, my hope is that <i>Open Kinetics</i> can be an approachable access point for developing technological agency, regardless of financial means and comfort with technology. For reference, the motion controller students build with Open Kinetics kits are inspired by <a href=\"https://en.wikipedia.org/wiki/Joy-Con\">Nintendo Switch JoyCons</a> and <a href=\"https://en.wikipedia.org/wiki/Wii_Remote\">Wiimotes</a>, but open-source, console agnostic, and without extra buttons and peripherals.</p>\n<p>On the topic of cost: <i>Open Kinetics</i> kits are made with low-cost, readily available, off-the-shelf components and free games that can be played on computers and mobile devices that classrooms and a student’s family already have. Looking ahead to the future of this project, the costs of the kits can continue to be kept low through open-source development communities, free user contributions to new games, and a small, remote production teams that precludes the need for expensive offices and other expenses that inflated costs of other DIY technology kits. </p>\n<p>My vision for this project is much larger than what the timeframe for thesis allows, but my research, initial prototype, and subsequent testing have created a foundation upon which to build a program for fostering greater agency and enthusiasm for developing technological competency. </p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/OKlogosymbol.png","title":"OKlogosymbol","alt":"Open Kinetics Logo","caption":"Open Kinetics Logo"},"topics":[{"name":"Education","slug":"education"},{"name":"Play","slug":"play"}],"video_presentation_url":"https://player.vimeo.com/video/269233672","video_documentation_url":"","project_url":"http://www.natepadgett.com/2018/05/09/open-kinetics/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/OKlogosymbol.png","title":"OKlogosymbol","alt":"Open Kinetics Logo","caption":"Open Kinetics Logo"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/makelearnmove.png","title":"makelearnmove","alt":"Make Learn Move","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/OKDemo-1.png","title":"OKDemo","alt":"How It Works","caption":"HIW"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/CS_TEST.gif","title":"CS_TEST","alt":"CS Test","caption":"Test at the Clinton School"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/LESGC_TEST-1.gif","title":"LESGC_TEST","alt":"LES Girls Club Test","caption":"User testing at the LES Girls Club"}]}