{"post_id":108,"student_id":"11","student_name":"Jixuan Sun","student_slug":"jixuan-sun","advisor_id":"114","advisor_name":"Adaora Udoji","advisor_slug":"aeu4","project_title":"Xiangrui: Patterns at the Palace Museum","project_question":"With rapidly changing technologies, how can we find a better way to get the most of information, explore hidden context and stories behind museum exhibits, and maximize the experience? How can we connect with millions of artifacts during the limited visiting hours? \r\n<br />\r\n<br />\r\nMy thesis project is based on exploring and building a cutting-edge Augmented Reality mobile application. The focus here is to reveal and present the meaning of iconic symbols and the series of antique collections in the Beijing Palace Museum. The purpose of my thesis is to result in a better understanding of how those symbols exist in the history of Chinese high culture, the content of storytelling is from the research of Chinese mythology and idiom.\r\n<br />\r\n<br />\r\nThe museum's collection of more than 1.8 million items will take hundreds of years to exhibit to the public entirely. There are numerous of mysterious patterns existing in every aspect of the space. Jade ware, textile patterns, furniture, architectures, paintings, etc. Some of them have the abstract shapes that needed to be carefully distinguished by archaeologists. But there are seldom accessible applications on the market that interpret the meaning and tell the story to the public. How to best use your limited visiting hours in the vast museum and find hidden beauty without the need for guides? For me, an AR experience is the most friendly and exciting way to explore the historical place when you walk around with curiosity. ","short_description":"How to use cutting-edge 3D digital media and technology to interpret and communicate the importance and value of contemporary Chinese culture, and maximize the museum experience?","further_reading":"<p>The ultimate goal is to build is a comprehensive app of all the iconic animals related to Chinese culture and covering the exhibitions in the Palace Museum. For my thesis, I choose the red-crowned crane to show my concept. So how to use the app? Open the application and put your mobile phone in front of the exhibits with patterns you want to explore. The app will detect the pattern from the camera and compare to the model trained in machine learning. If there’s a match, the user will get a notification or enter an interface indicates him/her to find the nearest plane. A short animation about the story of the animal pattern will show up from the augmented exhibit. </p>\n<p>I use Unity and ARKit 1.5 to develop the app on IOS platform. For the machine learning part, I have collected positive and negative training set. Positive training set contains patterns of the crane, the image target. Other objects that are not the crane is the Negative training set. I’m using the Convolutional neural network(CNN) in TensorFlow, a machine learning framework for Python to train the data sets. During this process, I have to adjust different parameters to get a better model result. Then I will import the model into CoreML to convert it to a model for IOS platform. This model will be compared with the result from the camera to see whether it is the target or not in Unity. </p>\n<p><b>Context Research:</b></p>\n<p>The earliest theme of ancient Chinese painting is the animal, which is closely related to the first ancestral hunting lifestyle. The original religious view of “all things have spirit” also makes the ancients associate themselves with animals such as birds and beasts. In ancient times, people portray the images of animals such as birds and beasts, flowers and insects on cloth and silk, dyed patterns, lacquerware, murals, jade carvings and bronze inscriptions.</p>\n<p>Since the beginning of the Western Zhou Dynasty and the Spring and Autumn Period, some specific animal images already have the meaning of text symbols, have been given specific cultural connotations, and have been accumulated with the development of the times and cultures. Develop and perfect in the Song and Yuan Dynasties, the tradition “Every painting owns auspicious meaning” reach to the peak in the Ming and Qing Dynasties, and continue so far, blending in traditional culture, which contains a large number of animals and plants figures.</p>\n<p>Some of the animal figures are metaphorical of the social attributes of human beings by their natural characteristics. Some of them carry auspicious meanings in the homophonic and intentional ways, including the myths and legends of dragons and phoenixes, unicorn and other nature animals such as lions, tigers, deer, monkeys, birds, butterflies and others, each has its meaning.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thesis-thumbnail.png","title":"thesis thumbnail","alt":"XIANGRUI – Auspicious Symbols in the Palace Museum","caption":""},"topics":[{"name":"Machine Learning","slug":"machine-learning"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/vimeo/270189645","video_documentation_url":"","project_url":"https://www.jixuansun.space/motiondesign/#/xiangrui-symbols/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thesis-thumbnail.png","title":"thesis thumbnail","alt":"XIANGRUI – Auspicious Symbols in the Palace Museum","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/1-update-1024x576.jpg","title":"1-update","alt":"cover poster","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/3-3.jpg","title":"3","alt":"flying cranes in Unity","caption":"flying cranes in Unity"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/TargetFound-1024x576.jpg","title":"TargetFound","alt":"Documentation","caption":""}]}