{"post_id":409,"student_id":"113","student_name":"Yunho Choi","student_slug":"yunho-choi","advisor_id":"131","advisor_name":"Stefani Bardin","advisor_slug":"sb4840","project_title":"Let Me Give Light","project_question":"How can light and emerging technology create a more empathetic society? According to Ian Ashdown, the Chief Scientist of Lighting Analysts Inc., the thought “giving light” is clearly an abstraction, it shifts the focus from designing for the illuminated environment to designing for people[1]. \r\n<br />\r\n<br />\r\nLighting technology has been developed over the past two centuries, bringing not only countless paradigm shifts in its hardware but also how we think about light and lighting. While we naturally think of light as something which illuminates the space around us, fire occupied a pivotal role in the religious beliefs of in ancient days and now candlelight is still widely used from meditation to social movements like tribute ceremonies or protests.\r\n<br />\r\n<br />\r\nSo I started to imagine—what if the most recent lighting technologies can mimic the restorative properties of ancient light? How can I design them as a new mean of interaction between human and physical environment by giving light, not only for the purpose of illumination? \r\n<br />\r\n<br />\r\nIn my thesis, I used augmented reality and smart light networks in order to create virtual lights and make a connection between them. In the first section of <i>Let me give light, </i> audiences can create and send the virtual light to the physical light by blowing into their smartphones. In the second section <i>Let us give light,</i> multiple audiences can create a collaborative audiovisual sculpture by recognizing a light installation which has an AR marker.","short_description":"<i>Let Me Give Light</i> is a series of mixed-reality environments that repurposes ancient lighting technology in a modern context, inviting audiences to a meaningful and connected experience from their everyday life.","further_reading":"<p>As an interactive designer and digital artist, I have been designing immersive experiences focused on multi-user communication using interactive technology for many years. In this sense, I decided to keep exploring this area and connect people and things more emotionally using different methods but constant perspective for my thesis.</p>\n<p>Candlelight is the first inspiration based on my personal experience. When millions of citizens were shouting out of their comfort zone against the corruption of the past president Park of South Korea two years ago, most of them were bringing candlelights and it thus ended up presenting a magnificent wave of light. Although I was watching them via Youtube only, the visuals and sound caused by them were enough to touch my mind very strongly. Global society gave high praises for the extraordinarily brave and peaceful movement of Korean citizens and I was so proud of that, even though I couldn’t be there and breathe with them. Moreover, there was a Winter Olympic Games 2018 ceremony in Pyeongchang and the LED drone performance was the highlight. It was the moment of the huge change, from the fighting to the celebration.</p>\n<p>With another example of recent candlelight's usage on a large scale called <i>Candlelight Vigil</i>, the memorial of the Virginia Tech Shooting, I felt the candlelights have the power to emotionally connects us, covering a variety of nationality and purposes.</p>\n<p>Fostering a dark environment is another prominent factor. Looking at the spiritual aspects, candlelight is significant as a symbol of focus and enlightenment. Many spiritual traditions have used <i>Dark Room Techniques</i> in the pursuit of enlightenment with a single candlelight. In Europe, the dark room often appeared in underground form as a network of tunnels, in Egypt as the Pyramids, in Rome as the catacombs, and so on. Christians often use the darkroom and candlelights for their praying meanings. </p>\n<p>Today, we are surrounded by numerous artificial lights. We see led screens on our mobile and stand-alone gadgets and countless large-scaled displays can be seen anywhere in the modern architectures and streets in the city. They stimulate us and then we responses every moment of pixels' luxurious transformation. As for smartphones, while some argue smartphone will be dead in the near future, the number of the users is still increasing. According to statistics, the number of smartphone users is predicted to grow from 2.1 billion in 2016 to around 2.5 billion in 2019, with smartphone penetration rates increasing as well.</p>\n<p>With this trend, augmented reality (AR) is undoubtedly one of the most recent and cutting-edge technology. A research paper written by Ana Javornik, a researcher in UCLIC, highlights that AR has emerged as an innovative technology but many of its applications do not offer high connectivity with other parties as for instance social media and are often not linked to a large number of other sources when in AR mode[2]. Therefore, how to design AR for achieving better connectivity with important sources in our life is the last key.<br />\n<i><br />\n[1] Ian Ashdown, 2014, Giving light: A New Philosophy for Lighting Design<br />\n[https://lightinganalysts.com/giving-light-a-new-philosophy-for-lighting-design]</p>\n<p>[2] Ana Javornik, 2016, Augmented reality: Research agenda for studying the impact of its media characteristics on consumer behavior<br />\n[https://www.sciencedirect.com/science/article/pii/S0969698915301351]</i></p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/test_thumnail2.jpg","title":"thumnail","alt":"thumnail","caption":"thumnail"},"topics":[{"name":"Installation","slug":"installation"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/video/269195979","video_documentation_url":"https://player.vimeo.com/video/265460567","project_url":"http://yunospace.com/Let-me-give-light","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/test_thumnail2.jpg","title":"thumnail","alt":"thumnail","caption":"thumnail"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/1_3.jpg","title":"1","alt":"1","caption":"1"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/2_2.jpg","title":"2","alt":"2","caption":"2"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/5_41-1.gif","title":"3","alt":"3","caption":"3"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/6-1.jpg","title":"6","alt":"6","caption":"6"}]}