{"post_id":174,"student_id":"16","student_name":"Richard Lapham","student_slug":"richard-lapham","advisor_id":"114","advisor_name":"Adaora Udoji","advisor_slug":"aeu4","project_title":"Customizing Reality: Immersive Painting","project_question":"How would you customize your reality? In a world where mixed reality eyewear is integrated into our lives, how would you augment the space around you and why would you want to? \r\n<br />\r\n<br />\r\nWith many possible applications of mixed reality, my research focuses on one: immersive digital painting. I’m most interested in the creative potential of mixed reality and with the release of immersive painting softwares, like Tilt Brush and Quill, I explored some of the possibilities offered by this new medium through a series of mixed reality experiments. \r\n<br />\r\n<br />\r\nMy research began with a technical component as I familiarized myself with developing for mixed reality. In this time I created a workflow allowing me to incorporate digital painting assets (including animated digital paintings) with mixed reality as a mobile application. \r\n<br />\r\n<br />\r\nWith this toolkit, I structured the remaining experimentation around three categories: environment, people, and narrative. \r\n<br />\r\n<br />\r\n<b>Environment</b>\r\n<br />\r\n<br />\r\nI reimagined Washington Square Park as a procedurally produced impressionist painting (inspired by Van Gogh and Seurat). In addition to experimenting with my own paintings in a space, I ran user testing with several volunteers in VR to see how people would paint and collaborate with each other. \r\n<br />\r\n<br />\r\n<b>People</b>\r\n<br />\r\n<br />\r\nInspired by several clothing collections, I created personal animations intended to track and overlay onto a person as a speculative digital accessory and a future form of self expression. \r\n<br />\r\n<br />\r\n<b>Narrative</b>\r\n<br />\r\n<br />\r\nI built a database of illustrative paintings that depict a specific action, character, environment, and many other elements that can be combined to create a story. In a mobile application, users can add these paintings to a mixed reality scene and rearrange them to create their own narrative. I plan to work on this application in the future and create a tool that makes mixed reality more accessible for creators to engage with the medium. ","short_description":"With ubiquitous mixed reality on our horizon, I’m creating several speculative environments exploring some of the creative possibilities afforded by this new medium. Using digital painting softwares such as Quill and Tilt Brush, my research illustrates several sceneroes of incorporating immersive media in our everyday lives.","further_reading":"<p><b>Background</b></p>\n<p>I’m a visual artist from New York City who often works in mixed media. Before ITP explored many ways to combine traditional mediums (like oil paint and charcoal) with digital/new media. As part of my practice I painted directly onto photographs by responding and reacting to its content. The jump to then digitally paint onto a “real” environment came naturally as its always been my interest. </p>\n<p><b>Workflow</b></p>\n<p>The process of incorporating digital painting in mixed reality relies on the combination of several applications. I created all static painting assets with either Tilt Brush or Quill and brought them into a mobile mixed reality application through Unity using ARKit. Midway through my research, Quill announced its release of an animation tool that recorded digital paint strokes and provided users with a keyframe sequencer. This was a powerful upgrade and much of my technical research was devoted to integrating these animation (alembic) files in my MR applications. For my narrative experiments I relied on a workaround where I recorded the painting animations and played them in mixed reality as video files.  </p>\n<p><i>Details</i></p>\n<p><b>Environment</b></p>\n<p>In most cases I developed each experiment as a mobile mixed reality application, however some of them needed to be realized as speculative designs in virtual reality (to allow for collaboration and for greater processing power). One of these speculative environments used  a 360 image of Washington Square Park as a backdrop and reimagined it as a procedurally produced impressionist painting (inspired by Van Gogh and Seurat). Since popular artist filters are a very plausible application of how a painting “filter” in mixed reality would be used, I thought it was worth exploring. </p>\n<p>A good portion of my experiments with environments were self serving as I was eager to see how my painting style or “hand” would translate into this space. As the line between personal work and thesis research blurred, I created many smaller immersive experiences that explored some of the characteristics of digital painting and content specific paintings. Assuming a future with advanced content recognition, I imagined how generative paintings would animate real life objects with overlays.</p>\n<p>The workflow to bring immersive paintings in mixed reality is currently tough, but it’s not hard to imagine a mixed reality stylus that allows for immediate painting. I was curious to see how others might react to an environment and how they would contribute to a public mixed reality layer. I held an event and asked several participants to collaborate with each other with the same painting softwares I had been using. Users painted one after another with the prior paintings still present.<br />\n[vimeo https://vimeo.com/265849345]<br />\n<iframe src=\"https://player.vimeo.com/video/265849351\"></iframe></p>\n<p><b>People</b></p>\n<p>In the same way fashion serves as a form of self expression, so too can immersive paintings that act as digital accessories. Using several designer’s recent runway collections as reference, I created expressive, personal animations intended to track and overlay onto a person. Most of the animations were inspired by selections from Comme de Garcon, Gucci, Miu Miu, and Saks Potts. Several other animations explored the relationship between digital painting and the human form and raised many questions on how to address people with respect in mixed reality.</p>\n<p>To show how they would appear in use, I rigged these paintings to characters with walking animations and put them in a Unity scene of Washington Square Park. From this vantage point they will walk through the park indefinitely. </p>\n<p><iframe src=\"https://player.vimeo.com/video/265849358\"></iframe><br />\n<iframe src=\"https://player.vimeo.com/video/265849365\"></iframe></p>\n<p><b>Narrative</b></p>\n<p>In the most promising application of immersive painting I’ve explored, I looked at how it can be used as a narrative tool. Over the course of my research I built a database of illustrative paintings that depict a specific action, character, environment, and many other elements that can be combined to create a story. I designed these assets around five themes with recognizable subjects: prehistoric, space, ocean, forest and city. In a mobile application, users can add these paintings to a mixed reality scene and rearrange them to create their own narrative. I plan to work on this application in the future and create a tool that makes mixed reality more accessible and allows more creators to engage with the medium.</p>\n<p><iframe src=\"https://player.vimeo.com/video/265849381\"></iframe><br />\n<iframe src=\"https://player.vimeo.com/video/265849388\"></iframe><br />\n<iframe src=\"https://player.vimeo.com/video/265849414\"></iframe></p>\n<p><b>Takeaway</b></p>\n<p>Throughout my research and experimentation, I was filled with concerns about this technology. Combined with my interest in the medium, I chose immersive painting as a subject because it was creative and positive in light of all the misuses of mixed reality we imagine. Still, I wouldn’t condone the widespread use of any one of these applications in the real world as it raises questions I’ve been asking myself all year. Here's a few:</p>\n<p>* What’s the danger of obfuscating reality? When everyone experiences a different version of reality it creates an echo chamber that reinforces perspectives, reduces exposure and furthers the gap between people.<br />\n* What’s the value of an artist personally creating something vs. generative/procedural programming?<br />\n* How to animate for people and identity respectfully? The dynamic of fashion shifts from a form of a self expression to having no control over your appearance as others choose how to represent you.<br />\n* What’s the danger of constant stimulation/entertainment? Is there value to boredom? </p>\n<p>Dismal stuff. I have faith humanity will choose to steer away from a dystopian future of echo chambers and pop-ups. If I’ve reached any conclusion its that, if used correctly, immersive media can be a beautiful medium that has yet to be explored. </p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/RL_thumbnail.jpg","title":"RL_thumbnail","alt":"thumb","caption":""},"topics":[{"name":"Narrative","slug":"narrative"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/video/270206568","video_documentation_url":"https://player.vimeo.com/video/265296877","project_url":"https://www.richardlapham.com/customizing-reality","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/RL_thumbnail.jpg","title":"RL_thumbnail","alt":"thumb","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/M1.jpg","title":"M1","alt":"one","caption":"Environment"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/M2.jpg","title":"M2","alt":"m2","caption":"Environment"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/M3.jpg","title":"M3","alt":"M3","caption":"Personal Animation"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/M4.jpg","title":"M4","alt":"M4","caption":"Narrative"}]}