{"post_id":284,"student_id":"18","student_name":"Younho Lee","student_slug":"younho-lee","advisor_id":"114","advisor_name":"Adaora Udoji","advisor_slug":"aeu4","project_title":"The World of Reverie","project_question":"<i>The World of Reverie</i> is a mobile app that allows users to experience a poetic moment in their familiar places. Users can select a phrase from text corpus related to the places and juxtapose the phrase along with scenery with the capability of Augmented Reality.\r\n<br />\r\n<br />\r\nIt will invoke a different emotion about the places that you have never had. The first edition is for myself and those who live in New York City. 18,163 phrases parsed from 451 lyrics inspired by the city are ready for you as a source of inspiration. The whole city will be transformed into poetic space that makes you fall into a reverie. \r\n<br />\r\n<br />\r\nIt is also for experimenting with creating and collecting a dataset about places in a different way. Activities of associating a phrase with a particular place eventually become a process of analyzing and contextualizing the raw data (text corpus). While users take a journey with using the app, they can naturally transform the text corpus into reinterpreted, personalized data. Finally, users can have a collection of their own poetic experiences about places.","short_description":"What if we could experience a poetic moment with text corpus related to familiar places to invoke a different emotion about the places?","further_reading":"<p>I am always interested in storytelling and a source of inspiration has been moments of lives found in physical space. It was natural that photograph used to be my favorite medium because it allows me to capture a slice of reality in a surreal way, recreating a sort of poetic narrative with a rich context of a particular place. But as I grew older and spent more and more times in digital space, I became to take those physical spaces for granted and to feel I lack sensibility. So I have tried various experiments to give us reasons to experience physical space more again. </p>\n<p>When I came to ITP I was fascinated by data as a medium for storytelling because it seems another type of poetic representation about a slice of life. I felt that if taking a photograph is a type of micro way to see it, visualizing data is macro way to do it. But the disadvantage of working with data is that it happens in digital space, so the more I do it, the more I am alienated from physical space. Even though a final visualized piece, such as installation, is often placed on physical space, the preparation process for data visualization (collecting, analyzing, contextualizing), which takes much more time, is conducted in digital space in most cases. So I wanted to find a way of how those process can more relate to or even take place in real places. </p>\n<p>Over the course of research, I have inspired by old paintings in East Asia, works by Jenny Holzer, Robert Montgomery, and Ben Rubin. I investigated how they project idea, thoughts, or emotion in a form of text on physical space to enrich the context of nature, public space, and mundane surrounding. I have made several prototypes about this topic. My thesis project, <i>The World of Reverie</i>, is the most recent experiment on the topic. <i>The World of Reverie</i> is an exploration of two aspects. One is how the juxtaposition of text and place can augment relationship between human and place. And another is how the process of creating and collecting data can be done while we are experiencing a particular place. </p>\n<p>Throughout the project, as the first user, I was able to get out of my limited world, experience more places, engage more deeply with them, and feel a different emotion about them. Also, I was able to discover a new possibility of working with data, which is the same point of view what Giorgia Lupi mentioned in her article, Data Humanism. I hope my work can be one of examples of her claim that \"we have to reclaim a personal approach to how data is captured, analyzed and displayed, proving that subjectivity and context play a big role in understanding even big events and social changes — especially when data is about people.\"</p>\n<p>As next step, I would like to expand the app into more cities so that users can have their own poetic experience with their own physical space. </p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail1.jpg","title":"thumbnail","alt":"thumbnail","caption":""},"topics":[{"name":"Data","slug":"data"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/video/270207734","video_documentation_url":"https://player.vimeo.com/video/265859762","project_url":"http://iunolee.cafe24.com/portfolio/the-world-of-reverie/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail1.jpg","title":"thumbnail","alt":"thumbnail","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/carousel1.gif","title":"carousel1","alt":"carousel1","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/carousel2.jpg","title":"carousel2","alt":"carousel2","caption":"carousel2"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/carousel3_1.jpg","title":"carousel3_1","alt":"carousel3_1","caption":"carousel3_1"}]}