{"post_id":500,"student_id":"2","student_name":"Alex Fast","student_slug":"alex-fast","advisor_id":"114","advisor_name":"Adaora Udoji","advisor_slug":"aeu4","project_title":"See the Ball","project_question":"What makes a baseball player good? How many home runs he hits? How many strikeouts he records? <i>See The Ball</i> answers that question in ways the baseball community is yet to: through interactive, and engaging data visualization. \r\n<br />\r\n<br />\r\nBaseball has reached the age of Big Data and it’s messier than ever. The race to find the next great catch-all metric has left in its wake a myriad of statistics splashed onto a spreadsheet. Go to Fangraphs.com, baseball-reference.com or any other baseball website and search for any player. You’ll be met with dozens of rows and columns of data with esoteric names like wRC+, bRUP, fWAR, and wBBZ. Heard of them? I hope not because half of them are made up. While a sabermetrician may be able to keep up with and comprehend the latest metrics the most die-hard fans are often left scratching their head when trying to figure them out. The usage of bland spreadsheets to convey this often complex data isn’t helping either. \r\n<br />\r\n<br />\r\n<i>See The Ball</i> aims to fix that by presenting the same data in a clearer, more intuitive way so that fans and non-fans alike can both understand and enjoy America’s past-time.","short_description":"How can we change the way baseball data is represented to make it more intuitive, contextualized and interactive?","further_reading":"<p>Aaron Judge hit 52 home runs in 2017. Nolan Arenado recorded 130 runs batted in. Who would you rather have on your team? For the first 130 years of baseball’s existence the answers to these questions were fairly simple. Statistics like batting average (AVG), runs (R), RBI, and home runs (HR) were used to determine success for hitters while wins (W), strikeouts (K’s), walks (BB) and earned run average (ERA) were used for pitchers. In 1977 however, a night shift security guard at a pork and beans cannery published the first iteration of a series of books that would change the sport of baseball for the considerable future. That night security guard was Bill James.</p>\n<p>You may have heard of Bill James in regards to his relationship with MoneyBall. Though he didn’t write the book, or appear in the movie, it was Bill James creation that led to what the film and book are synonymous with: Sabermetrics. Sabermetrics - the scientific and objective analysis of baseball; based off the acronym SABR or Society for American Baseball Research - changed the way in which baseball players were measured. Wins and RBI became less relevant whereas sabermetrics like weighted on base average (wOBA) and weighted runs created (wRC) became more valuable. The question in and of itself began to shift from what makes a player good to why is a player good. </p>\n<p>To this day, new sabermetrics are introduced for the purpose of answering that question. The issue however is that the pace in which sabermetrics are being introduced far surpasses the pace in which the data is visualized. As a result, websites and communities dedicated to the study of sabermetrics spend a majority of their day looking at vanilla spreadsheets that in no way show the nuance and complexities of the data. Even worse, because these new statistics are being represented the same way the old statistics were, a correlation is being drawn that is entirely negative. The mere proximity of one statistic to another can allude to a correlation between stats that may not be there. Or if that correlation does exist, a spreadsheet gives no indication to how strongly they correlate. For example, while slugging percentage (SLG) might appear next to wOBA on a spreadsheet, the proximity itself provides no indication for how strong the relationship between the two may be. </p>\n<p>Fangraphs is one of the most prominent baseball statistics websites. Think of the site as the ESPN of the baseball statistics world. A team of writers produce fantastic content daily and millions of pieces of data can be found there in dozens of spreadsheets. One of the site’s main writers, Paul Sporer, took time to have a discussion with me about why the site doesn’t visualize more. “We’d love to of course, the site needs more visualization,” Sporer admitted, “the issue that we run into is how we can begin to visualize our data without alienating our users.” Sporer brought up an important point that was echoed by others like Andrew Perpetua of xStats. Certain websites that have made a name for themselves with baseball statistic spreadsheets are reticent to change the way they present their data for fear of alienating an often-stubborn fan base. The same goes for Baseball-Reference, another website that baseball fans go to in order to figure out how players are performing, as well as ESPN and Major League Baseball’s own website. I collected images from all of them to highlight just how little visualization they were utilizing. </p>\n<p>The lack of visualization is troubling. Not because baseball data deserves to be represented in a more visual way—while that’s a valid reasoning, it’s a more superficial one—but because spreadsheets in no way, shape or form provide the nuance and context that baseball data in and of itself highlights. For example, the formula for wOBA involves plate appearances (PA), singles (1B), doubles (2B), triples (3B), home runs (HR), non-intentional base on balls (NIBB), and hit-by-pitch (HBP). No single baseball website has wOBA anywhere near the statistics that comprise it. Instead, 1B, 2B, 3B, HR, PA, and HBP are in an entirely separate location and NIBB doesn’t even appear! A user has to find the walks (BB) and subtract them from the intentional walks (IBB) to figure out that statistic for themselves.</p>\n<p>In order to remedy this issue, I created an interactive sketch using Processing that puts all of these metrics in the same place so users can understand their relationship better. I took Joey Votto’s statistics—a first baseman for the Cincinnati Reds—from the year 2008-2017 and placed them all in a way that highlights how they are correlated so users can get a clearer picture of what led to his particular wOBA that year.</p>\n<p>There are thousands of baseball players that will play in a single season. There will be dozens of second baseman and catchers, hundreds of outfielders and pitchers. Yet, no website compares any particular players performance to what their peers are doing. For example, if I go to the player page for Chris Archer- pitcher for the Tampa Bay Rays - right now, I can see that he’s sporting a 3.71 SIERA (a sabermetric used to better measure a pitcher’s abilities that should be read similarly to ERA). The page however leaves me with no way of knowing how good or bad that 3.71 SIERA is. I have to go somewhere else entirely to see that Archer’s SIERA is 43rd in the Majors amongst qualified starters. Is that good? I then need to go somewhere else to see that the league average is 3.76. Only then can I get a semblance of where Archer stands contextually compared to other pitchers. I created a visualization using Tableau software that takes earned run average (ERA), fielding independent pitching (FIP), and skill-interactive ERA(SIERA) and places them in the same place on a bar chart. It also compares them to the league average to give a much more accurate and contextual picture of a pitchers performances throughout the years. </p>\n<p>Even physical information pertaining to a players injuries are visualized on spreadsheets—something that was very easily remedied. Pitcher Hyun-Jin Ryu of the Los Angeles Dodgers has been oft-injured. Rather than look at a spreadsheet to see when, where and how long he was injured, I used Processing to create an interactive graphic that allowed users to hover over parts of his body to see his injury information. The simple act of visualizing this data in an interactive way led me to realize that Hyun-Jin Ryu was injured on the left side of his body very frequently. This is useful both for me as a fan, but for someone in a front office as well as they can now change his training regimen to help strengthen his left side. </p>\n<p>With the creation and success of sabermetrics, a bevy of new, exciting baseball data was introduced. Rather than parse through this new information and figure out how it could be presented in an interesting way, a majority of websites slapped it onto a spreadsheet and looked for new, better sabermetrics. This however was not the case for Daren Willman, the creator of Baseball-Savant. Daren started visualizing data a few years ago and did it so successfully that Major League Baseball acquired his website. The visuals coming out of Baseball-Savant show that the industry may be moving in a different direction which is very encouraging. Willman’s visuals are intuitive, fun, and easy to understand. They are colorful, exciting and leave you curious for more. Baseball-Savants success is proof that there was a dearth in the baseball community for data visualization, and See The Ball joins Daren Willman in filling that void.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Berrios.jpeg","title":"Berrios","alt":"berrios","caption":"Berrios"},"topics":[{"name":"Data","slug":"data"},{"name":"Narrative","slug":"narrative"}],"video_presentation_url":"https://player.vimeo.com/video/270186665","video_documentation_url":"","project_url":"","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Berrios.jpeg","title":"Berrios","alt":"berrios","caption":"Berrios"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ThesisPhotoOne.jpg","title":"ThesisPhotoOne","alt":"Data Viz","caption":"For the most part, this is the current way in which baseball data is being visualized."},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ThesisVizTwo.jpg","title":"ThesisVizTwo","alt":"","caption":"A visualization I created that shows each injury a player has had in his career."},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/DataVizThree.jpg","title":"DataVizThree","alt":"Data Viz Three","caption":"A more colorful way to show a player's year-by-year statistics"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/DataVizFour.jpg","title":"DataVizFour","alt":"Data Viz Three","caption":"An example of ways Daren Willman is moving the baseball data visualization industry forward"}]}