{"post_id":313,"student_id":"22","student_name":"Christina Hall","student_slug":"christina-hall","advisor_id":"123","advisor_name":"Kathleen Sullivan","advisor_slug":"kms829","project_title":"The Masks I Wear","project_question":"<i>The Masks I Wear</i> is a solo live performance, alternative documentary that explores the harassment experienced by women in industry. The artist has collected personal stories from four women who have experienced harassment in a professional environment and then “wears” projected motion controlled digital masks to portray the collected stories. \r\n<br />\r\n<br />\r\nEach performance sits only four audience members, each paired with a narrative from a different woman. Through the physical interaction of pushing a button, audience members will be able to influence how much of the narrative is told.  This interaction will challenge the audience, putting them in a position of power and control, deciding how much of the emotional story to experience. \r\n<br />\r\n<br />\r\nThe artist sits on a rotating stool with the audience surrounding her in a circle. An element of privacy is added by dividing the space between each audience member, allowing them to feel comfortable with varying degrees of interaction during the performance.  \r\n<br />\r\n<br />\r\nThe artist will be using a combination of facial tracking software and projection mapping to portray the sketched face of the woman that have gone through the harassment or assault.","short_description":"This is an investigation to determine if audience interaction changes the impactfulness of a narrative. This study is conducted by way of a one-woman show, utilizing face tracking technologies and interactive elements. The performance explores stories of harassment experienced by women and the power dynamics responsible for it.","further_reading":"<p>In act one the artist rotates on the stool and gives an introduction for each woman whose story will be told. The audience members will have no ability to interact with the narrative during this act. </p>\n<p>In act two the artist will wait for an audience member to request attention to continue telling one of the women’s stories. A short amount of time after starting to tell the story other audience members will be given the opportunity to demand attend from the artist, thus taking control of the narrative. At this time the artist will begin telling the narrative of the demanding audience member that they are paired with. This pattern continues for a set duration.</p>\n<p>In the third act, audience members will be able to request attention and have their paired narrative told with no delay between requests. The artist will attempt to keep up with the demand of the audience, and the artist’s end goal is to portray the most important aspects of each story.  Because the narratives are controlled by the demand of the audience, each performance will be unique. </p>\n<p>The artist’s goal for this project is to better understand how the audience reacts and feels emotionally when given control to influence the narrative.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/HallC_TMIW_thumbnail320x240.jpg","title":"HallC_TMIW_thumbnail320x240","alt":"tmiw","caption":""},"topics":[{"name":"Narrative","slug":"narrative"},{"name":"Performance","slug":"performance"}],"video_presentation_url":"https://player.vimeo.com/video/269185529","video_documentation_url":"https://player.vimeo.com/video/265233154","project_url":"www.themasksiwear.com","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/HallC_TMIW_thumbnail320x240.jpg","title":"HallC_TMIW_thumbnail320x240","alt":"tmiw","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/TMIW_Chris1.jpg","title":"TMIW_Chris1","alt":"the-masks-i-wear","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/TMIW_Chris2-2.jpg","title":"TMIW_Chris2-2","alt":"live-show-tmiw","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/TMIW_Chris3-1.jpg","title":"TMIW_Chris3-1","alt":"all-screens","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/TMIW_Chris4.jpg","title":"TMIW_Chris4","alt":"the-masks-i-wear-4","caption":""}]}