{"post_id":456,"student_id":"23","student_name":"Chester Dols","student_slug":"chester-dols","advisor_id":"123","advisor_name":"Kathleen Sullivan","advisor_slug":"kms829","project_title":"On Otherness and Queer Affect","project_question":"<i>On Otherness and Queer Affect </i>was designed in order to encourage conversations around queerness and raise awareness around biopolitics and queer issues. It is an interactive installation of intersex sculptures which exhibit life and sentience through light and sound. \r\n<br />\r\n<br />\r\nThe Queer identity is defined by that which is normative. Queer, unlike normalcy, is neither constant nor clearly defined. It is outside of the gender binary of male and female, and outside of the heteronormative dichotomy of man and woman. Inherently, those who identify as Queer are Othered by those around them because their identity exists outside of what is normal or ‘natural’ to these communities.\r\n<br />\r\n<br />\r\nIn society, we often equate the identities of those who are Other to us to animals, beasts, inanimate objects, and degrading ideas in order to reduce the power of these minorities within the larger normative system. \r\n<br />\r\n<br />\r\nThe sculptures which I have made are designed to be fantastical, alluring, human, familiar, but also alien and undefined. They are animated through technology and take on an Otherness through life. From afar, these objects are radiant and affect the space around them, exhibiting a vibrant performance of light and sound. As you move closer to them, their animated performance diminishes. Thus, your presence affects their ability to exert their will within their space.\r\n<br />\r\n<br />\r\nYour intrusion upon the space creates a power shift and tension between you and these sculptures. Why is your presence silencing? Does their lack of reaction inhibit your will as well? The work is intended to evoke thoughtful reflection within the viewer and generate conversation around the ideas of queer otherness.","short_description":"My thesis is about communication. I question whether popular aesthetics can be used as a form of ethos to engage in conversations around LBGT queerness. Or in other words, can beauty and/or popular taste be used as convincing forms of rhetoric to entice, disarm, or persuade audiences to engage in conversations around Queerness?","further_reading":"<p>Mel Chen, Associate Professor of Gender and Women’s Studies at UC Berkeley, discusses the voice of queer groups in their book <i>Animicies: Biopolitics, Racial Mattering, and Queer Affect</i>. Chen dives into the ways in which the minority affect is reduced through objectification and dehumanization. They explain that ‘animacy hierarchies’ structure the weight in which a minority community can influence policy. The ability to have voice within our political system is dependent on how a minority is compared to or perceived as human. This animalization of Otherness is a tool used in the process of abjectification, a phenomenon in which when confronted with the Other, a subject is humiliated and reduced to nothingness. Specifically, LGBTQ communities have been identified as sinful, beastly, demonic, lustful, confused, mentally ill, physically lesser, diseased, and disabled. These identifiers are intentional comparisons used to describe and render queer individuals as incapable or without ‘justified’ power to operate within a healthy human society. Identification (not to be confused with identity) is a sociopolitical tool used against minorities to establish and maintain power by the dominant more normative population.</p>\n<p>However, understanding these power dynamics and issues around oppression is not enough to facilitate a conversation. If queerness is outside of the common discourse, it is understandable, that as a gay man, my perspective on queerness and minority equity is also outside of the common discourse. I started to question methods of engagement around these topics. Often, if not always, pedantic dictation is not the most persuasive argument. Even with data, reason, emotion, and good intention, it is hard to convince or engage others about topics of any controversy. We all have biases, but how can we curb these biases to have more productive dialogues?</p>\n<p>After reading a research paper by Adam Berinsky, a political science professor at MIT, <i>Rumors and Health Care Reform: Experiments in Political Misinformation</i>, I realized we can't take a direct approach when confronting a group with an idea disturbing to their personal beliefs. We must establish credibility with an audience before attempting dialogue. Why should they listen or care? If we can establish common ground, we can talk civilly. In a sense, this commonality is a form of credibility, or ethos, a tool used in debate to persuade and curb confirmation bias.</p>\n<p>This is where my research started to focus on spectacle, aesthetics, and narrative, which are modes for establishing credibility within advertising strategy and political persuasion. In Kant’s <i>Critique of Judgement</i>, he says that things which are beautiful are inherently delightful and good to us regardless of logic. Things which are beautiful, he says, are pleasing, and ‘that which pleases on its own account we call good in itself.’ Equating “beauty” to that which is good or trustworthy is a common theme in critiques of aesthetics. Obviously, beauty and goodness are not equal— however, we have a hard time discerning what is good from what is simply pleasurable.</p>\n<p>It was from this investigation that I reflected on interaction design and subsequent pop-culture devices used to satiate, seduce, and captivate audiences. ‘Successful’ interaction design is that which sustains interest and continued play. Consequently, we could say that successful interaction is often that which is familiar and aesthetically pleasing enough for high accessibility and intuitive exchange.  If something is too unfamiliar, it can be unapproachable. For aesthetics, if something is too foreign, it can be undesirable. And for ideas, if something is too disturbing to our personal beliefs, it will be rejected. Thus, that which is familiar and fortifies our beliefs is beautiful and good (or at the very least pleasing enough to warrant our time and curiosity). And that which is obscure and foreign is ugly and evil.</p>\n<p>How can aesthetics be used to curb these biases? Interactive designers and artists orchestrate performance and technology to create accessible, captivating work which can be used as vehicles for expression and meaning. The light and sound of the installation creates spectacle and curiosity to draw viewers in, but are also used to create an illusion of life. Formally and materially, the sculptures were made to feel precious and elevated, coveted and of value. The sensuality of the forms are familiar and human, but the amalgamation of the forms allude to potentialities outside of the gender binary. </p>\n<p>As one enters the installation, the sculptures display life and radiance.  As one moves closer, their vibrance diminishes. This is a play on tropes of interactive design. Typically, with exchanges of interaction design, the visitor is empowered through engagement.  As they put themselves into the system, the more they get out. The feedback is usually one to one.  This gifted feeling of control can feel magical to a viewer. In the case of <i>On Otherness and Queer Affect</i>, the visitor is removed of this control. Instead of getting more performance out of the sculptures, the opposite happens.  The sculptures diminish, exhibiting less life and brilliance. The play on this creates tension between the visitor and sculptural bodies within the space which they now share. Your presence is literally silencing, similar to the silencing which minorities feel within a system of overwhelming oppression. You silence their will, and your desires are silenced in return.</p>\n<p><i>On Otherness and Queer Affect</i>, and much of my other work, is intended to create awareness and discourse with individuals outside of these isolated conversations. Through spectacle, accessibility is made and exchange may begin. Conversation can be a process of learning and unlearning prejudice, and it is my hope that my work resonates in some way with viewers in order to evoke productive discourse around topics usually seen as problematic. </p>\n<p><i>Tangentially:</i></p>\n<p>This project has allowed me to start thinking of 3D printing as a Queer medium.  Based on the theories of queer thinkers, Judith Butler, Kathy Acker, and Eve Sedgwick, I have started to appreciate the capacity and potential for 3D printing to express queer forms. The voices of POC and LGBTQIA people are often debilitated by the language and tools afforded by normative modes of expression. Language, ideas, spaces, objects, and materials are gendered. Depending on history and use, most everything has been claimed by specific groups and identities. Bathrooms are gendered spaces. Baseballs are gendered as male. Materials are gendered by the tools and things they are used to make. For example, ceramics, although plastic and malleable, have been historically used to make domestic goods by craftswomen and thus is often charged with female undertones. </p>\n<p>3D printing, however, is a novel technology, which in its infancy has not been claimed for use by any group or gender. Artists, engineers, and designers have all picked up this DIY fabrication method to make objects which express ideas outside of convention. If we consider gender to be performative, we could say that objects, spaces, and materials perform in ways that reinforce assumed gendered roles. Thus, 3D printing is liberating because it allows for creators to make objects which can be fluid in their gender.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/THUMBNAIL-Converted.jpg","title":"THUMBNAIL","alt":"On Otherness and Queer Affect","caption":"On Otherness and Queer Affect"},"topics":[{"name":"Identity","slug":"identity"},{"name":"Installation","slug":"installation"}],"video_presentation_url":"https://player.vimeo.com/video/269185609","video_documentation_url":"","project_url":"http://www.ckdols.com","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/THUMBNAIL-Converted.jpg","title":"THUMBNAIL","alt":"On Otherness and Queer Affect","caption":"On Otherness and Queer Affect"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Render_of_3Forms.jpg","title":"Render_of_3Forms","alt":"Scale drawing with 3 forms","caption":"Render of 3 Forms with Scale Figure"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Body2.jpg","title":"Body2","alt":"Body_2","caption":"Body 2:  3D Printed Resin"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Body2_detail.jpg","title":"Body2 Detail","alt":"Body 2 Detail","caption":"Body 2 Detail"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Glow.jpg","title":"Body 2 : Projection Map","alt":"Projection Mapping through body 2","caption":"Body 2 : Projection Mapping"}]}