{"post_id":414,"student_id":"28","student_name":"Marco Guarino","student_slug":"marco-guarino","advisor_id":"123","advisor_name":"Kathleen Sullivan","advisor_slug":"kms829","project_title":"Genealogy of a Rhythm","project_question":"<i>Genealogy of a Rhythm</i> tells the ethnomusicological story of Candombe (Afro-Uruguayan music and dance) using modern tools such as 360 cameras and motion capturing. In virtual reality, I give the viewer a glimpse into some of the lives of the people that take part in Candombe, presented as a non-linear narrative.\r\n<br />\r\n<br />\r\nThe motion capturing portion of the project documents the bodies of the drummers, (and in the future, of the dancers) to collect data of body movements and create anthropological data sets of these movements. \r\n<br />\r\n<br />\r\nFuture work would include a Music Information Retrieval approach to dissecting the rhythmic patterns of Candombe, as well as other prominent Afro-Latin rhythms. This information can then be presented as a family tree of rhythmic patterns, depending on similarities and differences between rhythms. This is an expression of advocacy for a musical form as well as a proposal to document cultural information with the tools of our time.","short_description":"<i>Genealogy of a Rhythm</i> tells the ethnomusicological story of Candombe (Afro-Uruguayan music and dance) using modern tools and approaches with virtual reality, non-linear storytelling, and motion capturing technology.","further_reading":"<p><i>Genealogy of a Rhythm</i> tells the ethnomusicological story of Candombe (Afro-Uruguayan music and dance) using modern tools such as 360 cameras and  motion capturing. In virtual reality, I give the viewer a glimpse into some of the lives that take part in Candombe, presented as a non-linear narrative. The motion capturing portion of the project documents the bodies of the drummers, (and in the future, of the dancers) to collect data of body movements and create anthropological data sets of these movements. Future work would include a Music Information Retrieval approach to dissecting the rhythmic patterns of Candombe, as well as other prominent Afro-Latin rhythms. This information can then be presented as a family tree of rhythmic patterns, depending on similarities and differences between rhythms. </p>\n<p>In the 360 virtual reality documentary, there are a spectrum of identities, including a young Swedish dancer whose parents are from the Ivory Coast, a sixty-six year old Escobero (Carnaval character), a well known Montevidean drum builder, and a group of French filmmakers making a documentary about Candombe. Through a non-linear approach to storytelling, the user will have the ability to choose between storylines, which, at times, intersect with one another. </p>\n<p>Motion Capturing and Music Information Retrieval (machine learning for music) are two other tools utilized to tell this story. I find these to be powerful tools to create modern anthropological data to subsequently compare and contrast patterns within Afro-Latin music and dance. In the future, I will create an open source repository of this data with a hosting service such as Github, which will allow musicians, dancers, and researchers to have access to the data with the prospect of building a network of information that we can all benefit from. There is already a community of academics that are working in the fields of music and dance technology such as Luiz Naveda in Brazil, Carlos Guedes in NYU-Abu Dhabi, Juan Bello in NYU-NYC, and Magdalena Fuentes in Uruguay, for which this information would be invaluable. This work would also honor and contribute to the work of those that came before, such as Fernando Ortiz (Cuba,) Luis Ferreira and Gustavo Goldman (Uruguay,) Waldo Frank and Alan Lomax (USA.)</p>\n<p>Whereas Alan Lomax’s approach was to collect data via Choreometrics (corporal patterns) and Cantometrics (rhythmic and melodic patterns) to determine cultural lineage (Global Jukebox) Genealogy of Rhythm takes an integrated and boundless approach, employing rhythmic and corporal data sets presented in tandem with a storytelling element.</p>\n<p>The impetus for my thesis project is multi-faceted. It is an expression of advocacy for musical forms in a time when the lines that are drawn on what is and isn’t cultural appropriation continue to blur. When these circumstances have turned into a hyper, one sided consumption of music and artists aren’t credited for their creations, <i>Genealogy of a Rhythm</i> wants to put geography and faces back on the music and the artists who have been and continue to be exploited. My aim is to build a paradigm that raises the standards towards recognition of the work, thus giving the microphone back to the creators. </p>\n<p>I also want to remind everyone in the environment I am in right now (ITP) of how powerful the drum (and the body) is as a form of communication. I want to juxtapose the primordial with the modern, and despite all of the technological advances we make, the drum will always resonate at the core of our soul.  This project is also a declaration of my undying love for the Americas and its history. </p>\n<p>A bit about how I arrived at this project:</p>\n<p>My journey, from the time of applying to ITP all the way to thesis, has been a complex dynamic of wanting to escape my passions, in search of new ones, and arriving at a place where they have inevitably integrated into each other to create a singular, cohesive project at an intersection where these passions have somehow encountered each other by chance. Two passions that I reference in particular are music and identity.<br />\nDuring my undergraduate years, my time was divided between working on musical projects and sinking my teeth into my area of study, Sociology and Latin American Studies. </p>\n<p>Through my academic journey I discovered a pocket of academia relentless in the search for explanations of greater scale human behavior, simultaneously falling in love with the story of the ‘Discovery’ of the Americas, and deciphering exactly how I fit into it as a child of the Americas. </p>\n<p>The story of how I identify myself in the present has much to do with this academic process, as well as the type of music I chose to make and how those avenues led to my own ‘discovery’ of the Americas. One musical experience led to another and ultimately, they bled into each other. The same people that I collaborated with, musically, people from different places, Brazil, Ecuador, Cuba, Colombia, and Panama, were people that brought me to some of these places, furthering my growth as a musician, an observer, a human, and as, what I like to call a ‘Pan-American’. I also brought them to Uruguay and introduced them to my friends and a family of Candombe drum builders (who were an integral part of my thesis). </p>\n<p>It was at this time that I started conceptualizing the idea of a shared American experience, a la “spiritual synthesis” of Waldo Frank. There is something unifying in the differences, in the syncretism, in the non European, non African, non Native, yet ‘New Native’ that is all of those identities at once, emerging in the Americas. It was present in the modernist literary movement, where authors like Ruben Dario (Nicaragua) would come to define the painful, yet evident conflict of identity of what it meant to be American. It was the dawn of the modern world, a time when political borders were in constant ebb and flows, and lawless cultural indicators and models were more a consequence of geographical limitations than anything else.</p>\n<p>Fast forward to my thesis at ITP and the work that led up to it. The first suggestion of the direction I went in was in my PComp final and Interactive Music Final. In PComp, Grau PucheR ecarens and I built a handheld drum machine that would be apt for live performance. Although we were shortsighted on technological prowess, it turned out to be a successful design, complete with a switch that let the user choose the continent they wanted their instrumentation to be from. </p>\n<p>During my second semester at ITP, I built an abstract map of Latin America in P5.js, with buttons on the capitals of each country that played the Afro-Latin Rhythm that pertained to it. Although a super simple design and execution, this project brought me to a comfortable place to reflect in. I finally felt like I could ask myself some questions like : How could I make this map experience more meaningful? What story am I trying to convey? Where do I fit into this story? Why should (I) tell this story?</p>\n<p>It wasn’t until the fall semester of 2017 when I started to answer these questions. It was a particularly significant and momentus semester for me. The classes I took tackled most of the corners I was exploring, including Nancy’s Cabinets of Wonder, Marina’s Temp Ex, an Ethnomusicology class in the Music department and Digital Signal Theory in the Music Tech department. While the Ethnomusicology class gave me an academic paradigm to draw from, and Signal Theory was useful as a foundation for the technical aspects of Music Information Retrieval (machine learning for music) Cabinets of Wonder and Temporary Expert gave me the platforms of concept and design. </p>\n<p>I started dreaming of a wondrous installation of Afro-Latin Rhythms, of a spatialized audio telling the story of the Afro-American experience through the story of rhythmic patterns in the Americas.</p>\n<p>I conceived one of my most ambitious and successful projects during this time. The Latin America drum machine. Designing the drum machine gave me the opportunity to focus on how I could visualize rhythmic patterns and turn them into something that is approachable from the user experience standpoint. Despite it being an iteration of my P5.js map sketch, albeit a much cleaner design with refined functionality, it led me to think about the next step. What I wanted to accomplish was a family tree of rhythmic patterns, from Latin America to Africa, and the Middle East. It also obligated me to think about scale, in accordance to content. If I was to embark on a collection of rhythmic patterns and turn them into cohesive data, I couldn’t leave any out. And if I was to start with Brazil alone, I would have amassed 60 plus rhythmic patterns. This is ambitious work, to say the least. It then became a question of returning to a nucleus of some sort, although that nucleus was still undefined. </p>\n<p>After brainstorming, I decided to start with my own cultural nucleus, Candombe.<br />\nIn Cabinets of Wonder and Temporary Expert I decided to do all the heavy lifting for what would become my thesis. I conceptualized the theme for my Cabinets of Wonder final, and did most of the research in Temporary Expert. During this time I built the Latin America drum machine, as well as creating the pamphlet for my fantasy exhibit, 'Genealogy of a Rhythm,' which eventually turned into my thesis. </p>\n<p>Although the fantasy exhibit was intended to be an installation, I wanted to find the most practical way of immersing the audience into an experience, with time, money, and injury as constraints. This led me towards 360 film making. Through a 360 lens, I wanted to give the viewer the experience of being there (in Uruguay during Carnaval) with me, through my documentation process of this process. The film is essentially a documentation of my documentation.</p>\n<p>Also included in the project is a motion capturing session of three Candombe drummers from New jersey, as well as a data set of isolated Candombe drumming on separate tracks. </p>\n<p><i>Books I've read during this time:</i></p>\n<p>1. \"Blackness in the White Nation (a History of Afro-Uruguay)\" by George Reid Andrews</p>\n<p>2.\"The Information\" by James Gleick</p>\n<p>3.\"Rhythms of the Afro-Atlantic World\" Edited by Mamadou Diouf and Ifeoma Kiddoe Nwankwo</p>\n<p>4.\"Los Tambores del Candombe\" by Luis Ferreira</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/4.jpg","title":"4","alt":"Genealogy of a Rhythm","caption":"Genealogy of a Rhythm"},"topics":[{"name":"Culture","slug":"culture"},{"name":"Data","slug":"data"}],"video_presentation_url":"https://player.vimeo.com/video/269195082","video_documentation_url":"https://player.vimeo.com/video/259014282","project_url":"marcofernandoguarino.com","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/4.jpg","title":"4","alt":"Genealogy of a Rhythm","caption":"Genealogy of a Rhythm"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/123-1.png","title":"123","alt":"Candombe","caption":"Candombe"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/321-1.png","title":"321","alt":"Candombe","caption":"Candombe"}]}