{"post_id":516,"student_id":"29","student_name":"Oriana Neidecker","student_slug":"oriana-neidecker","advisor_id":"123","advisor_name":"Kathleen Sullivan","advisor_slug":"kms829","project_title":"The Nude Museum","project_question":"<i>The Nude Museum</i> is an exploration into how we can view and engage with art that is not physically displayed. Whether it is art in a private collection or in a museum’s storage, the reality is that most art  lives in boxes and in warehouses. Virtual reality provides an experience of viewing the art itself that lies somewhere between seeing it in person and seeing it as a jpeg on a 2D screen. \r\n<br />\r\n<br />\r\n<i>The Nude Museum</i> is a prototype that is part tool/part art piece that places a curated exhibition of a private collection of nude photography in various environments in virtual reality.  It adds an otherworldly layer where the photos are curated with their environment and the experience is interactive.\r\n<br />\r\n<br />\r\nApproaching a photo triggers an audio story about the piece, by the artist, their gallerist or from someone knowledgeable about it. It emulates the feeling of hearing about a piece from somebody first hand. Its conversational tone creates an enhanced viewing experience that makes the art more accessible and allows the viewer to connect on a deeper level with the work through stories.  It is informative and surreal. \r\n<br />\r\n<br />\r\nYou have the opportunity to get closer to the art and really study it in a way that isn’t possible in a real museum. There are three different exhibitions of the collection in <i>The Nude Museum</i>, one in the desert, one on Mars, and one in a traditional museum setting.","short_description":"<i>The Nude Museum</i> is a series of curated interactive virtual reality exhibitions that showcase a private collection of nude photography in the desert, on mars, and in a gallery setting.","further_reading":"<p></b>Curation</b></p>\n<p>The Desert focuses on the female form, reflections, shadows and lines. The bodies mimic the landscape.  Mars also has dunes and explores these shapes but it is more sublime, strange, and dark. It deals with the body observed, the body dissected, masks, and presentation. The Gallery mimics a traditional museum environment and the curation is traditional as well.  It is the Female gaze: women photographed by women. </p>\n<p><b>Inspiration</b></p>\n<p>I was originally inspired to create <i>The Nude Museum</i> as a response to archiving and managing my family’s photography collection. I spent hours working with these beautiful images and learning their stories only to end up placing them in boxes and their data and jpegs into spreadsheets. I saw how much time, money and effort was put into building these collections but the majority ended up in storage. Upon further research I discovered that was the norm for most art. Most art is not displayed. The Geneva Free port alone is estimated to house 1.2 million pieces of art from private collections and museums typically only display 5% of their collections at a time.  I saw an opportunity for this art to be visible in a way that lives between seeing it in person and as a 2D jpeg on a screen.  So I decided to explore viewing art in virtual reality. Working with my family’s collection I made <i>The Nude Museum</i> as a prototype for virtual reality museums. As I began my process it took the form of something between a tool and a piece of art itself. VR allows you to experiment in ways that aren’t possible in real life.  You can place the art in environments that it could never normally exist in, and this opened up the possibility of curating with the space.</p>\n<p><b>Tech</b></p>\n<p>The piece was made using the Unreal engine. Currently when you approach one of the pieces a voice note from the artist or someone close to the piece is released. You use a controller with restricted movement speed (to limit nausea) to move in the world. In the future I hope to use a mixture of gaze detection and voice activation that will allow you to move. You will be able to look at a photo and say \"Take me there\" and then fly over to it. </p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/mars320.jpg","title":"Nude Museum on Mars","alt":"Curated selection of photos for the Mars Environment","caption":""},"topics":[{"name":"Culture","slug":"culture"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/vimeo/269195134","video_documentation_url":"https://vimeo.com/265500726","project_url":"","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/mars320.jpg","title":"Nude Museum on Mars","alt":"Curated selection of photos for the Mars Environment","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/1-1.png","title":"Nude Museum on Mars","alt":"iojsd;ofis","caption":"The Nude Museum on Mars"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ScreenShot00031.png","title":"Nude Museum in the Desert","alt":"Nude Desert","caption":"A selection of curated photos to match the desert environment."},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ScreenShot00014-3.png","title":"Nude Museum","alt":"The gallery","caption":"The Nude Museum in a traditional museum setting"}]}