{"post_id":621,"student_id":"32","student_name":"Sebastian Morales","student_slug":"sebastian-morales","advisor_id":"123","advisor_name":"Kathleen Sullivan","advisor_slug":"kms829","project_title":"Bots, Cells, and Humans Watching","project_question":"The piece can be accessed through the estuary website [symbiosis.live](https://symbiosis.live). Here, the digital Internet meets the physical world, connecting servers to a bioreactor. This creates an environment that is subject to both physical and digital influences, transforming it into a peculiar habitat capable of supporting new forms of symbiotic relationships.\r\n<br />\r\n<br />\r\nAs inorganic living organism (crawlers, fetchers, scraper, spammers, hacking tools, etc.), bots for short, visit the server, their presence is recorded and their behavior studied. What were they looking for? What were they trying to do? Who are they? The information is then used to turn the server into a more alluring honeypot, designed to attract them, and if possible, keep them coming back. \r\n<br />\r\n<br />\r\nAs bots move through the estuary, going through links and filling out forms, their movement releases food into the paramecia bioreactor. Paramecia are single-cell eukaryotic organisms belonging to the kingdom of Protista. They are neither plants, nor animal, nor fungi. They flourish on bodies of water and were in fact among the first microorganisms seen through a microscope back in 1665 by Antoni van Leeuwenhoek. The paramecia living inside the estuary website were collected from distinct areas of New York City, including puddles, fish tanks and Central Park.\r\n<br />\r\n<br />\r\nLast come the Humans Watching. The website is designed to distinguish between Bots and Humans, in fact it looks very different to each. When a bot visits the website, a new page is generated to fulfill the bot’s request. When humans visit, they are presented with a live video stream of the paramecia through a microscope, they can telepresently control the microscope and explore different parts of the microscopic environment. Humans can also see a live log of recent bots roaming through the server, observe their behavior and intentions. Humans do not have direct agency or influence over the system.","short_description":"<i>Bots, Cells, and Humans Watching</i> is a speculative ecosystem where inorganic life forms from the internet and single-cell organisms come together in symbiosis. Humans are invited along, but only as observers.","further_reading":"<p>Full text and high-resolution images can be found at:<br />\nhttps://adorevolution.com/symbiosis</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnailCrop.jpg","title":"bots, cells and humans watching","alt":"internet connected microscope, bioreactor and internet bots","caption":"internet connected microscope, bioreactor and internet bots"},"topics":[{"name":"Installation","slug":"installation"},{"name":"Performance","slug":"performance"}],"video_presentation_url":"https://player.vimeo.com/video/269195353","video_documentation_url":"https://player.vimeo.com/video/265682662","project_url":"https://symbiosis.live","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnailCrop.jpg","title":"bots, cells and humans watching","alt":"internet connected microscope, bioreactor and internet bots","caption":"internet connected microscope, bioreactor and internet bots"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/setupCrop.jpg","title":"setupCrop","alt":"Microscope, internet, bioreactor","caption":"Microscope, internet, bioreactor"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/cells.jpg","title":"Bots, Cells, and Humans Watching","alt":"microscope, bioreactor, and live stream projections in the background","caption":"Computer vision analysis of cells and livestream to symbiosis.live"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/wework1.jpg","title":"Symbiosis","alt":"microscope with camera, bioreactor with cells, symbiosis streaming live to two screens on a dedicated desk at a coworking space.","caption":"Symbiosis streaming live from a reserved desk at a coworking space"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/self.jpg","title":"Sebastian Morales symbiosis","alt":"artist shown with projection in the background. The projection show a live stream of microscopic cells and internet bot information","caption":"pc Samuel Vladimirsky."}]}