{"post_id":533,"student_id":"34","student_name":"Utsav Chadha","student_slug":"utsav-chadha","advisor_id":"123","advisor_name":"Kathleen Sullivan","advisor_slug":"kms829","project_title":"Philosophycal / Feel-oh-so-fickle","project_question":"<i>Philosophycal</i> is a web and voice-based experimental project that can be used to translate lengthy works of philosophy into conversational experiences. Conceptually, it creates a real-time dialogue between philosophical books and a participant. Technically, the project uses existing corpuses of philosophy to conduct text analysis in order to simulate an interactive context-driven conversation.","short_description":"Can we use art and technology to reinterpret the process of reading philosophy, and construct it into a conversational interactive experience?","further_reading":"<p>“The Medium is the Message,” said Marshall McLuhan.</p>\n<p>What if we wanted to have a conversation with McLuhan about his message? Which medium would we choose to gain an understanding of his message(s)? Would it be the book, the film, or another representation of his work? Or could it be McLuhan himself, speaking through an artificial system to us? Would that make conversation itself the underlying medium? And how would that affect or complement his message?</p>\n<p>In concurrence with McLuhan’s philosophy, <i>Philosophycal</i> supplements the existing mediums in which philosophical ideas are exchanged. Traditionally, books have been the most prevalent medium for exploring philosophy. And books, fiction generally, have widely been reinterpreted to visual or aural mediums such as films, comics, graphic novels, audio books and the like. More recently, research and development in text analysis, machine learning and voice recognition has enabled interactive conversations with machines as a new medium for exchanging ideas or stories. This project’s objective is to use works of philosophy and turn them into such conversations.</p>\n<p>Absurdity lies at the core of the project. Although context-driven, the responses can range from being apt to being highly absurd. Interestingly, the perception of absurdity is highly subjective. It can be construed as sincere or hilarious, depending on the participant’s perspective. Moreover, the project also introduces a certain lightness to the idea of talking to people who have passed away.</p>\n<p><b>How it works</b></p>\n<p><i>Philosophycal</i> conducts conversations using a query-response based system. The participant asks or says something. Using text analysis and pre-trained machine learning models, the software determines context similar sentences from the corpus and constructs a response to the participant’s words. Each sentence is ranked and then the higher ranking sentences from the source text are used to build a response. Besides responding, it also tries to ask questions while responding whenever necessary. The motive here is to turn it from a query-response system to a back-and-forth conversation. The medium for this conversation is text and voice based.</p>\n<p><b>Personal Statement</b></p>\n<p>Reading philosophy has helped one and many to explore or understand concepts around life, love, insignificance, longing, melancholy, existence and so forth. Essentially, the goal of this project is not to solve the mysteries of life and being, but to be able to reinterpret the process of philosophical reading which might seem intimidating to an individual, at first. The goal is to remind how consuming good works of literature/philosophy can possibly be an enlightening, empowering and transformative experience.</p>\n<p>This is not in contention to the idea of a book itself. A book of philosophy definitely has more capability and structure in terms of imparting ideas or presenting a perspective. A book is a deeper study into a particular subject matter. Whereas, <i>Philosophycal</i> allows for quick reference or learning of the concept. </p>\n<p>Those who watch the film and not read the book might get the story, but are likely denied the opportunity to imagine their version of the narrative and the detailed nuances that the author laid out. <i>Philosophycal</i> works in a similar way - it conveys the overarching ideas, but does not intend to entirely replace what a book has to offer.</p>\n<p>To find more information around the design decisions, technicalities and the selection of philosophers, visit the link below.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/logo.png","title":"logo","alt":"philosophycal-logo","caption":""},"topics":[{"name":"Machine Learning","slug":"machine-learning"},{"name":"Narrative","slug":"narrative"}],"video_presentation_url":"https://player.vimeo.com/video/269195723","video_documentation_url":"","project_url":"https://www.utsav-chadha.com/thesis","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/logo.png","title":"logo","alt":"philosophycal-logo","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/flyer.png","title":"flyer","alt":"Flyer","caption":"Flyer - Contact Herr Nietzsche"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/usertest.png","title":"usertest","alt":"usertest","caption":"User Testing - Quick and Dirty Thesis Show"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/chat2.png","title":"chat-sample","alt":"chat-sample","caption":"Preliminary chat sample"}]}