{"post_id":294,"student_id":"35","student_name":"Shelley Hu","student_slug":"shelley-hu","advisor_id":"123","advisor_name":"Kathleen Sullivan","advisor_slug":"kms829","project_title":"The Act of Receiving","project_question":"The Act of Receiving is a series of performance art pieces and digital installations examining what it means to be a receiver of information.\r\n<br />\r\n<br />\r\nAct I is an experiment where I give my audience the power to control all my information input.\r\n<br />\r\n<br />\r\nThis is a performance piece where I sit in a virtual reality headset, but have no control of what I see. My audience can decide from online to show me any YouTube videos they want. They will be able to see what I am seeing in VR at the moment, and a live stream of my reaction to their content. Once the video is submitted, it's immediately mapped onto the four “walls” in my virtual environment, so I will not be able to look away from any point of view. The videos would keep on playing in loop, until another one is submitted.\r\n<br />\r\n<br />\r\nAct II is a broadcast of my real-time interaction with information.\r\n<br />\r\n<br />\r\nThis is a performance piece where I live stream my interaction with my phone for 12 hours. The screen of my phone is shared and streamed online, along with a streaming of myself. I interact with my phone the same way I would on any other day (reply messages, check emails, scroll instagram, etc.). \r\n<br />\r\n<br />\r\nAct III is an invitation for others to experience my history of receiving information.\r\n<br />\r\n<br />\r\nThis is a VR installation where viewers physically stand on a treadmill. As they walk forward, in the virtual environment, they are scrolling through a room-sized, simulated chat window with the entire WeChat conversation history between me and my mother for the past six years, experiencing voice messages, texts, images, videos, etc. fading in and out.","short_description":"<i>The Act of Receiving</i> is a series of art works examining what it means to be a receiver of information.","further_reading":"<p>Sigmund Freud said, “the compulsion to repeat trauma – be it in art, nightmare, or waking life – is the organism’s attempt to master traumatic experiences that one’s defenses failed to deflect adequately at the time of original impact or injury”.</p>\n<p>In the past two years, I have found myself increasingly overwhelmed by information. I have become irritated, exhausted, but also addicted to being a receiver. I am consumed by it before even having a chance to say no (think push notifications, pop-up ads, auto-play videos, etc.), or, I miss the information I actually want to receive because the algorithm has already decided for me.</p>\n<p>Tristan Harris argues there’s no more respectful delivery of information. Instead, our daily activities are being constantly interrupted, and we were tricked into thinking we could miss something important. Additionally, I want to add that we, as receivers, are always on the weaker side of the power structure, regardless of who we are fighting against - the sender, the messenger, or the information itself. Therefore, in the process of receiving, we often find ourselves giving up consent to something we had never agreed to.</p>\n<p>In our relationship with information, we experience the sense of vulnerability, powerless-ness, embodiment or the lack thereof. I attempt to magnify these feelings by deliberately re-creating it.</p>\n<p>I want to share two moments in my life that lead me to this project:</p>\n<p>When I tried the social VR application Facebook Spaces, I was intrigued that one user has the power to change another’s virtual environment immediately and completely, simply because we are Facebook friends, and we agree to be in this app together. I wonder, as we move toward a more immersive future, will receiving information, in extreme forms like this, ever require a “button\" of consent?</p>\n<p>In another case, I have been using the social media app WeChat as the main communication tool with my mother for the past six years. Living overseas for almost a decade, my definition of “home” has been taken over by those voice message bars, my mom’s profile picture, and our chat window. Three weeks ago, my grandmother passed away. On that very day, for the first time ever, WeChat somehow failed to send me any push notifications the entire day. When I finally got a phone call at night and checked the app, I was bombarded with a full feed of missed messages from my mother throughout the day. 6:34AM: “Grandma is not doing well.” 10:56AM: “?” 1:02PM: “Grandma’s passed away.” </p>\n<p>My relationship with information is composed of these pieces of trauma, small or big. As an artist, I found the only solution to my struggle is to use my own body, and invite all of yours to re-live it.</p>\n<p><iframe src=\"https://player.vimeo.com/video/265847762\" width=\"640\" height=\"360\"></iframe></p>\n<p><iframe src=\"https://player.vimeo.com/video/249612902\" width=\"640\" height=\"360\"></iframe></p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail-6.jpg","title":"thumbnail","alt":"shelley_thumbnail_small","caption":""},"topics":[{"name":"Performance","slug":"performance"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/video/269195779","video_documentation_url":"","project_url":"https://www.shelleyhu.net/the-act-of-receiving/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail-6.jpg","title":"thumbnail","alt":"shelley_thumbnail_small","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/final001small-1.jpg","title":"final001small","alt":"piece2small","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/onsight_small.jpg","title":"onsight_small","alt":"onsightsmall","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/final002small.jpg","title":"final002small","alt":"act2small2","caption":""}]}