{"post_id":468,"student_id":"36","student_name":"Yihan Chen","student_slug":"yihan-chen","advisor_id":"123","advisor_name":"Kathleen Sullivan","advisor_slug":"kms829","project_title":"Perfect Housewife","project_question":"If I were a housewife, what would I need in order to fill that role flawlessly? <i>Perfect Housewife</i> is a toolkit customized for a fictional role I assigned onto myself. It is designed as a series of machines for this imaginary character, accompanied by a manual(performance) that explains their ‘perfect usage.’\r\n<br />\r\n<br />\r\nThese kinetic installations include a chopping knife that helps me avoid the strong smell of onions, a lulling hand machine that assists to calm a baby to sleep and allows me to continue playing on my phone, an iron steak cooker, and a machine that encourages me and my other machines to finish my work.\r\n<br />\r\n<br />\r\nObjectively, these machines are useless, because of the nature that this perfect role does not exist. In the performance, I try to make everything perfect as a housewife and pretend that everything is under control. In this context, the role of ‘housewife’ is an over exaggerated symbol. Through the clumsy, repetitive, strange, and even violent mechanical movements of these imperfect machines, I aim to express resistance to prevalent attitudes relating to woman’s household labor. I consider this performance as an experiment of challenging the perceptions of women as housewives.","short_description":"A toolkit of mechanical machines designed for a fictional feminine role, <i>Perfect Housewife</i> is an installation that examines entrenched ideas about woman’s household labor. It offers resistance through humor and self-examination.","further_reading":"<p>I do not fill the role of a housewife, despite the fact that I have reached an age that in my culture is considered apt for marriage and parenting. Indeed many girls at my age have chosen to become housewives. Although there are plenty of alternative pursuits, I still imagine what is it like to be a housewife. Would I manage to balance my other pursuits in life if I was surrounded by housework and the tasks of taking care of children and a husband? How can I be best responsible to my role in my family and the society that I live in? </p>\n<p>‘Housewife’ is a strong symbolic word. Especially in some Asian countries, it is still discriminating, and suggests a vulnerable female character who is totally reliant on her family. According to the national bureau of statistics, in 2017 the labor force participation rate of Chinese women is as high as 68%— a number that is much higher than most developed countries. However, the 2017 global gender equality report of The World Economic Forum shows that China is still ranked 100th at achieving general gender equality (income, health, mobility and etc). Women face great pressure in Chinese society. Families and child-rearing are still seen as primarily the women's obligations. Women are under double pressure from work and family, and many women with high education have chosen to become housewives. The social value of domestic labor is vastly unacknowledged when compare to other types of labor. Moreover, due to the repetitive and trivial nature of domestic labor, housewives tend to gain less sense of accomplishment and identity. </p>\n<p>In my thesis project, I use machines to imitate the repetitiveness and triviality of domestic labor, which in my opinion they share some similarities. Machines are often manufactured for replacing human labor force to finish repetitive work, in order to be more efficient. But what’s different is that domestic worker can never have such infinite stamina and power, also can never not thinking and not having a life.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Yihan_Thesis_01_320x240.jpg","title":"Yihan_Thesis_01_320x240","alt":"11","caption":""},"topics":[{"name":"Installation","slug":"installation"},{"name":"Performance","slug":"performance"}],"video_presentation_url":"https://player.vimeo.com/vimeo/269196064","video_documentation_url":"https://player.vimeo.com/video/265858215","project_url":"https://yiiihan.com","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Yihan_Thesis_01_320x240.jpg","title":"Yihan_Thesis_01_320x240","alt":"11","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/07.jpg","title":"07","alt":"1","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/06.jpg","title":"06","alt":"1","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/04.jpg","title":"04","alt":"121","caption":"1"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/05.jpg","title":"05","alt":"je","caption":""}]}