{"post_id":547,"student_id":"37","student_name":"Ye Lu","student_slug":"ye-lu","advisor_id":"123","advisor_name":"Kathleen Sullivan","advisor_slug":"kms829","project_title":"Lotus Baby","project_question":"<i>Lotus Babe</i> is an interactive video game based on Eko studio. The creator uses the very simple and cute animation to create the feeling of childhood. When playing the video game, players are going to make 12 choices, and the questions will include the child’s grow-up atmosphere, the child’s accomplishment, the child’s marriage… in a word, the player is making every important decisions and really build up a person!\r\n<br />\r\n<br />\r\nPart of the content are from a popular post in Chinese forum Zhihu: “What did your parents do that hurts you most?”\r\n<br />\r\n<br />\r\nDuring this game, the player will think about some tiny details which they never pay attention to, which can hurt a child badly; also they will be offered the power to change a person’s life. Will you also be an awful parent? What do you care most when you get along with a little child? (e.g. If you receive a phone call which ask you out for a really attractive party, while you've promised to spend time with your little child, what will you do?)","short_description":"An interactive animation game which let the players build a 'perfect' child from scratch, giving people a cultural context of China during the recent few decades, make them think about the severe generation gap in China.","further_reading":"<p>The name <i>Lotus Babe</i> came from an old Buddhist legend about a child called Nezha. “Nezha is a little child, he brewed storms on rivers and seas, and his father was afraid to take the responsibility. In order to punish Nezha, the father threatened Nezha with the debt of parents giving birth to the child. Nezha was furious, so he cut up his flesh and bones, and returned everything to his parents. Finally, Guanyin Budhisattva used the lotus leaf and lotus root to recreate Nezha’s body.” And Nezha became a teenage god in Buddhist legends.</p>\n<p>Growing up as 90s in China, I’ve experienced severe generation gap during my life. My parents are 60s, they were born during China’s age of famine, they spent their childhood during the Cultural Revolution, they got into college when the education system was incomplete, and they built up their family at the strictest stage of the One-child Policy.</p>\n<p>Once I’ve heard my parents saying, they feel like they are the “abandoned generation.” Because they were taught to follow “Old Chinese morals,” which let people be obedient to their parents, but they can’t enjoy the same benefits—children’s piousness, as their parents do. Because their children, which is my generation, are growing up in the new era, with totally new ways of thinking.</p>\n<p>In China’s moral system, children are born in debt to the parents. Parents gave birth to their children, so the children owe their parents.</p>\n<p>For me, I know my father always wanted a boy, but he had to sign a document to give up the chance, because of the strict One-child Policy. When my grandparents asked, he was ashamed because I’m a girl; and I know I’m always not a satisfactory child—I’m always a trouble maker.</p>\n<p>So I started to think: do I really owe my parents? And how can I compensate them?</p>\n<p>I’ve ask some friends and found that there are some common problems on us: we are hard to get along with others closely, we don’t want to share resources; we always feel unsafe and we are looking for other countries’ permanent residency; some of us don’t want to any children, even though China has changed the One-Child Policy and encourage people to have babies since 2016.</p>\n<p>In my thesis, I am going to discuss the relationship between parents and children, under China’s specific influence of time and polices. </p>\n<p>Also, I was inspired by a Japanese game called Travelling Frog. This game is not playful at all, the only thing the player is able to do is to prepare food for the little child – the player pack bags for the frog, and the frog goes traveling, and the player just wait for the frog to come back. Actually, this is as the same as what parents are doing: they prepare food and pack bags for their children, then they see their children travel far away. They can’t control where they go and when they come back, the only thing the parents can do, is waiting.</p>\n<p>It is said that the Japanese government uses this game to find out “qualified parents”: if someone keeps playing this game for a specific length of time, this person will be sent a message which encourage him or her to have baby.</p>\n<p>According to a social research conducted by a Chinese influencer Papi, a PERFECT CHILD in Chinese parents’ eyes should be like this: they never go to bars; they always spend time in library; they attend famous schools; they are willing to share any privacy with parents; they have a tidy, clean room; they don’t date any one before graduating from college, but they magically get married with a rich and well-educated person before the age of 25.</p>\n<p>Is this really the perfect template for a child? Will parents really like a child like this? Papi has interviewed a couple of parents, and not surprisingly, all of these parents said “yes”.</p>\n<p>If this is the only chance, what kind of child do you want? What do you care most? The child’s accomplishment, piousness, or happiness?</p>\n<p>Let’s see.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/cover.png","title":"cover","alt":"123","caption":""},"topics":[{"name":"Culture","slug":"culture"},{"name":"Identity","slug":"identity"}],"video_presentation_url":"https://player.vimeo.com/video/269196156","video_documentation_url":"","project_url":"","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/cover.png","title":"cover","alt":"123","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/1-9.png","title":"1","alt":"123","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/3-6.png","title":"3","alt":"123","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/2-6.png","title":"2","alt":"123","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/4-5.png","title":"4","alt":"123","caption":""}]}