{"post_id":659,"student_id":"39","student_name":"Anne-Michelle Gallero","student_slug":"anne-michelle-gallero","advisor_id":"119","advisor_name":"Gabe Barcia-Colombo","advisor_slug":"gac277","project_title":"100 Days of News","project_question":"My thesis project is an interactive data art piece that tracks my journey through my <i>100 Days of News</i> and immersing myself in the fast paced news cycle. I felt as if important events were getting lost or drowned out in the 24-hour news and media cycle of our phones, the internet, TV and podcasts, and that I wanted to create a time capsule of important events of the year as a ‘memory bank’ of the news. \r\n<br />\r\n<br />\r\nThe result is an interactive experience on a website documenting my reaction and absorption of news media content and exploring our relationships with the news.","short_description":"How do we start a conversation about the news to help find common ground? With that in mind, I created an interactive data art web page that follows my 100-day journey of immersing myself in the news to understand the flow and organization of news information.","further_reading":"<p>To create a time capsule of important events of the year as a curated ‘memory bank’ of the news to help us not forget, my research approach starts like a daily algorithm for myself:</p>\n<p>1.) Starting January 1, 2018, I chose a single news story each day to mark the most important event of that day and help distinguish it from the other events across all 100 days. I decide based on what I feel will be relevant 6 months to a year from now and whether it is a breakthrough in a ongoing news story or a momentous event.</p>\n<p>2.) In order to get a good grasp on the story, facts and perspectives, I collect and organize all the online articles on Zotero, where I can go back to my articles to refer back to certain readings and to keep all my source references in order.</p>\n<p>3.) After I’ve absorbed the information and research through a deep dive into a single news event, I create an illustration of the story to visually communicate the story and information that is added to my 100 Days of News Instagram account (https://www.instagram.com/100daysofnews/). This part of the process is also in conjunction with Katherine Dillion’s 100 Days of Making class.</p>\n<p>4.) When I post the illustration of the day, I also pull together the data associated to each event, such as date, title, category, hashtags to identify the story, number of posts associated to the hashtag on Instagram, the description that I summarized based on articles that I’ve read, as well as the news organizations that I am citing. This data therefore becomes the output that is used to construct my interactive data art piece.</p>\n<p>5.) In parallel to this, I have been interviewing family, friends and strangers on how they take in the news and their memories of watching the news with their family growing up or a particular news event they remembered. It started with a visit to Florida to see my Dad, who watches a lot of Fox News and that visit made me more conscientious about trying to see things from his point of view as well. It has become part of my research as a way to see what types of news stories interest people, to hear different viewpoints and to understand the kinds of common ground in the chatter of opinions or biases. I also hear other people’s news habits of how and what people read and their distractions and reactions to the news, and I try to incorporate other people’s news habits into my own. From the people that I have interviewed, I see a spectrum of people who either have too much time for the news or not enough time. People who want to be well informed with accurate information and people who have avoided the news because of it’s sensationalism and the anger or anxiety that takes over when reading the news now. </p>\n<p>One of the major reasons why I chose to surround myself in the research of the news atmosphere is because before ITP, I worked at a traditional news media company for over a decade and witnessed the highs and lows of the company with the advances in technology and the speed at which we send and get our news now. I value the importance of editorial decisions such as deciding which stories to tell, fact checking and the rules to communicate content and facts in a responsible way. I also place importance on recalling history to remind us of how far we’ve come and the mistakes to learn from and avoid repeating. We are in a period of time where the line between fake news and propaganda has been blurred. With more competition, limited budgets and short attention spans, the most sensational or loudest story gets the attention of the news cycle and therefore the public. I wanted to explore this ‘news’ project as a way to see how the different news agencies are organizing their content and how easily recallable past content is. I was also interested in seeing the different types of explanatory and interactive news pieces with technology of VR, AR, video and data.</p>\n<p>Through my news journey, I saw two ways that I was looking at news: the fast read where you just scratch the surface of what’s going on and the slow read of going into a deep dive into the news story, where I have widened my choices to read or watch CSPAN, MSNBC, Fox News or a curation of news. And with a click of a translate button on the World Wide Web, I can read an international news article from countries like China, the Middle East or France and get their perspective. We are more connected than ever with easily accessible data, we just need to know what to ask and search for it whenever we want. And for myself, I want to continue to communicate visual content to help empower the community with knowledge to make decisions in an informed way and to help contribute a solution to the current problems in the news.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/100News_Thumbnail_320x240.jpg","title":"100News_Thumbnail_320x240","alt":"Thesis: 100 Days News_Thumbnail","caption":"Thesis: 100 Days of News_Thumbnail"},"topics":[{"name":"Data","slug":"data"},{"name":"Society","slug":"society"}],"video_presentation_url":"https://player.vimeo.com/video/270188165","video_documentation_url":"","project_url":"https://www.100daysofnews.com/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/100News_Thumbnail_320x240.jpg","title":"100News_Thumbnail_320x240","alt":"Thesis: 100 Days News_Thumbnail","caption":"Thesis: 100 Days of News_Thumbnail"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/100News_SlideShow1_960x540.jpg","title":"100News_SlideShow1_960x540","alt":"Thesis: 100 Days News_SlideShow1","caption":"Thesis: 100 Days News_SlideShow1"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/100News_SlideShow2_960x540.jpg","title":"100News_SlideShow2_960x540","alt":"SlideShow2","caption":"SlideShow2"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/100News_SlideShow3_960x540.jpg","title":"100News_SlideShow3_960x540","alt":"ThesisSlideShow3","caption":""}]}