{"post_id":1339,"student_id":"44","student_name":"Jesal Trivedi","student_slug":"jesal-trivedi","advisor_id":"119","advisor_name":"Gabe Barcia-Colombo","advisor_slug":"gac277","project_title":"Mindful Technology: Aduri","project_question":"<i>Aduri</i> is a technology company on a mission to make the world happier, healthier and more mindful. My work covers the progress of my tech startup, <i>Aduri</i>, which I have been working on since the first semester of ITP.","short_description":"How can technology be used to amplify mindfulness and positive well-being?\r\n\r\n","further_reading":"<p>Various tools have been created to aid meditation over thousands of years. From cushions, incense, singing bowls and yoga mats, all of these tools were created to enhance the meditative and mindfulness abilities of practitioners. Recently, tools such as mobile apps such as Headspace and Calm have emerged bringing more people into the practice. But there is an inherent problem with them: on average, 85% of people stop using them within 12-16 days after downloading them. Why? Their content is fairly generic, their don't learn from the user's habits and routines, and digital content is seen as disposable, being used when it's need and wanted and then forgotten about or deleted from their phone. We believe we are a fundamental bridge between the digital and physical worlds.</p>\n<p>In the last two months, I have spoken with over 120 people. Meditation apps, though great at getting people into the practice, fall short in helping them maintain their practice. Meditation studios are great ways to help build that accountability, but most people don't live close to them to build a habit. Consistency is a critical factor to them attaining meditation's benefits, but it's currently difficult to achieve unless you have a personal meditation teacher. </p>\n<p>I have created four physical prototypes paired with a simple mobile app made with MIT's Mobile App Inventor. We will be creating several more over the next two months, creating a more robust user experience and extensively testing it with our test users. We will begin sourcing a manufacturer this summer and complete the design for manufacturing process. We will have pilot ready prototypes latest by winter 2018. Simultaneously, we will be developing the infrastructure to create and deliver content with our meditation teachers.</p>\n<p>The connected devices in Health and Wellness is a $612B market (Grand View Research). Within this, Corporate Wellness is a $43B industry (Global Wellness Institute). In 2016, 22% of Fortune 500s paid significantly for meditation and mindfulness products and programs for their employees, which nearly doubled in 2017, fueling the growth of the $3.4B mindfulness industry (IBISWorld). Millennials spend 1/4 of their disposable income on health and wellness.</p>\n<p>We recently were in the NYC Combine, a startup incubator funded by the NYCEDC. We will be going into the NYU Summer Launchpad program and have been able to raise over $60K in the last couple of months to continue developing <i>Aduri</i>, in grant money and venture capital. We are in conversations with LinkedIn and Bringham Hospital to conduct pilots in the near future. We've also began conversations with MNDFL, a boutique meditation studio here in NYC to partner on meditation content. Our next step will take us a step back from the cushion and develop an integrated system with the Apple Watch to provide a similar experience. We've learned this from user testing and talking to our potential customers, giving us new hypothesis to test over the next several months.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ITP-Thesis-Thumbnail.png","title":"ITP Thesis Thumbnail","alt":"meditation","caption":"meditation"},"topics":[{"name":"Health","slug":"health"},{"name":"UX\\UI","slug":"uxui"}],"video_presentation_url":"https://player.vimeo.com/video/270189243","video_documentation_url":"https://youtu.be/oWMnK1HTRnY","project_url":"https://www.aduri.co/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ITP-Thesis-Thumbnail.png","title":"ITP Thesis Thumbnail","alt":"meditation","caption":"meditation"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Aduri-PR-Image-1.png","title":"Aduri PR Image","alt":"PR","caption":"PR"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/2018.04.13-NYCMediaLab-95-copy.jpg","title":"2018.04.13-NYCMediaLab-95 copy","alt":"Combine","caption":"Combine"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/IMG_3743-1.jpg","title":"IMG_3743","alt":"cushion","caption":"cushion"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Aduri-Mobile-Mockup.png","title":"Aduri Mobile Mockup","alt":"mockup","caption":"mockup"}]}