{"post_id":552,"student_id":"47","student_name":"Mithru Swarna","student_slug":"mithru-swarna","advisor_id":"119","advisor_name":"Gabe Barcia-Colombo","advisor_slug":"gac277","project_title":"Internet of T̶h̶i̶n̶g̶s̶  Humans (IoH)","project_question":"The <i>Internet of T̶h̶i̶n̶g̶s̶ Humans</i> is a collection of artefacts for a speculative version of our connected selves. The artefacts are whimsical takes on our understanding on internet infrastructure and the tools and services that come with it. They take physical or virtual forms, and address the gap between our increased interaction with these devices and our understanding of them. \r\n<br />\r\n<br />\r\nI've always been interested in our relationships with the devices we use in our day-to-day activities. Marshall McLuhan, in <i>Understanding Media: Extensions of Man</i>, wrote about the implications of our tools on our society. He wrote about numerous media from clothing to electricity. These tools extended the limits of the capabilities of our bodies. We've perceived and navigated our world with just our biological senses and analog tools to help us from time to time. Today, our tools not only help us communicate, but speak to one another themselves, thus creating representations of this communication in physical phenomena that we cannot biologically perceive (electromagnetic waves). \r\n<br />\r\n<br />\r\nWhat most of us do not realize or understand are the vulnerabilities that these devices and services create. People could run malicious code on our devices or steal our passwords if they're unencrypted. Notifications are engineered as dopamine cues. And the connected devices in our homes sometimes talk to their server-overlords (server-lords?) even when we don’t use them. My intention with this project is to start a dialogue around the gap between our increased reliance of these devices and our limited education about their vulnerabilities.","short_description":"If our modern internet-connected tools and services are considered extensions of the human form, how could we translate, augment and influence our biological selves to understand these devices and their vulnerabilities better?","further_reading":"<p><i>Internet of Humans</i> is intended to be a series of projects that continue to develop past my time at ITP, but over the thesis semester, I built three artefacts to start. </p>\n<p><b>The App That Cried Wolf</b></p>\n<p>A lot of our online services and tools have moved to advertisement-driven attention-seeking indicators for success. This has led to most of these services sending us notifications in an increasing scale. On average, in February 2018, I checked my phone over 300 times a day. To combat this, I initially went on a facebook-free digital diet, only to notice that facebook, having noticed my absence, started sending me emails to notify me of changes instead in order to get me back to their service. When I looked at the type of notifications facebook sent, I realized that most of them were meaningless to me. I had similar feelings about other services I used. </p>\n<p><i>The App That Cried Wolf</i> is a phone app that intends to condition the human using it to ignore their phone notifications. It is based on the story about the boy who cried wolf as a prank to the people in his village over and over again. Eventually, when a wolf did appear, the people were so conditioned to his lies that they ignored his cries for help. Similarly, this app sends random notifications to the user to eventually annoy the user to ignoring real notifications. </p>\n<p>I used the app over a few weeks in March and noticed the number of times I checked my phone go down, closer to 200 times a day. That being said, I must admit that these results might be anecdotal and I must consider other factors as well. Regardless, the app is not intended to be a tool, but more of a starting point for a conversation around the need for useless notifications to which we subject ourselves. </p>\n<p><b>Horripilation Through Tickling Protocol - Secure (HTTP-S) </b></p>\n<p>When we access content over networks, most web-pages are served over HTTP or HTTPS. The difference between them is that HTTP is unencrypted - which means anyone with access to the network can see what’s being sent across the network. If information that might need to be secure / private is sent over HTTP, it is at risk of being exposed. HTTPS on the other hand encrypts messages, and it relatively more secure. Pages with forms, passwords and most communication is ideally served over HTTPS. However, there still are pages that should be secure that aren’t. Most browsers notify the users with a green lock when the site is HTTPS, but don’t necessarily notify users when they’re not. </p>\n<p>HTTPS (Horripilation Through Tickling Protocol - Secure) is a wearable device that tickles the back of the wearer’s neck to induce goose pimples. Horripilation is the erection of hairs on the skin due to cold, fear, or excitement. It is a vestigial response that indicates stress - usually when something “feels wrong” - the kind of feeling we should have when we’re browsing HTTP sites. The device attempts to induce this feeling when we browse the “unsafe” pages on the internet. It runs as a chrome extension that sends a signal to a background processing sketch that in turn controls an arduino that moves the motor. </p>\n<p><b>If Packets Could Talk…</b></p>\n<p>Most information in a network is broken down into packets. These packets are structured with metadata that allow the information to permeate through the network. </p>\n<p><i>If Packets Could Talk…</i> is wearable piece allows wearers to hear network traffic (packets) from all devices on a particular network. Each device speaks in its own unique voice, and attempts to speak out all packets that it sends. The voices help the wearer distinguish different devices that they hearing. Wearers can select and filter certain devices, or listen to the cacophony of packets sent through the network. The intention here is to allow wearers to hear the quantity of data that moves through a network even when they’re not actively using the devices. Unencrypted packets from login pages might read out passwords as well. Smart bulbs might be get software updates. Malicious code could be running on certain devices. And phones could be reporting location information immediately after using certain apps. The intention is to allow wearers to explore all their devices on their network and behavior by hearing their activity. </p>\n<p><b>References</b></p>\n<p><i>http://www.jnhasty.com/embrace/<br />\nhttp://www.backslash.cc/<br />\nhttps://ebookcentral.proquest.com/lib/nyulibrary-ebooks/detail.action?docID=3338550<br />\nhttps://link.springer.com/article/10.1007/s00146-006-0034-9<br />\nhttps://www.ted.com/talks/david_eagleman_can_we_create_new_senses_for_humans#t-167580<br />\nhttps://www.dezeen.com/2016/10/12/smell-data-design-scent-alert-internet-users-security-leaks-technology-leanne-wijnsma/<br />\nhttp://onlinelibrary.wiley.com/doi/10.1002/bem.10163/epdf<br />\nhttps://www.theguardian.com/technology/2016/feb/19/iphone-apple-privacy-smartphones-extension-of-ourselves<br />\nhttps://www.youtube.com/watch?v=ksasPjrYFTg<br />\nhttps://www.livescience.com/9664-brain-sees-tools-extensions-body.html<br />\nhttps://www.edge.org/response-detail/11498<br />\nhttps://link.springer.com/article/10.1007/s12304-008-9036-y<br />\nhttp://www.nbi.dk/~emmeche/cePubl/2001d.robumwelt.html<br />\nhttps://pdfs.semanticscholar.org/6f97/68bbdb14fe52f3983a30d90cae2fce693370.pdf<br />\nhttps://itp.nyu.edu/adjacent/issue-2/the-extended-body-extended/<br />\nhttps://philosophynow.org/issues/87/Marshall_McLuhan_on_the_Mobile_Phone<br />\nhttps://vimeo.com/20412632<br />\nhttps://vimeo.com/7022707<br />\nhttp://www.moxieinstitute.org/films/connected/</i></p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ioh-colour.png","title":"ioh-colour","alt":"A dark blue logo with white background that has a representation of a human with wireless signals coming off the human's head. It's a combination between a human icon and the WiFi icon.","caption":"Internet of Humans - logo"},"topics":[{"name":"Culture","slug":"culture"},{"name":"Data","slug":"data"}],"video_presentation_url":"https://player.vimeo.com/video/270190218","video_documentation_url":"https://player.vimeo.com/video/265854018/","project_url":"http://ioh.mithru.com/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ioh-colour.png","title":"ioh-colour","alt":"A dark blue logo with white background that has a representation of a human with wireless signals coming off the human's head. It's a combination between a human icon and the WiFi icon.","caption":"Internet of Humans - logo"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/https.gif","title":"https","alt":"A picture overlooking a person working on a computer. The person has a device on their shoulder. The device holds a motor which in turn holds a Q-tip that touches and moves along the back of their neck.","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/IPCT-Edited.jpg","title":"IPCT","alt":"Picture of person holding handheld device. the screen displays a list of devices. Few of these devices are selected with a checkbox","caption":""}]}