{"post_id":383,"student_id":"49","student_name":"Philip McCausland","student_slug":"philip-mccausland","advisor_id":"119","advisor_name":"Gabe Barcia-Colombo","advisor_slug":"gac277","project_title":"Feeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeed","project_question":"Many people interface with much of the content on the web through various types of feeds, as lists or other forms of visual collections of content. Modern feeds tend to be virtually infinite, and blur the distinction between personal, commercial , self-picked and algorithmically curated content. One particularly interesting feature of such feeds is their ability to incite positive feedback loops through the emotional impact of the content's subject matter and the psychological reward of scrolling on to something new to repeat the process. \r\n<br />\r\n<br />\r\n<i>Feeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeed</i> is an exploration of this prolific media consumption paradigm. As a hypnotic and overstimulating space that is simultaneously hyper-commercialized and intimately personalized, how is this mode of information consumption affecting our capacity to reflect more deeply on what we're seeing? How much of our time is wasted on garbage? This project aims to stimulate dialogue and imagination about what the future of web media consumption can or might be.","short_description":"What are the aesthetics and politics of infinite distraction and relentless forgetting? What is our relationship to the past in a landscape constantly feeding us the 'now'? \r\n<br />\r\n<br />\r\n<i>Feeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeed</i> is a multimedia installation that attempts to critically reflect on these cumulative effects of modern media consumption habits through web feeds.","further_reading":"<p><i>Feeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeed</i> is a multi-channel video installation consisting of 6 digital displays, Mac Minis, and some speakers. </p>\n<p>The visual content of the displays is meant to be a chaotic but hypnotizing mixture of appropriated, personally-created, curated and algorithmically generated content. Each display pulls and visualizes the most viral livestreams currently broadcasting on some of the most popular livestreaming platforms from across the web (Twitch, Twitch Creative, Douyu, Youtube, and Younow). The streams are manipulated and mashed together in ways that emphasize the notion of \"nowness\"—the appropriated visuals are constantly changing based on live events, but played back in highly repetitive loops based on computational randomness. It's live but it's not, but it is, sort of!!!</p>\n<p>The displays were taken from the Gowanus E-Waste Distribution Facility in Brooklyn. Using reclaimed hardware, I try to draw a parallel between physical and digital (attention) economies — both the physical and digital aspects of the piece together attempt to question the notion of garbage from the user's perspective. In the attention economy things have value only at the moment they're receiving attention. The viral/popular streaming content used in the visuals are commercially lucrative, but how valuable is it to the user if such content has been streamlined to ultimately waste their time???</p>\n<p>On a personal level this project is a visceral attempt to understand my struggles with procrastination, information overload, and the numbing effects of visual excess. As a millennial American male I am a digital native, I've been subjected to the ADHD medication trend, and as I struggled with sexual identity through my teens I naturally sought affirmation and comfort in online communities. So I feel a lot is at stake on the web because it's a space that has played a significant role in the development of my personal identity. This is my attempt to reflect on this sense of selfhood, this humanness, in an environment increasingly dominated by algorithmic thinking and commercial interests.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail-7.png","title":"thumbnail","alt":"feeeeeeeeeed thumbnail","caption":""},"topics":[{"name":"Culture","slug":"culture"},{"name":"Installation","slug":"installation"}],"video_presentation_url":"https://player.vimeo.com/video/270190642","video_documentation_url":"https://vimeo.com/video/266432408","project_url":"http://p-am.cc/feeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeed","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail-7.png","title":"thumbnail","alt":"feeeeeeeeeed thumbnail","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/slideshowImg_1.gif","title":"slideshowImg_1","alt":"slideshow image 1","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Untitled-4.gif","title":"slide image 2","alt":"slide image 2","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Screen-Shot-2018-04-09-at-1.45.53-AM.png","title":"slide image 3","alt":"slide image 3","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Untitled-1.gif","title":"slide image 4","alt":"slide image 4","caption":""}]}