{"post_id":553,"student_id":"50","student_name":"Regina Cantu De Alba","student_slug":"regina-cantu-de-alba","advisor_id":"119","advisor_name":"Gabe Barcia-Colombo","advisor_slug":"gac277","project_title":"Epoche","project_question":"Originated from the urge to reveal the complexity of relations between organisms that exists in different forms and moments in 'time.' My initial hunch was that through being able to open the possibility for users to transition between their regular experience of time to one that required them to think of a different scale, I would awaken a certain empathy.\r\n<br />\r\n<br />\r\nLooking into why I wanted to raise a conversation regarding the complexity of life systems, I realized that I kept on reiterating a statement I have championed for a while now: until we accept complexity and  scarcity as the moving forces of life cycles, we will continue to understand—and design—our existence on this planet based on a mindset that is destructive. This destruction is a result of a collective effort to achieve the unconditional availability of goods and services used to supplement an existence understood as 'comfortable.'\r\n<br />\r\n<br />\r\nWith a background in social science research and project management for sustainable urban development. I faced the challenge of translating my ideas from a communication style based in theoretical thinking through writing, into a process of designing objects and experiences meant for other people to use and understand.\r\n<br />\r\n<br />\r\nThis meant that I had to dissect my concepts to their core components in order to have raw matter to work with. I then used these to design objects that would represent the ideas I was trying to transmit.These objects were used for my explorations. First a prompted dinner and second a guided exercise in wondering and questioning through which two concepts ran throughout: empathy and systems thinking.\r\n<br />\r\n<br />\r\nI’ve realized that in the quest to fulfill my original urge, I’ve come into a place of exploring how to design for the purpose of philosophy. ","short_description":"<i>Epoche</i> is an exploration on ways in which I could, by designing objects and implementing guided experiences, invite an audience to consider what is Time without conventional reference points.","further_reading":"","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/epocheThumb.png","title":"epocheThumb","alt":"The logo for a project that looks like a broken clock","caption":"Epoche Logo"},"topics":[{"name":"Society","slug":"society"},{"name":"UX\\UI","slug":"uxui"}],"video_presentation_url":"https://player.vimeo.com/vimeo/270190798","video_documentation_url":"https://player.vimeo.com/video/261986927","project_url":"https://regina-cantu.squarespace.com/epoche","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/epocheThumb.png","title":"epocheThumb","alt":"The logo for a project that looks like a broken clock","caption":"Epoche Logo"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/epocheMeaning.png","title":"epocheMeaning","alt":"Meaning of Epoche","caption":"Epoche meaning"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/epocheDiagram.png","title":"epocheDiagram","alt":"Words arranged in a diagram form that explains how the thesis sees time","caption":"Concept diagram of Epoche"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/relativeMachine.png","title":"relativeMachine","alt":"Concept exaplanation of how a machine meant to portray relativity works","caption":"Relativity Machine"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/changeMachines.png","title":"changeMachines","alt":"Explanation of how some change machines work acompanied by a diagram","caption":"Change Machines"}]}