{"post_id":336,"student_id":"51","student_name":"Siman Li","student_slug":"siman-li","advisor_id":"119","advisor_name":"Gabe Barcia-Colombo","advisor_slug":"gac277","project_title":"The Crossings 渡","project_question":"<i>The Crossings</i> 渡 is a sculpture that in the shape of both mountain and artist's own body, with projection of seasons changes animation that represents the changes happen in life. While the animation changes, the sculpture itself seems to change in form, and provoking the audience's different emotions.  \r\n<br />\r\n<br />\r\nInspired by the ancient Chinese landscape painting style, this work is a visual, aural and olfactory interpretation of the Buddhist concept—relief. Using the technique of 3D scanning, the body of the artist was captured, broke down and deformed into the shape of landscape. The 3D model was used to generate physical simulation animation to represent four seasons, using different color, form and dynamic to stimulates the audience’s imagination that is abstract, ancient, futuristic and poetic.  \r\n<br />\r\n<br />\r\nThis work is a continuation of the artist’s exploration into the examination of traditional Chinese aesthetic and philosophy, by extracting, exploring and extending the core elements within a contemporary discourse without being bound by the formal restraints of tradition.","short_description":"<i>The Crossings</i> 渡 is a multidimensional installation that uses visual, aural and olfactory interpretation of the buddhist concept relief. Using projection, sound and human body to stimulates the audience’s imagination that is abstract, ancient, futuristic and poetic.","further_reading":"<p>It was widely considered that, landscape to be the highest form of Chinese painting. By the late Tang Dynasty, landscape painting had evolved into an independent genre that embodied the universal longing of cultivated men to escape their quotidian world to commune with nature. During Mongol Yuan Dynasty period, many artist were barred from the government service. With the political ambitions not fulfilled, landscapes are often used for more subtle expression of the artist’s personal feelings. It was also during that time, the “mind landscape” was created, instead of painting the real world landscape, the artist embodies the learned references from the earlier master, also combine their own imagination to draw the ideal and reclusive landscape in their fantasy. The mountains are usually disappearing into the mist, and represent the free spiritual world. </p>\n<p>One piece that really strike me is called Awaiting the Crossing at an Autumn River (秋江待渡图) by the painter Sheng Mao (盛懋) of Yuan Dynasty. The painting uses the “two part” technique that is commonly used in landscape paintings, a wildy-growing tree on a mountain rock in the front, in the top there is a distant mountain that disappearing into the mist, in between there runs a wide river, the artist deliberately chose not to describe the river, so the river seems endlessly wide. But only when look carefully can you find two human figure, a elder master with his young student siting on the rock, waiting for the ferry afar. Their existence in the painting is almost ignorable compared to the significant wide nature world. Instead of showing the two at their final destination, Sheng Mao decided to paint them at this peaceful moment of waiting. While they are on the shore waiting, eight hundreds of years has past.</p>\n<p>If the life itself is like journey getting across the deep and wide river to that ideal mountains afar, the moment of waiting is more memorable personally. In Buddhism there metaphor for life is “sailing across the sea of bitterness “ (渡苦海). The body itself is the medium for all the feelings and sensations we have.</p>\n<p>Inspired by the above I merged my body into the ideal landscape, while the journey itself happens everlasting on me in form of the changing season. This work is a continuation of the my exploration into the examination of traditional Chinese aesthetic and philosophy, by extracting, exploring and extending the core elements within a contemporary discourse without being bound by the formal restraints of tradition.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumb-2.jpg","title":"thumb","alt":"thumb","caption":"d"},"topics":[{"name":"Culture","slug":"culture"},{"name":"Installation","slug":"installation"}],"video_presentation_url":"https://player.vimeo.com/video/270191416","video_documentation_url":"https://player.vimeo.com/video/265459837","project_url":"https://www.siman.li/#/-the-crossings/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumb-2.jpg","title":"thumb","alt":"thumb","caption":"d"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Artboard-1-100.jpg","title":"Artboard 1-100","alt":"1","caption":"Spring"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Untitled-2-01-1024x576.jpg","title":"Untitled-2-01","alt":"Summer","caption":"Summer"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Untitled-3-01-1024x576.jpg","title":"Fall","alt":"Fall","caption":"Fall"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Untitled-4-01-1024x576.jpg","title":"Untitled-4-01","alt":"4","caption":"4"}]}