{"post_id":263,"student_id":"52","student_name":"Se Young Kim","student_slug":"se-young-kim","advisor_id":"119","advisor_name":"Gabe Barcia-Colombo","advisor_slug":"gac277","project_title":"Memoria","project_question":"<i>Memoria</i> is a mobile augmented reality app that let users archive their memories in the digital world attached to space. More and more people digitalize their memories, but it’s often disconnected with the real world we’re living in. The memories are heaped up, and users never go back. Think of all those bookmarks we made in the web, countless photos in your phone, and all those things you thought you would come back again. \r\n<br />\r\n<br />\r\nMemory is a visual thing, and it is strongly connected with the concept of space. Spatial memory is well known for a method to efficiently recall information too(“The method of loci”) \r\n<br />\r\n<br />\r\nI wanted to explore the relationship between memory and space, and literally attach the memory to the actual place and even recall them. \r\n<br />\r\n<br />\r\n<i>Memoria</i> will use AR to connect the memory with the real world. AR uses the actual environment for the background, and the users will use device’s screen to see through the digital space of memory. Users will keep their moments in photo, text and sound format. They will not only anchor to the 3D digital space but also attached to GPS data. After the user leaves a mark, they will set a certain amount of time for how long you want to “bury” the memory in that place. After the time has passed, the memory will be visible again. Then the users will go find and recall the memory again like they open a time capsule they buried a long time ago. ","short_description":"Can we use augmented reality to store a memory in a physical place?","further_reading":"<p>I’ve always had a significant interest in human memory. There are lots of ways to record memories: pictures, notes, voice recording. Taking photo or video is an effective way to remember the moment visually. Videos have sounds and timeline, which makes it is easy to recall the mood and environment of a memory. Notes will show your personal feelings or point of view at that time. However, there is a chance that we might forget about these physical memories and won't even look back at all those digital pictures, videos or notes. It might end up in one of the thousands of files on a computer. The digital world is infinite, and it is possible to keep memories safe for a long time. However, these memories are fragments of moments disconnected from the real world. I am using augmented reality as a memory storage space that is related to space itself. Our memories have different factors involved, but the space is the only thing that doesn’t change. The forms will change but the fact that the place exists won’t change until the earth exists.</p>\n<p>Lots of studies show that spatial information is incorporated into memories. There is neural evidence for the idea that the human memory system tags memories with information about where and when they were formed and that the act of recall involves the reinstatement of these tags. So that means, our memories are more complicated than just an image on a screen, and they have to be saved differently—they have to be more engaged with the world we are living in, and their context should be included. I am going to provide this \"context\" of memory with AR technology.</p>\n<p>Let’s say that there is a tourist who just visited NYC for the first time in her life. She is sitting on a bench in Bryant Park, and everything feels new and fresh. She is enjoying the day and thinking that she wants to keep this moment forever.  She might want to take a note about it, message her friend or take a picture or video. But instead she will use Memoria to remember that moment. She takes a picture with the app, and the photo will be anchored to space right away. She can add on more with text notes or voice memos using the apps recording feature. Then she will set the period of time to hide(forget) the memory. It could be few hours to years.</p>\n<p>After time has passed, she’ll get a push notification about the memory recovery. This push notification encourages you to go find the memory in that place, just like opening a time capsule you hid in the past. Revealing old memories evokes new feelings. I want users to go through new experiences and different emotions when recalling the memory. So they could store more time capsules around you, and someday it could turn into a pleasant surprise gift to their ordinary day.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/main.png","title":"memoria","alt":"memoria","caption":"memoria"},"topics":[{"name":"UX\\UI","slug":"uxui"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/video/270191576","video_documentation_url":"https://player.vimeo.com/video.265400637","project_url":"http://seyoung.kim/memoria","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/main.png","title":"memoria","alt":"memoria","caption":"memoria"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/2.jpg","title":"1","alt":"1","caption":"1"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/1-1.jpg","title":"2","alt":"2","caption":"2"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/3.jpg","title":"3","alt":"3","caption":"3"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/4-3.jpg","title":"4","alt":"4","caption":"54"}]}