{"post_id":340,"student_id":"62","student_name":"Jinhee Ahn","student_slug":"jinhee-ahn","advisor_id":"124","advisor_name":"Kathleen Wilson","advisor_slug":"ksw222","project_title":"textARt","project_question":"The state of UI/UX design in virtual worlds is still evolving. The use of typography and text is a prime example of this. At the moment, text elements in virtual worlds for the most part still follow the design conventions developed for 2D environments, such as print or flat web pages, rather than taking into account the more dimensional and experiential characteristics of 3D environments. I have been curious to explore new ways to visualize text in virtual spaces that move beyond traditional 2D graphic design. \r\n<br />\r\n<br />\r\nFor my thesis project I have experimented with ways to make text come alive with AR by creating more animated and dimensional text examples in the process of learning simple verbs in a new language. For example, the word ‘SPIN’ could be visualized by displaying a spinning animation of the word, or the letters that make up the word, with related environmental elements that help provide a context for the spinning action.","short_description":"My thesis question is how can text be better visualized to more fully take advantage of the dimensionality made possible in virtual spaces. I have been curious to explore new ways to visualize text in virtual spaces that move beyond traditional 2D graphic design.","further_reading":"<p>My previous work experiences in Korea were very much text related. Having worked as an editor and copywriter, I am interested in the visual power of text and how words can be designed to enhance the telling of stories. After studying graphic design, I learned how typeface is often as important as other graphic elements in terms of delivering a clear and strong message. That is why I am interested in the role of text design in virtual worlds. Through experiments like mine, my hope is that text design will start to evolve as a more integrated part of the story and experience in virtual spaces. </p>\n<p>AR as a medium falls at the intersection of traditional 2D print and 3D virtual space. In a way, it is 2 ½ D. It allows for the display of information such as text in 2D and 3D at the same time and lets users experience how text might be enhanced and further brought to life through animation in virtual space. As a test case for exploring the design of text in virtual space, I started with some prototype examples of using AR for learning simple vocabulary words in a foreign language through animated visualizations and related audio support for pronunciations. My target audience is three-fold: (1) Non-Korean speaking adults who want a taste of learning Korean, (2) Beginner learners of Korean who already know the Korean alphabet but want to extend their vocabulary in a fun, playful way, and (3) Graphic/motion/3D designers who are interested in the creation of text and typography in virtual worlds. My goals here are to show a new way of visualizing text in AR/3D, to suggest that AR/virtual space is a great medium for experimenting with text design and to begin to establish new conventions for the use of text in virtual worlds.</p>\n<p>A couple of projects in particular have inspired the design of my thesis prototype. WordWorld is an American animated television series for preschool children focused on word building. It reinforces the pre-reading concept that letters (and their sounds) make words, and that words have real meaning. The meaning of words is visualized by the arrangements of the letters. For example, the word ‘cow’ is depicted by the letters, c, o, w.  arranged in the shape of a cow. WordWorld also introduces essential emergent literacy concepts—such as sounding out letters, “chunking” words, and rhyming—that all children encounter as they learn to read.  (http://www.wordworld.com/)   <br />\nConcrete poetry, which is defined as “poetry in which the meaning or effect is conveyed partly or wholly by visual means, using patterns of words or letters and other typographical devices” (definition by google) has also been in inspiration.</p>\n<p>My visual communication with text in AR prototype takes the form of a one-day-at-time calendar pad with AR enhancements for use at home, school, or the office. I chose a one-day-at-time calendar for a couple of reasons.</p>\n<p>First, checking a calendar is a daily ritual. Second, an old-style paper calendar brings out brings out nostalgia and also requires the physical interaction of tearing one page off every day. In this technological world, most of the interactions we have involve touching screens. But we still love the analog feeling of more traditional interactions. In the design of my prototype I have tried to combine a traditional interaction with a physical object with a technology-enabled, virtual response. By augmenting the old-style calendar with AR, I feel I can suggest one of the ways we can begin to consider new forms of text design for virtual experiences in the future.  </p>\n<p>For my prototype, I’ve experimented with three Korean verbs. Each page of the paper calendar prototype includes the day’s date written at the top, one of the verbs written in Korean letters in the middle and the phonetic pronunciation of the verb written in English at the bottom. When users hold the phone over the letters written on each calendar page, they see an AR animation of the letters that suggests the meaning of the verb, hear the pronunciation of the word in Korean, and see the equivalent English word. For now, the calendar only includes verbs because one of my goals was to create AR animations to depict meaning and verbs are more suited to this goal than nouns or other forms of speech. Ultimately, other editions of the calendar might be developed to include nouns or more intermediate level language constructions. For creating the AR enhancements, I used Unity and 3D modeling programs.</p>\n<p>The user-testing I did gave me some useful feedback. For example, I tested four different calendar designs and chose the most readable design among the four. When I tested an AR animation for the Korean word ‘돌다[dor-da]’ which means ‘spin’, I found that the animation was too overwhelming for most people and needed to be revised. The Korean word was a bit hard to read and recognize due to the constant spinning. I also found that the animations were viewed differently depending on whether they were viewed on a screen or in a virtual AR space. A lot of revisions were needed in the virtual AR space in order to match the 3D text animation on the screen. Moreover, the placement of the 3D text and visual elements in AR determined whether or not the visual communication was successful. From my trial and error testing with text in AR, I truly felt that the integration into the environment was the most significant characteristic I had to consider. </p>\n<p>Through the long journey of designing and developing my thesis prototype, I learned that, although a lot of experimentation is left to be done, AR text enhancements can help bring meaning to words. In the future, I would like to learn more 3D animation skills so that I can extend my research with text in virtual space, experiment with new ways to integrate text more fully into virtual story environments, and explore other possibilities, such as optical illusions in 3D space.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail-7.jpg","title":"thumbnail","alt":"textARt","caption":""},"topics":[{"name":"Education","slug":"education"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/video/269232664","video_documentation_url":"https://player.vimeo.com/video/265448726","project_url":"http://jinheeahn.squarespace.com/textart","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail-7.jpg","title":"thumbnail","alt":"textARt","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thesis-1.jpg","title":"thesis","alt":"3","caption":"3d"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thesis2.jpg","title":"thesis2","alt":"textARt","caption":"1"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thesis3.jpg","title":"thesis3","alt":"2","caption":"2"}]}