{"post_id":461,"student_id":"63","student_name":"Jacquelyn Zen","student_slug":"jacquelyn-zen","advisor_id":"124","advisor_name":"Kathleen Wilson","advisor_slug":"ksw222","project_title":"Spotter","project_question":"I’m sure a lot of ladies have felt this fear before: you are sitting in class when suddenly, Aunt Flo makes a surprise visit. A lot of people in this situation are ready, however, some people are not so prepared.\r\n<br />\r\n<br />\r\nDo you struggle with the tampon machine in the bathroom only to find that it’s empty? Do you run to the pharmacy a few blocks away? What if you are in the middle of nowhere and cannot find help?\r\n<br />\r\n<br />\r\nThe usual solution is to find another woman and discreetly ask for a tampon. The common experience amongst women is that there is a built-in community where we are more than happy to help one another in these times of need. However, it is not so easy to find help in the STEM field where the majority of your colleagues are male.\r\n<br />\r\n<br />\r\nIn comes <i>Spotter</i>, an app that can help you locate other women around you who can offer you help. The idea is simple: when you are in need of a tampon, you can send an emergency signal from your phone, and it notifies other women in your vicinity that you are in need of help.","short_description":"<i>Spotter</i> is an app that allows women to send an emergency signal from their phone to other women in their vicinity when they are in need of a tampon.","further_reading":"<p>The concept of <i>Spotter</i> was developed when I was sitting in an undergraduate computer science class. One day, during an important lecture, I suddenly got my period and realized that I was not prepared. The bathrooms did not have tampon machines, and I did not want to go home and miss the lecture. Looking around my classroom, I realized that there were only two other women in my class and I did not know them. There was no way I could interrupt the lecture to get up and ask them if they had a tampon.</p>\n<p>I thought to myself “If only there was a way I could contact these women without disrupting the class.”</p>\n<p>In 2013, Free the Tampons published the results of a survey called “The Murphy’s Law of Menstruation.” It reports that 86% of U.S. women who have started their period unexpectedly in public are without supplies that they need. Only 8% reported that dispensers in the bathroom work all the time, meaning these machines are unreliable. 34% of women went home immediately to get supplies, however, this is a huge inconvenience. It is also reported that 53% of women asked another woman for supplies.</p>\n<p>Besides the obvious issues of logistics, there are emotional issues attached to this as well. Women reported feeling embarrassed, annoyed, anxious/stressed, and panicked throughout this ordeal.</p>\n<p>Several apps exist, or have existed, that are similar in some ways (mostly in purpose, but not content) to <i>Spotter</i>, including PulsePoint, Sober Grid, Yik Yak and Code Red. In terms of women’s health, a wide range of period-tracking apps are also available.</p>\n<p>PulsePoint is an app that allows users to view and receive alerts about people nearby who are having a cardiac emergency and may require CPR. This allows nearby users to spring into action and perform CPR where it is needed. <i>Spotter</i> is similar in this aspect. Users can send out alerts to other nearby users who can offer help in the form of menstrual products. However, <i>Spotter</i> is not a replacement for emergency services and should be used as an option rather than an only solution. </p>\n<p>Sober Grid is an app to bring together a community of people going through the Alcoholics Anonymous recovery program. It is a geosocial networking app that connects people to other sober people or to a sponsor when they are in need. Spotter aims to connect a community as well, however, unlike Sober Grid, <i>Spotter</i> is not a social networking platform.</p>\n<p>Yik Yak was an app that was popular around 2014 and is no longer available. It allowed users to anonymously communicate with other users within a certain radius, usually a college campus. This radius was known as a “herd”, and users could only communicate within their herd. When a user changed their location, they connected to the herd of their new location. Spotter borrows the idea of the “herd” in order to build upon the local community.</p>\n<p>Code Red is an app that was conceptualized by Harvard students in 2012. It allowed users to send out a “red alert” that would ping nearby users when they were in need of a tampon or pad. There is very little information available about Code Red, but it is noted that male software developers found the concept “weird.” Spotter aims to fill the void of this app and improve on its design. Since there is a lack of documentation about Code Red, Spotter has a clean slate to work with. Our society has evolved a lot in the past few years, and there are more female software developers willing to work on it now. Periods are slowly becoming a less taboo subject, and it is now a great time to reintroduce this concept.</p>\n<p><i>Spotter</i> aims to be categorized as a tool that is just as useful to women as period-tracking apps. Some apps that are currently available in that category include Clue, Period Tracker, and myPill. The usage of these apps is usually just a few times a month. Spotter is similar in usage since it is usually only used when the user is on their period. In order to align Spotter with these apps, the color scheme is designed to be similar. However, the interface is designed so that the color scheme can be changed from the feminine pink and purple to something else and still make sense. Spotter is currently a prototype built in Sketch and Invision.</p>\n<p>When the <i>Spotter</i> app is first opened, the user will be prompted to sign in or sign up for an account. For this thesis project, the target users will be NYU students and their identities will be verified through their NYU emails. In order to sign up for an account, the user must input their full name, NYU email, a password, and a photo of themselves. A code is then sent to their emails, and they are prompted to enter it into Spotter. Once the verification process is complete, the user will be led to the main screen. There, users can find their profile, their current network, and a prompt asking if they are looking for a tampon, a pad, a tampon or pad, or painkillers.</p>\n<p>The “current network” is the name of the local radius that the user is in, for example, Tisch School of the Arts, or Washington Square Park. These networks are usually walkable areas. Tapping on the current network will lead the user to a screen where they can find their network if it is not correct, and view the current requests from that network. The “current requests” is a list of users in that network who have sent out a request for help. It will also list a countdown from five minutes, which is the time limit of each request, as well as the menstrual product they are looking for. Selecting a requester from that list will add the user to the requester’s queue, and the requester will get the option to message the user. Chats can only be started by the person requesting.</p>\n<p>If the user is requesting a product, they have the option to choose between a tampon, pad, tampon or pad, and painkillers. Choosing one of these options takes the user to a searching screen where their network is listed as well as the product they are looking for, the time left in the request, and a list of users who responded to the request. The user then has the option to start a chat and message anyone on the list. The user also has the option to end the chat at any time by tapping on the “end chat” button. They are then led to a screen where they are asked if that person was able to help them. Choosing “yes” leads to the user increasing their “received” score by one and the responder will increase their “responded” score by one.</p>\n<p>While user testing <i>Spotter</i>, I have gotten a lot of feedback that changed the interactions. The original idea was that users located each other using GPS. However, user tests proved that since users will most likely be in the same area/building, and GPS cannot detect the difference in floors, it would be more useful for users to locate one another through a chat.</p>\n<p>Another change was the idea of connecting to a local network. I originally designed Spotter to send requests within a certain radius depending on the user’s specific location, however, it did not seem to work if the user is in one building but the responder is in the building next door. It was then decided that users would connect to a local network instead.</p>\n<p>The biggest change was the identity verification system. After many discussions and user tests, I realized that users are wary of meeting with strangers. Due to that concern, I did research on verification systems and how to gain trust within a community. I was heavily influenced by Airbnb’s verification system which requires uploading a government ID. After user testing that, users still stated that it was a very robust process and that might not be necessary if the people they are interacting with are part of a network they are familiar with. I decided that <i>Spotter</i> will begin on a smaller scale, starting with the NYU community first, which already has a layer of trust and community. Users can now be verified through their NYU email, making the process much simpler and easier for users to onboard.</p>\n<p>The goal of <i>Spotter</i> is to not only help women help others, but also help women find a community to connect with where these topics are not off-limits. The next step for Spotter is to expand to more items and a wider audience. The hope is for it to be a “Craigslist-on-the-go” for people who forget certain items at home when they are out. For the time being, I believe that <i>Spotter</i> is a practical solution to the issues modern women face today.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/mockup2.jpg","title":"Spotter Thumbnail","alt":"Spotter Thumbnail","caption":""},"topics":[{"name":"Tool\\Service","slug":"toolservice"},{"name":"UX\\UI","slug":"uxui"}],"video_presentation_url":"https://player.vimeo.com/video/269232906","video_documentation_url":"https://player.vimeo.com/video/265930870","project_url":"http://jackiezen.com/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/mockup2.jpg","title":"Spotter Thumbnail","alt":"Spotter Thumbnail","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/1-5.png","title":"Spotter Intro","alt":"Spotter Intro","caption":"With Spotter, you will never be unprepared again"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/2-1.png","title":"Spotter Search","alt":"Spotter Search","caption":"Send an emergency signal to other women in your area when you are in need of a menstrual product"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/3-1.png","title":"Spotter Requests","alt":"Spotter Requests","caption":"View and respond to requests within your network"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/4.png","title":"Spotter Sign Up","alt":"Spotter Sign Up","caption":"Secure sign up through NYU email verification"}]}