{"post_id":370,"student_id":"64","student_name":"Koji","student_slug":"koji","advisor_id":"124","advisor_name":"Kathleen Wilson","advisor_slug":"ksw222","project_title":"Mtindo","project_question":"What kinds of practical style transfer applications can be developed for non-technical people, such as creative professionals, that are easy to use, efficient, and push beyond the limits of what is currently possible with existing graphics tools? People think that machine learning requires a Ph.D./CS degree and a background in mathematics and statistics. It all sounds very complicated and difficult. \r\n<br />\r\n<br />\r\nUnfortunately, machine learning isn’t easy to learn, but using applications designed with non-technical people in mind isn’t so hard and can be a lot of fun. Style transfer, which is the technique of recomposing images in the style of other images, is one form of machine learning that has started to be made available online to the general public through simple games. \r\n<br />\r\n<br />\r\n<i>Mtindo</i> is a style transfer application for the desktop that offers non-technical people a unique opportunity to experience machine learning in action that explores some of the practical potentials of style transfer, beyond the game-like applications that are currently available. <i>Mtindo means style in Swahili.</i> ","short_description":"<i>Mtindo</i> is a style transfer application for the desktop that offers non-technical people a unique opportunity to experience machine learning in action that explores some of the practical potentials of style transfer, beyond the game-like applications that are currently available. <i>Mtindo</i> means style in Swahili.","further_reading":"<p><b>Rationale</b></p>\n<p>Although machine learning is not new, it has resurfaced in the past couple of years. In my understanding, this time is different because, with advances in affordable technology, most people today can easily try out machine learning programs on their home computers. In addition, there are some options which let us use a GPU (Graphics processing unit) cheaply. Companies like Google have made programs available to the general public, such as a popular program that lets you find artwork that is similar to your face. However, programs like these are limited in many ways. Google’s application is great because they have improved the results with data collecting from users. However, the downside is the result could be different every time. <i>Mtindo</i> doesn’t collect any data from users, so the results have consistency and users can try their faces and other images. In addition, <i>Mtindo</i> offers an application which doesn’t need pre-trained models, which provides flexibility for users. Literally, with <i>Mtindo</i>, people can try style transfer with any images and also adjust the strength of the style.</p>\n<p><b>Goal</b></p>\n<p>My project had several goals. The first was to build an easy to use prototype application that would let non-technical people experiment with style-transfer. Next, I wanted to develop the application more, by replacing current code with front-end framework such as Vue.js to make the applications flexible. My ultimate goal is to make <i>Mtindo</i> an open source project so that I can share the code and pre-trained model with others. </p>\n<p><b>Target Audience</b></p>\n<p><i>Mtindo</i> is targeted at creative professionals who are looking for ways to incorporate machine learning into their work through the use of style transfer applications, as well as for non-technical people who are interested in seeing the kinds of things machine learning can do.</p>\n<p><b>Research/Comparative Projects</b></p>\n<p>Most of the research about style transfer is based on “Image Style Transfer Using Convolutional Neural Networks” a white paper by Leon A. Gatys et al. In this paper, Gatys introduced a method that allows for the retention of content information about an image using CNN (Convolutional Neural Network). Gatys’s algorithm can learn an image’s content and style representations and can manipulate both representations independently when comparing a source image with a style image to produce a new image. That is, the newly generated image can have the style of the style image,but retain the content of the original source image. </p>\n<p>Most of the style transfer applications available on the market are for smartphones (iPhone/Android). Typically, they offer a limited number of styles for free, but charge a fee for the rest. Using these apps can be as simple as taking a picture, selecting a style, and waiting some time for the style selected to be applied to the picture. Prisma is the most famous mobile application. In addition, there are a few applications for use on laptops such as DeepArt, Painnt and Style App. Some applications, such as Aristo and Style App, support style transfer for videos. </p>\n<p></b>Design - Project Features and Functionality</b></p>\n<p>Mtindo differs from the style transfer apps on the market in several ways. My development efforts have been primarily focused on trying to improve the style transfer algorithm by enhancing the output and shortening the length of time it takes to generate images, which can be quite lengthy. <i>Mtindo</i> offers more than fifty pre-trained models, and all are available for free. In addition, <i>Mtindo</i> supports not just still images, but also videos, and there is no limitation on the duration of the videos that can be used. Furthermore, <i>Mtindo</i> allows users to incorporate any image they want as a style image and they can change up to three parameters to transform the output.</p>\n<p><b>Process - Prototyping, Phases, Iterations and User Testing - Feedback, Revisions</b></p>\n<p>I began my prototyping process with a basic version of Mtindo that let users recompose an image with pre-trained style models. When this initial prototype was complete, I got some useful feedback at the Quick &amp; Dirty Show, the Feedback Collective and during user interviews. Most people were quite positive about the output of the application and they enjoyed using it. However, they were not sure what it was for. Initially, I had wanted <i>Mtindo<i> to be a practical style transfer application for artists, but unfortunately, the prototype I presented had not quite reached that level. In addition, people did not find the UI very user-friendly. Many found it difficult to understand what they could/should do when they opened the application. </p>\n<p>As a result of this feedback, I revised the UI. I added some buttons to make the application’s workflow more understandable, including a start button, image uploading button, and image save button for a generated image. In addition, I labeled all the style images in the style select screen with the artist information. Now users can see a generated image before saving it and if they don’t like it, they can go back to the first step with one click. Moreover, I made two additional prototypes in an attempt to make the application more practical. The first was the style transfer application for videos mentioned above. The second was the enhancement to the basic version that allows users to choose a style from a selection of styles and change up to three parameters such as noise, style strength, and iterations.</p>\n<p><b>Lessons Learned - What Worked, What Didn't</i></p>\n<p>During the course of working on my thesis project, I learned that I could make style transfer prototypes that people enjoyed. I discovered that, in general, style transfer is of interest to most people and that my application is fun. However, I also learned that people did not see the practical potential of my prototype, which had been one of my initial goals. Some people asked me the difference between the filters you can use in photo applications and the effects made possible with style transfer applications. On the surface, they appear to be quite similar, but technically, on the level of the underlying algorithms, they are very different. I am still trying to find ways to make this difference more transparent by better harnessing the unique potential and practical uses of style transfer for artists and others to use in the course of their work.</p>\n<p><b>Conclusion + Next Steps</b></p>\n<p>I made three types of style transfer applications for my thesis project. Although Mtindo is fun to use, it has yet to reach the level that creative professionals might find it useful for their work/jobs. In order to make <i>Mtindo</i> more practical, there are many things I have to do as next steps. The first priority is to speed up the application, which is still quite slow, and add a new platform such as a web application. In terms of the web, I will need to create the API to offer flexibility. Eventually, I will need to restructure and recode the application to make this application open source. Right now, the code can only be understood by me. My goal is to make it understandable for many developers. There are many issues still to be resolved, but <i>Mtindo</i> has been a great starting point.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/mtindo_journal_thumbnail.png","title":"mtindo_journal_thumbnail","alt":"mtindo","caption":""},"topics":[{"name":"Machine Learning","slug":"machine-learning"},{"name":"Tool\\Service","slug":"toolservice"}],"video_presentation_url":"https://player.vimeo.com/video/269232995","video_documentation_url":"https://player.vimeo.com/video/265502404","project_url":"https://mtindo.ml","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/mtindo_journal_thumbnail.png","title":"mtindo_journal_thumbnail","alt":"mtindo","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/style_transfer_image.png","title":"What Style Transfer is","alt":"What Style Transfer is","caption":"What Style Transfer is"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/mtindo.png","title":"mtindo","alt":"mtindo basic and video","caption":"mtindo basic and video"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/journal_image_no_pre-trained_model.png","title":"mtindo free-model","alt":"mtindo free-model","caption":"mtindo free-model"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/output_free.gif","title":"mtindo free ui","alt":"","caption":"mtindo free ui"}]}