{"post_id":152,"student_id":"68","student_name":"Nouf Aljowaysir","student_slug":"nouf-aljowaysir","advisor_id":"124","advisor_name":"Kathleen Wilson","advisor_slug":"ksw222","project_title":"Nouf.io","project_question":"What information is collected about me online? Can I recreate another version of myself based on who this data describes?\r\n<br />\r\n<br />\r\nNouf.io seeks to answer these two questions. I extract, scrape, and collect different archives of my digital information in order to understand who I am online. On a personal level, Nouf.io is a self-reflective character whose actions and behaviors visualize my digital persona.\r\n <br />\r\n<br />\r\nOn a broader level, she is a character representative of my data and its categorization and labeling of who I am. After looking through large amounts of my information, I noted many inaccuracies to how I was being portrayed such as “Nouf’s hobbies include acting and playing the harp”. Hence, I wanted to paint a picture to how algorithms categorize us based on interactions we have had online.\r\n<br />\r\n<br />\r\nServing as both a self-reflective piece and a commentary, I want users to interact with Nouf.io in order to push the boundaries of privacy and accessibility to my information. Depending on the identity of the user and the amount of interactions we have had via text and Facebook, Nouf.io discloses private information based on our level of digital intimacy. In the same manner that data is passed around online between Facebook and Google, what if I just handed it out and made it available to you? What does it feel like to get to know me if you have never met me? Does her honesty and raw information make you feel uncomfortable? ","short_description":"<i>Nouf.io</i> is a 3D scanned digital avatar that is simulated from my scraped online data points. She invites you to click on different objects within her virtual environment to learn more about the data she contains. Once clicked, Nouf.io discloses my private information depending on your identity and our level of online interaction. ","further_reading":"","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail-9.jpg","title":"thumbnail","alt":"nouf.io","caption":"nouf.io"},"topics":[{"name":"Data","slug":"data"},{"name":"Identity","slug":"identity"}],"video_presentation_url":"https://player.vimeo.com/video/269233606","video_documentation_url":"","project_url":"http://www.noufaljowaysir.com/#/nouf/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail-9.jpg","title":"thumbnail","alt":"nouf.io","caption":"nouf.io"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/1-3-1024x529.png","title":"nouf.io","alt":"nouf.io","caption":"nouf.io"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/3-2.png","title":"Saying hello","alt":"Saying hello","caption":"Saying hello"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/4-1.png","title":"Watching Nouf.io","alt":"Watching Nouf.io","caption":"Watching Nouf.io"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/2-2.png","title":"Nouf.io environment","alt":"Nouf.io environment","caption":"Nouf.io environment"}]}