{"post_id":297,"student_id":"7","student_name":"Grau Puche Recarens","student_slug":"grau-puche-recarens","advisor_id":"114","advisor_name":"Adaora Udoji","advisor_slug":"aeu4","project_title":"lligam","project_question":"The main thread of this project is the desire to break out of screen-based interactions. Wanting to go away from a visual-feedback-only world, and building something engaging that comes through touch. [ʎigam] is not about finding a solution but going away from the norm and making something weird through an exploration of physical interaction. And that relies on screen just as an accessory or an intensifier.\r\n\r\nThis experimentation had various parameters decided a priori as it had to have a clear end goal making sure something came out of this. The resulting device would be a game composed of two different items; a physical controller, and a digital game. The control was built first and is the main element and platform for the digital game. The video game is linked directly to the controller and only makes sense with it. The reasoning for these parameters besides personal ones is the fact that games are a great exemplifier of good, and bad interaction *building.*\r\n\r\nAll these contributing factors have coalesced into the creation of CCR (CatCat Revolution). An arcade-style game where the player has to pet a cat according to their picky request and try to make them happy (no one is sure if it is even possible)","short_description":"Most video games are built on top of an existing platform, meaning that the main focus is what we see on the screen. <i>lligam</i> [ʎigam] explores the idea of building a platform as the main element, therefore, making the screen's content just a support element for the physical interaction.","further_reading":"<p>This exploration was set to create specifically a game for the following reasons. Games are great examples of what a user experience is supposed to accomplish, as any other product, they show how good or bad the experience is just by having users interact with them, plus their general purpose is clear. Was it fun? do people want to keep playing it? These characteristics make the effectiveness of their design very straightforward. and therefore an effective test for interaction. From this relation between user and interface or game and controller, comes the name of this thesis. \"Lligam\", [ʎigam] is a Catalan word that can be translated to \"connection\" or \"dependency.\"</p>\n<p>To know what the game was going to be, the controller needed to be built first. A physical controller can be many things, it has only one condition, it has to be physical. That is not much to start with, so more parameters were required to make this a bit easier. The interaction space was narrowed from the whole body to the hands, as they offer a lot of possibilities in terms of movement and they are the area that humans have the most precise control over.</p>\n<p>It is worth noting that although from the very start, it was clear that the end result was going to be a game, the mindset was to make the game a consequence of the controller, not the trigger for a specific device and interaction.</p>\n<p>Various iterations of the controller were made, they were done based on hand movement and how people expect to interact with, known and unknown devices. This had two purposes. First, to see what works and what doesn't, and second, to scope the different ways of quantifying the created interactions. The best sensor to read movement in a precise manner was the good old joystick, other more interesting sensor are too imprecise to become a controller.</p>\n<p>The final iteration of the interaction was a joystick with an elevated base on it, making the strength needed to move it much lower, this base was made so the user would place their hand on top a and instead of using just the fingers the whole arm does the movement, this makes it possible to move the control with only one and with almost no effort. making subtle movements very pleasing to do.</p>\n<p><img src=\"https://camo.githubusercontent.com/6e986501165341128c21578889d32ae1ffa43dd0/68747470733a2f2f7374617469632e6e6f74696f6e2d7374617469632e636f6d2f64363037326263612d376233392d343735302d626565632d3339613432336434353733302f6a6f79732d322e706e67\"></p>\n<p>This controller became the final interaction and the next step was to find a fitting game to test the controller and intensify the interaction. Because of the success that subtle movements showed to be during user testing, it was fitting to make this a control for a cat petting game. The idea was well received and the popular opinion was to make the top of the controller furry, to give the interaction a bit of immersion, which also proved to be very effective.</p>\n<p><img src=\"https://camo.githubusercontent.com/10f5c81e8fa4f39da382cdaa068aa8ba759aa928/68747470733a2f2f7374617469632e6e6f74696f6e2d7374617469632e636f6d2f32653536633261652d653232322d343531662d393837332d3065636536346265373836642f6a6f79732d342e706e67\"></p>\n<p>Making the controller was not very problematic, but the source of headaches came with the communication with the web. It was decided that due to my skill set, the best option was to make the game web-based. And the best option to make a micro-controller talk to a website was 'web sockets' that was a big hiccup. the rest of the hardware also proved to be challenging by having to use a multiplexer and then having problems to upload to the chip that was being used (ESP6288).</p>\n<p>The game was easier to make a reality as is just a system to prove the strength of the created interaction. All the animations were done from scratch and the aesthetic was a mix of retro and childish styles.</p>\n<p>to go more in depth to the whole process of this project you can visit the <a href=\"https://github.com/grauPuche/_lligam\">github repository</a> or my <a href=\"https://blog.graupuche.info/thesis/\">website</a>.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Screen-Shot-2018-04-18-at-15.05.48.png","title":"CCR, realization of lligam","alt":"the face of a cat","caption":""},"topics":[{"name":"Tangiable","slug":"tangiable"},{"name":"UX\\UI","slug":"uxui"}],"video_presentation_url":"https://player.vimeo.com/video/270188561","video_documentation_url":"","project_url":"http://blog.graupuche.info/thesis/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Screen-Shot-2018-04-18-at-15.05.48.png","title":"CCR, realization of lligam","alt":"the face of a cat","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/imgThesis-2.gif","title":"imgThesis-2","alt":"a fluffy controller","caption":"the resulting interaction"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ingThesis-1-1.gif","title":"imgThesis-1","alt":"two people play with handmade janky controllers","caption":"firsts prototypes done to figure out the core interaction"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/imgThesis-3.gif","title":"imgThesis-3","alt":"Joseph the cat smiling to us","caption":"CCR, (Cat Cat Revolution) is the realization of this thesis, a good suiting game for the controller"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/imgThesis-3-1.gif","title":"imgThesis-3","alt":"Joseph the cat smiling, he likes to be pet","caption":"the game made for the controller is a cat-petting game called CCR"}]}