{"post_id":247,"student_id":"71","student_name":"Pan Pan","student_slug":"pan-pan","advisor_id":"124","advisor_name":"Kathleen Wilson","advisor_slug":"ksw222","project_title":"Actively","project_question":"There is no one like your child. Every child's development is unique and complex. Although children develop through a generally predictable sequence of steps and milestones, they don’t necessarily proceed through these steps in the same way or at the same time. Play is essential to development because it contributes to the cognitive, physical, social, and emotional well-being of children and youth.\r\n<br />\r\n<br />\r\nPlay also offers an ideal opportunity for parents to engage more fully with their children. Unfortunately, given the hectic pace and over-scheduling of life today, time for free play has been markedly reduced in recent years despite the benefits derived from play for both children and parents.\r\n<br />\r\n<br />\r\nMore and more kids are glued to their phones or tablets for endless hours every day. Even those children who are fortunate enough to have abundant available resources and who live in relative peace may not be receiving the full benefits of offline play. Parents are not only worried about all the time their children are spending with technology, but they are also worried about the lack of time they are spending with them. Active.ly is an app designed to help parents turn the time they have with their children into more memorable moments that maximize the benefits of play offline.","short_description":"Parents of young children are often at a loss when it comes to knowing the best kinds of activities to pursue with their preschoolers. Most parents often wonder how to optimize the time. <i>Active.ly</i> is an app created for parents to help them find appropriate, customized, offline activities.","further_reading":"<p>The goal of my thesis project was to design an app to help give parents customized play-plans and improve their valuable time playing with their children. I wanted to make it easy for parents to find appropriate play activities and encourage them to play with their children to help develop their creativity, physical and emotional strength, and cognitive functioning. I am a full-time student and also the mother of a 4-year-old boy. I only have a short time to play with my son each day. When I do have the time, I am always stressed trying to choose activities. Sometimes I just watch him play. I have developed active.ly to help me with this problem, which many parents share.</p>\n<p>The target audience for active.ly is parents of 3- to 5-year-old children who are looking for developmentally appropriate activities to play with their children. Playing with kids has several barriers to entry: you need to figure out what, where, and how you want to play, and then you need the time, money, and energy to follow through. For these reasons, my app needed to serve double duty. It needed to be inviting and intuitive to use, and it also needed to overcome all the factors that currently keep parents from playing with their kids. It was also important that the suggested activities could be pursued with relative ease, without needing to purchase expensive new materials or toys. </p>\n<p>To tackle these challenges, I created three main features: the main page, the activities detail page, and the community page within each activity, as well as a list of questions for parents to answer to develop developmental profiles for their children. </p>\n<p><i>1. The Main Page</i> </p>\n<p>The main page is an important feature because it’s the first thing parents see when they open the app and they are looking for activities for their children. I theorized that users coming into the app would fall into one of three groups:</p>\n<p>Passive: These parents will be less active users. For this group, I created the Featured section, which shows five suggested activities parents can do right away based on their children’s profiles.</p>\n<p>Explore: These parents will be more active explorers of the app, looking around and browsing for general types of activities, but they will not be sure about the specifics. For this group, I made it easy to find activities via search by camera or category. </p>\n<p>Active: These parents will have more of an idea about what they want to know about their children’s milestones and plan what they want to do with them. For this group, I created a curation tool:  The Queue. With this tool, users can put together their children’s “milestones” and easily add and remove activities as they wish. (Milestones include Physical Development, Behavior, Language, Health and Nutrition, Sleep, Social Development, Education) </p>\n<p><i>2. The Activities Detail Page</i> </p>\n<p>The second feature of the active.ly app is the activities detail page, where intuitive instruction is the most important goal. In order to engage the parents more fully and encourage them to finish the activities with their children, I designed a set of 5-8 electronic flashcards for each activity as well as a progress bar to let parents know where they are and how many steps they have left. My hope is that the short duration of these activities and the accompanying guidance with the flashcards, will help encourage parents to play more frequently with their kids. </p>\n<p><i>3. the community within each activity</i></p>\n<p>The third feature of the active.ly app is the community within each activity. After parents and their kids finish each project, they can upload a photo to this activity and also leave feedback or comments for other parents. My hope is that this social aspect will encourage parents to play more with their kids and also learn from other parents. </p>\n<p><i>What're the Lessons learned from the user test?</i></p>\n<p>When I first designed the active.ly app, I did not think about the three different user groups. I prototyped the camera search as the main function, but after the user test with my son’s classmates’ parents, I found that it was not really working for everyone. Each family was different, with different needs and require different approaches. I realized that I needed to think more broadly and more deeply about my target users. </p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/logo-2.png","title":"logo","alt":"LOGO","caption":""},"topics":[{"name":"UX\\UI","slug":"uxui"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/video/269233997","video_documentation_url":"","project_url":"","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/logo-2.png","title":"logo","alt":"LOGO","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/kid-quote.png","title":"kid quote","alt":"kid quote","caption":"kid quote"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/passive.png","title":"passive passive","alt":"passive passive","caption":"passive passive"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ui.png","title":"ui","alt":"ui","caption":""}]}