{"post_id":629,"student_id":"72","student_name":"Steven Simon","student_slug":"steven-simon","advisor_id":"124","advisor_name":"Kathleen Wilson","advisor_slug":"ksw222","project_title":"BrowseBetter","project_question":"The internet has become a constant presence in our daily lives. Whether we use it to pay our bills, book our next travel destination, or access our medical information, the internet serves as an important tool in completing everyday tasks. As technology has continued to advance, the internet’s ability to learn who we are has become a key element in crafting user experiences. Yet, these ever changing advancements raise the question of whether intelligent websites can positively enhance or negatively complicate a users belief and experience when using the internet. \r\n<br />\r\n<br />\r\nThus, users begin to wonder how much control they have over their own individual experience and how this can impact their satisfaction, confidence, and trust in the websites they use regularly. Is there a way for the internet to be equally accessible to all individuals possessing different capabilities and preferences while putting the user in control of their own experience? Research suggests that user beliefs and satisfaction, in regard to web design, are greatly impacted by ease of use and familiarity. Therefore, user preferences within a website design should be used to create a customized user experience because it will increase user satisfaction and productivity.","short_description":"<i>BrowseBetter</i> is a website where users can log into a personalized account and experience outside websites through their own customized filter settings. This allows users to quickly and efficiently browse online, enhancing their overall user experience.","further_reading":"<p><b>The Problem With The Web</b></p>\n<p>The internet has increasingly become a necessary and ever present tool in today’s society. Everyday tasks that were once done in-person are being pushed more and more online. Things such as banking transactions, buying insurance, and even grocery shopping have become actions that are fulfilled primarily on the internet. This rapidly progressing use of the internet, however, can pose a challenge to some users who are not accustomed to completing these tasks on the web. Whether challenges are due to a lack of control, a disability, or an unfamiliarity among inconsistencies with web design, there are problems that arise with the fast advancements of technology.</p>\n<p><b>The Problem of Inconsistency</b></p>\n<p>One scenario, which is a common among many individuals in today’s society, is that of the user who is overwhelmed by having to learn and relearn how to navigate the internet due to inconsistencies in web design. Julie, who is a recent graduate of New York University is accustomed to always going into the student system to search for classes and check her grades. After using the student system for four years during her time as undergraduate, she now knows exactly where everything is that she uses on the system. However, now that Julie has graduated from New York University, her priorities have changed, and she wants to be able to easily order transcripts instead of searching for classes and checking grades. She will be applying to graduate school soon and will need to easily and conveniently locate her transcripts from all the previous institutions where she took classes. Having taken classes at New York University, as well as summer classes at Borough of Manhattan Community College, she is now daunted with the task of finding how to order transcripts from both student websites. After spending too much time searching for the link to order transcripts, she is unnecessarily frustrated to find the links in different places and with a different naming convention on each student portal. The time spent to find these links could have better been spent working on her personal statement and application materials. With today’s ever advancing technology, there should be a simple solution to this problem; easing the frustration of both Julie and the many other individuals who experience this kind of annoyance on a daily basis. </p>\n<p><b>The Problem of Intelligent Web Design</b></p>\n<p>Another scenario, that causes concerns among many individuals in today’s society, is the fact that the internet displays content based on information that is beyond an individual’s control and consent. Martin, a middle-aged photographer living in New York City, went to Amazon.com to buy a new camera lens for his job. However, because Martin was previously looking at different travel destinations, he noticed that Amazon began displaying smart advertising suggestions based on Martin’s previous online behavior and private situation. Martin now feels as if the web, and Amazon, is trustworthy and out of his control and preference as a user. In 2011, Antonio Garcia Martinez and other engineers at Facebook created what is known today as smart advertisements, or advertisements that track user behavior online. Smart advertising may be beneficial for businesses, but it can make users feel as if they have no control over their experiences and what they see online. There should be a way for users to control how they experience certain websites, as well as a way to set up the preferences they may have. Users should feel as if they are always in control, and therefore, it’s important that the user always is in control and has the choice of how they experience the websites that they use.</p>\n<p><b>What is BrowseBetter?</b></p>\n<p>It’s no secret that the internet today knows who we are when we browse websites. Yet, despite this, users of the web have little control over their online experiences. BrowseBetter was inspired by the need to give choices and control to the user, while creating a familiar, comfortable, and trustworthy environment online. Users are often not sure where something is on a website, as well as what all their options are when visiting a website. Users also often feel as if websites behave automatically beyond their control due to websites tracking user behavior. <i>BrowseBetter</i> gives users control of and familiarity with the websites they browse through the use of personal settings.</p>\n<p><i>BrowseBetter</i> is a website where users can log into a personalized account and experience outside websites through their own customized filter settings. This allows users to quickly and efficiently browse online, enhancing their overall user experience. <i>BrowseBetter</i> is designed for those that use the web to shop, pay bills, and perform various important tasks but are frustrated with learning and remembering how to use a variety of websites that all work differently. Also, <i>BrowseBetter</i> creates trust among users by allowing them to control how they view and experience the websites they visit. Rather than relying on web intelligence to deliver content based on a user’s profile, the <i>BrowseBetter</i> user has settings in which they can decide how content appears.</p>\n<p>Originally intended to assist older generations with a learning curve for learning new platforms online, <i>BrowseBetter</i> helps anyone who has trouble finding their way around large websites. After logging into <i>BrowseBetter</i>, users can explore a variety of websites within <i>BrowseBetter</i> that are designed based on that user’s custom settings: where the menu, search bar, shopping cart and other icons are displayed, whether the user prefers videos or reading, and the size of icons and text. This allows the user to have an experience online within their own comfort and control which is important for satisfaction and productivity.</p>\n<p><b>Research</b></p>\n<p>Research suggests that an individual’s satisfaction and attitude toward certain websites is largely based on the ease of use and usefulness of web design (Song, 2005).This can be referred to as the technology acceptance model, which correlates with user frustration level when using websites. <i>BrowseBetter</i> provides a solution to the technology acceptance model by making websites easier to use by creating one set of user settings that apply to several web designs. Currently, the technology acceptance model encompasses intelligent websites that track their users. In a recent interview with National Public Radio, Antonio Garcia Martinez described how he and other engineers at Facebook created smart advertisements and how “there was never the question about whether this (smart advertisements) was moral or not” (Zomorodi, 2017). Websites that track their users creates feelings of discomfort, as well as feelings of a lack of control when using websites. <i>BrowseBetter</i> allows users to have control over the websites that they use without tracking them, and thus provides a way for users to have a customized experience while feeling comfortable.</p>\n<p>Research also suggests that users find websites easy to use when they are familiar with the design. Jenifer Tidwell explains in her book, Designing Interfaces, that websites that are easy to use are designed to be intuitive, which is clarified later as familiar (Tidwell, 2011). Because <i>BrowseBetter</i> allows the user to choose the design that works best for them, there is an ease of use for the user and a higher satisfaction because the user is familiar with what exists and where items are located within a web design.</p>\n<p><b>Testing</b></p>\n<p><i>BrowseBetter</i> was user tested at New York University at the ‘Quick and Dirty Thesis Show’ in March of 2018. Overall, the feedback was mostly positive with comments such as, “it is great that the same settings apply to several brands.” However, there were a few concerns. One concern that was mentioned was how the hierarchy of the customized websites will be handled. “With customizing, there may be a hierarchy problem. How do you organize what goes where and why?”  Eventually, all of the hierarchy will be handled by the user. As <i>BrowseBetter</i> continues to evolve, main hierarchy decisions will be made by the user within options provided by a web designer. Right now, <i>BrowseBetter</i> simply works to prove its purpose, that customizing websites increases user satisfaction and productivity. The hierarchy is currently decided by <i>BrowseBetter</i>, but it will eventually be decided by the user.</p>\n<p>Another concern expressed during testing  was that <i>BrowseBetter</i> might limit a web design’s potential. One tester asked if <i>BrowseBetter</i> would “limit me to seeing a variety of web designs only”  opposed to seeing websites with all kinds of different designs that cannot be customized. <i>BrowseBetter</i> does not limit the world of web design, but rather, adds to it. <i>BrowseBetter</i> is a feature that allows the user to see websites displayed based on their preferences if logged into BrowseBetter. If a user is not logged into <i>BrowseBetter</i>, the websites are displayed as they are today. By logging into <i>BrowseBetter</i>, a user can increase their satisfaction and productivity since everything is arranged to their liking. It was also noted that <i>BrowseBetter</i> will be “great for human resources and school administrators that get questions from employees and students about how to do things online.”</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/browseBetter_thumbnail.jpg","title":"BrowseBetter","alt":"BrowseBetter","caption":"BrowseBetter"},"topics":[{"name":"Tool\\Service","slug":"toolservice"},{"name":"UX\\UI","slug":"uxui"}],"video_presentation_url":"https://player.vimeo.com/vimeo/269234238","video_documentation_url":"","project_url":"http://browsebetternow.com","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/browseBetter_thumbnail.jpg","title":"BrowseBetter","alt":"BrowseBetter","caption":"BrowseBetter"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/1-6.png","title":"1","alt":"BrowseBetter","caption":"BrowseBetter"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/2-3.png","title":"2","alt":"BrowseBetter","caption":"BrowseBetter"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/3-3.png","title":"3","alt":"BrowseBetter","caption":"BrowseBetter"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/4-2.png","title":"BrowseBetter","alt":"BrowseBetter","caption":"BrowseBetter"}]}