{"post_id":581,"student_id":"74","student_name":"Woo Hyun Kim","student_slug":"woo-hyun-kim","advisor_id":"124","advisor_name":"Kathleen Wilson","advisor_slug":"ksw222","project_title":"Guidr","project_question":"Data reveals that my generation today is more inclined to share and crowd-source than to own. We’re in the “Uberization” period where open-source communities and peer-to-peer based sharing of goods and services are on the rise. People are sharing their personal belongings, cars, houses, and even experiences, which has lead to the shift in how Millennials travel.\r\n<br />\r\n<br />\r\nTraditional tour guides and travel books don’t appeal to Millennials anymore. We’re the type that crave the “hidden gems on the road less traveled.” And to achieve this kind of out-of-the-ordinary experience, Millennial travelers typically do an excessive amount of research, primarily through the Internet, and closely after, by word-of-mouth (WOM) referrals, which have been proven to be one of the most effective forms of persuasion.\r\n<br />\r\n<br />\r\n<i>Guidr</i> is a map-based website that consolidates travel experiences, in the form of personal recommendations. Travelers create and host interactive maps to share it amongst friends, family members, and like-minded travelers who can offer recommendations. Who better than the people who know you to advise on the most reliable recommendations? All invited contributors can search and add markers (places to visit) to the same map, accompanied by tips, notes, or media—a collection of trusted and valued input, under the basis of personalization.\r\n<br />\r\n<br />\r\nThrough personalized suggestions that are more than just a street address, Guidr aims to transform a mere space (a location with no substantial meaning, social ties, or value) to a memorable place (a location made meaningful by human intervention). Studies show that “travel experiences are more worthwhile when shared with somebody else.” <i>Guidr</i> acts as that platform where trusted communities come together to make experiences in unfamiliar locations more worthwhile. All along, enhancing the connection between like-minded explorers. Let Guidr <i>guide</i> you on your next expedition.","short_description":"How can sharing experiences of travel enhance connectedness? This travel recommendation tool is built for explorers who seek obscure yet meaningful discoveries in their expeditions through personal and connected stories of travel from their trusted network.","further_reading":"","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail3.png","title":"Guidr Thumbnail","alt":"Guidr Thumbnail","caption":"Guidr Thumbnail"},"topics":[{"name":"Tool\\Service","slug":"toolservice"},{"name":"UX\\UI","slug":"uxui"}],"video_presentation_url":"https://player.vimeo.com/video/269234371","video_documentation_url":"","project_url":"http://guidr.dani.kim/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail3.png","title":"Guidr Thumbnail","alt":"Guidr Thumbnail","caption":"Guidr Thumbnail"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/borderImage1-1024x576.png","title":"borderImage1","alt":"borderImage1","caption":"borderImage1"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/borderImage2-1024x576.png","title":"borderImage2","alt":"borderImage2","caption":"borderImage2"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/borderImage3-1024x576.png","title":"borderImage3","alt":"borderImage3","caption":"borderImage3"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/borderImage4-1024x576.png","title":"borderImage4","alt":"borderImage4","caption":"borderImage4"}]}