{"post_id":439,"student_id":"76","student_name":"Anastasios Germanidis","student_slug":"anastasios-germanidis","advisor_id":"129","advisor_name":"Nancy Hechinger","advisor_slug":"nh19","project_title":"Sybil Society","project_question":"In <i>Sybil Society</i>, you are not tied to one identity, one personality, one past. Here, you can create as many identities as you like and switch between them freely. Once you have selected an identity, an algorithm matches you with other users nearby, and a scene is generated based on your respective identities. \r\n<br />\r\n<br />\r\nExamples of scenes include: meeting a friend, going on a date, breaking up with a significant other, doing a job interview, having an existential crisis. You can continue living the life of that identity for as long as you like – an hour, a day, a month, a year. Then you can decide to become someone else.\r\n<br />\r\n<br />\r\nMark Zuckerberg said in 2010: “You have only one identity. Having two identities for yourself is an example of a lack of integrity.” In the past decade Zuckerberg’s vision of social life, where most of one’s online and offline activity is linked directly to a single legal identity, has become reality.\r\n<br />\r\n<br />\r\nBut pseudonymity is having a comeback, as people wake up to the myriad problems of the “real name internet.” Cryptocurrencies will enable people to participate in economic transactions without using their legal identity. Mixed reality headsets will get people to start identifying with the faces and bodies they choose, instead of those they were born with. Machine learning will allow people to mimic the style and behavior of others with ever-increasing accuracy. <i>Sybil Society</i> is today’s approximation of this weird future of fluid identities.","short_description":"<i>Sybil Society</i> is an experiment. It is a simulated society that operates in parallel with “real” society. Users choose fictional identities and have interactions in public spaces, receiving real-time instructions on their phones for all their dialogues and actions.","further_reading":"","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Artboard-Copy-3.png","title":"Artboard Copy 3","alt":"thumb","caption":""},"topics":[{"name":"Identity","slug":"identity"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/video/270187795","video_documentation_url":"https://player.vimeo.com/video/265269425","project_url":"https://sybilsociety.co","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Artboard-Copy-3.png","title":"Artboard Copy 3","alt":"thumb","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Artboard-2-Copy-3.png","title":"Screenshots","alt":"Screenshots of the Sybil Society app","caption":"Sybil Society Mobile Screenshots"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Artboard-2-Copy-4-1.png","title":"Your next scene has been generated.","alt":"Man and woman are staring at each other at Union Square while receiving instructions for their interaction on their headphones.","caption":"Your next scene has been generated."},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Artboard-2-Copy-2.png","title":"Bookstore Interaction","alt":"A man and a woman interact in a bookstore. The man is holding a book and is instructed to say that it is a beautiful meditation in middle class alienation.","caption":"Bookstore interaction"}]}