{"post_id":308,"student_id":"77","student_name":"Alexander Zimmer","student_slug":"alexander-zimmer","advisor_id":"129","advisor_name":"Nancy Hechinger","advisor_slug":"nh19","project_title":"Portraits of Evanston","project_question":"For middle school students, history is often seen as the truth, rather than a version of it.  Only by doing, can students begin to understand what it means to write history.   For three months, five students at the McGaw Hill YMCA in Evanston, IL engaged in writing pieces of their own family histories.\r\n<br />\r\n<br /> \r\nEach student engaged with their history by interviewing a family member about archival photos that they found in their home.  They subsequently engaged with the present state of their family’s history by interviewing various citizens in Evanston, IL.\r\n<br />\r\n<br />\r\nThroughout these experiences, students created media, working with a team of filmmakers to film their entire process.  In creating this media, students considered more deeply the writing of history itself.\r\n<br />\r\n<br />\r\nMoving forward, the stories of these five students will be used by teachers interesting in having their students engage in similar projects.  Shorts films depicting the process of researching and writing history that these five students went through, will be used to get other students excited about doing the same.\r\n<br />\r\n<br />\r\nAs these five students, and the others who follow, grow older, they will already have set the groundwork to think critically about history as being written by humans, and not a definitive truth.","short_description":"<i>Portraits of Evanston</i> is an audiovisual storytelling project and a curriculum that engages students with the concept of writing history. Students used qualitative skills such as interviewing and photography to research stories of their family history.  They documented these stories through film to inspire other students to understand what it means to write history.\r\n","further_reading":"<p><b>The Process</b></p>\n<p>The curriculum the five students in Evanston, IL went through unrolled in three stages: interviewing their families, interviewing their neighbors, and finally a public exhibit of their discoveries.\t\t</p>\n<p>Initially, the students found one to three photos in their home that were taken before they were born.  They brought these photos into class and practiced interviewing by asking each other questions about their various photos. Subsequently, they prepared a series of questions that they wanted to ask one of their parents or grandparents about the photos they had picked out.  Finally, they conducted and filmed this interview. </p>\n<p>In a second stage of the project, the students went on a field trip together.  We spent a weekend together interviewing different community members in a variety of different neighborhoods in Evanston.  None of these interviews were set up beforehand, they were all conversations that happened between the students and citizens on the street.  During these interviews, students learned the ways in which their own family histories intersect with those of their neighbors.  Ultimately, it also helped them understand the diversity of stories that exist just with their city.</p>\n<p>Finally, the students were interviewed.  They had the opportunity to speak about what they learned about their city, about their family and about History.  These interviews, along with the interviews they conducted with their parents and the people of Evanston, will be displayed publicly to showcase the work the students accomplished in a short 3-month period.</p>\n<p><b>The Insights</b></p>\n<p>While conducting this project, I had three major insights:</p>\n<p>1. All five students were all far from grasping the more abstract concepts that fueled the project in my mind.  Those concepts being the idea that history is not truth, but a collectively agreed upon narrative, and can often be a tool to create certain cultural norms.  However, the experience of writing history themselves will ideally stick with them when they ultimately are able to engage with abstraction in a more meaningful way.</p>\n<p>2. Most of the students were not ready to engage with family trauma, in the same way that they were not able to understand abstractions.  It was difficult at moments for many of them to understand what their families had gone through to get them to where they are today.  That said, they were all trying, and thus this was a powerful introduction to this type of historical narrative for them.</p>\n<p>3. In person, the students were more interested in sharing their stories than they were in listening to the stories of other students.  However, via media, video specifically, the students were excited to and invested in engaging with stories of students of the same age.  This made me wish I had been able to share the stories of other students at the beginning of the project to get them excited about what they would be doing.</p>\n<p><b>The Next Steps</b></p>\n<p>Moving forward, the stories of these five students will be edited into a series of videos: one main video that represents the process the students went through with the intention of getting the students excited about their project; and a series of shorter videos hosted on a web platform that students can engage with themselves.  I hope to distribute this multimedia website as a tool to be used by teachers around the country to help them with their own family history projects and curricula.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ymca2.jpg","title":"ymca","alt":"ymca","caption":"ymca"},"topics":[{"name":"Education","slug":"education"},{"name":"Narrative","slug":"narrative"}],"video_presentation_url":"https://player.vimeo.com/video/270188415","video_documentation_url":"https://player.vimeo.com/video/267063636","project_url":"https://www.alexzimmer.com","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ymca2.jpg","title":"ymca","alt":"ymca","caption":"ymca"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/movieMaking2.jpg","title":"movieMaking2","alt":"movieMaking2","caption":"movieMaking"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/camera2.jpg","title":"camera","alt":"camera","caption":"camera"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/alex2.jpg","title":"talking","alt":"talking","caption":"talking"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/kids_talking.jpg","title":"kids_talking","alt":"kids talking","caption":"kids talking"}]}