{"post_id":358,"student_id":"78","student_name":"Ariana Vassilopoulou","student_slug":"ariana-vassilopoulou","advisor_id":"129","advisor_name":"Nancy Hechinger","advisor_slug":"nh19","project_title":"A Fresh View","project_question":"Cyprus is a divided island separated by what is known as a political “Green Line.” Its formal name is the United Nations Buffer Zone, which is a demilitarized area patrolled by the United Nations Peacekeeping Force in Cyprus (UNFICYP). It’s been this way since the Turkish Invasion of Cyprus of 1974. The Northern side of the island is the Turkish Republic of Northern Cyprus, and the Southern side is the Republic of Cyprus—the Greek side—where I am from. While the separation isn’t as absolute as North and South Korea—for example, I can cross the border—each side is run like a totally different country.  ","short_description":"A 360 Video installation that simulates the division of Cyprus, and shows the perspectives of the two communities—The Greek and Turkish Cypriots.","further_reading":"<p><i>A Fresh View</i> is an installation that places two viewfinders facing each other, separated by a Green Line. Each viewfinder represents the perspective of one of these two communities; showing the Green Line from each side in 360 degrees. I conducted interviews and created the 360 videos in Cyprus, and learned how people on both sides feel about the separation of the country, and how the physicality of the Green Line affects their daily lives. </p>\n<p>Prior to the political separation, the two communities lived peacefully together and shared each other’s cultures as a unified country. But now, after more than 40 years of division, enmity has grown between the two sides. Referendums to reunite have failed, and people are known to be either “Yes for Reunification” or “No for Reunification.” The two communities remain in everlasting talks to resolve the “Cyprus Problem” without any result.</p>\n<p>This installation has two purposes; The first is to inform people who are not aware of this 44 year old bifurcation of the country. The second is for Cypriots to hear how people on each side feel about the division, and with that, I hope to inspire citizens to take action to restore and unify Cyprus. </p>\n<p>The viewfinders were laser cut using cardboard, after which I embedded a Google Cardboard with my 360 video experience inside. They are able to spin 360 degrees, and attached to each viewfinder are headphones where the users can listen to the interviews that I conducted in Cyprus. The aesthetic of the piece are meant to be as realistic as possible, so the viewfinders are painted silver and black, and in the middle of the room are green barrels, and signs that exist in Cyprus where the Green Line is located. The room is divided in two, therefore the users will have to exit the room in order to ‘enter’ the other side. The rest of the room is filled with facts and photographs of Cyprus. </p>\n<p>I intend on eventually taking the viewfinders back to Cyprus and installing one on each side of the border. The installation simulates the reality of Cyprus’ situation; thus invoking the true feelings and visuals of the Green Line to the unfamiliar user. When I install it at the Green Line I hope the impact will be greater and more substantial—it will hit closer to home and perhaps provoke a feeling that people haven’t expressed in a long time.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnailphoto.jpg","title":"thumbnailphoto","alt":"thumbnail","caption":"thumbnail"},"topics":[{"name":"Education","slug":"education"},{"name":"Installation","slug":"installation"}],"video_presentation_url":"https://player.vimeo.com/video/270188594","video_documentation_url":"","project_url":"https://www.arianavassilopoulou.com/afreshview","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnailphoto.jpg","title":"thumbnailphoto","alt":"thumbnail","caption":"thumbnail"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/slideshowphoto1.jpg","title":"slideshowphoto1","alt":"Slideshow Photo 1","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/slideshowphoto2.jpg","title":"slideshowphoto2","alt":"Slideshow Photo 2","caption":"Slideshow photo"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/slideshowphoto3.jpg","title":"slideshowphoto3","alt":"Slideshow Photo 3","caption":"Slideshow Photo 3"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/slideshowphoto4.jpg","title":"slideshowphoto4","alt":"Slideshow Photo 4","caption":"Slideshow Photo 4"}]}