{"post_id":131,"student_id":"84","student_name":"Maria Del Pilar Gomez Ruiz","student_slug":"maria-del-pilar-gomez-ruiz","advisor_id":"129","advisor_name":"Nancy Hechinger","advisor_slug":"nh19","project_title":"Onda: Data Portraits for Period Health","project_question":"Onda is a product that combines tangible and digital elements to create data portraits of a person's menstrual cycle. As the user collects data portraits over time, she strengthens her body confidence and self-esteem, gaining invaluable insights into her internal patterns and becoming an active participant in her period health. \r\n<br />\r\n<br />\r\nThe tangible interface is a counter that resembles an abacus. Its sliding red beads allow the recording of users’ daily basal body temperature (BBT) within a range of 97–99 degrees Fahrenheit, including decimal points (More on why I chose this indicator in the “Further Reading” section).\r\n<br />\r\n<br />\r\nA mobile companion app enables users to scan the counter and parse these images via a computer vision algorithm which detects each red bead (representing a temperature reading in a given cycle day) and saves it as a data point within the current cycle. \r\n<br />\r\n<br />\r\nThe app also generates an alternative circular data visualization of a cycle day by day.  Users may also input other period-related phenomena (mood swings etc.,) that may reveal unique patterns. Finally, the app creates an archive—a data diary—of users’ information to track privately or share. My aim is to form a habit or ritual, physicalizing the charting component to reinforce the need for healthy self-reflection and digitizing cycle data for personal record or to provide to healthcare practitioners. \r\n<br />\r\n<br />\r\nIn the following section I detail some of the findings of my research, which comprised a significant part of my project. ","short_description":"A body-literacy toolkit that allows menstruating teenagers to chart and discover the patterns of their cycles by combining tactile and digital components. ","further_reading":"<p>  <img src=\"http://itp.pilargomezruiz.com/wp-content/uploads/2018/04/user-journey.gif\"><br />\n<i>Fig1. Storyboard of the user journey</i></p>\n<p><b>A data diary for a \"a lifelong engagement\" with one's body</b></p>\n<p>Why did I design Onda with teenagers in mind? Because the teenage years are when it all begins: the body changes, the bleeding, the shame about one's body.</p>\n<p>Associate Professor of Women’s, Gender, and Sexuality studies at the University of Massachusetts, Chris Bobel, writes the following <a href=\"https://www.nytimes.com/2018/03/31/opinion/sunday/menstrual-periods-prejudice.html\">in a New York Times editorial:</a></p>\n<p>    \"Menarche [the beginning of menstruation] should be a prime opportunity to begin a girl’s lifelong authentic engagement with her body. Instead, we hand her a pad and teach her to put it up her sleeve when she goes to the bathroom\".</p>\n<p>After the publication of <a href=\"https://www.amazon.com/Taking-Charge-Your-Fertility-Anniversary/dp/0062326031/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1524069882&amp;sr=1-1&amp;keywords=taking+charge+of+your+fertility\">Taking Charge of Your Fertility:The Definitive Guide to Natural Birth Control, Pregnancy Achievement, and Reproductive Health</a><a href=\"#fn1\">1</a> (originally published in 1995, with its most recent edition published in 2015), MPH Toni Weschler, <a href=\"http://cyclesavvy.com/utility/note-to-moms.asp\">said</a> she received a significant amount of correspondence from its readers, which</p>\n<p>[...] questioned why such invaluable and empowering biological information wasn’t routinely taught when they were teenagers. For most, this would have been an ideal time to learn about all the gynecological and menstrual enigmas that add so much confusion and insecurity to everyday life, and the knowledge would have prepared them to deal with the inevitable fertility-related issues that they faced later in their adult lives.</p>\n<p>In response to that, Weschler wrote  Cycle Savvy: The Smart Teen's Guide to the Mysteries of Her Body (2006), where she constantly highlights the benefits of learning about the female body and its cycles as early as the start of menstruation—in other words, keeping a “menstrual diary.”</p>\n<p>As she in it writes with her teenage readers in mind: “The charts that you create over the next few decades of your life will form the most intimate and practical diary that you could ever produce, because ultimately, they will serve as an enlightening window into the workings of your own body.”<a href=\"#fn2\">2</a></p>\n<p><b>Period health: a long-term project</b></p>\n<p>Yet, as one who has found delight in the slow-paced art of collecting curious and interesting objects, I’m well aware that a menstrual-data-journaler—especially one that just started this stage in her life—will realize what Briden emphasizes in her book: “Period health is a long term project (pp. 56, 214).” It can take up to 12 years for a person to establish a mature menstrual cycle with healthy and regular ovulation (more if said individual started taking hormonal birth control, thus pausing this process [Briden, p. 11]). Many teens will also have many anovulatory cycles before they can start detecting “the wave” mentioned below in the section <a href=\"#section3\">\"From ‘ew’ to ‘oh!’\"</a></p>\n<p>Inspired by information illustrators Stefanie Posavec and Georgia Lupi's project <a href=\"http://www.dear-data.com/theproject/\">Dear Data</a>, I want to promote the collection of personal data as a ritual of “noticing and noting down,” creating a habit, learning to be “more present”—as opposed to the “self-quant” approach of gathering data from oneself in order to become more efficient.</p>\n<p>Onda aims to (1) help the user record these findings, and (2) become a long-term companion for its user. I anticipate many iterations of both the physical prototype and its companion app to satisfy these aims. I would like Onda to be an inspirational artifact towards what Little Bits creator Ayah Bdeir <a href=\"http://www.imprintlab.com/8-questions-with-ayah-bdeir-of-littlebits-2/\"><br />\ndescribes:</a> “First there’s this moment of wonder, followed by this moment of comprehension, and then comes the amazing moment of empowerment.”</p>\n<p><b>Period activism, gaining momentum</b></p>\n<p>  <i> “The period is finally having its moment”<br />\n    — Chris Bobel, also in the article quoted above</i></p>\n<p>Many conversations from period-health advocates have (righteously) concentrated on the availability of essential products commonly preceded by the adjectives “hygiene” or “sanitary” (quotes mine)—namely, those that collect menstrual blood.</p>\n<p>But as Bobel points out in the same text, \"[...] if this moment is going to grow into a movement, it must do more than move products. It must move minds.” Elsewhere: “[...] the outsize attention paid to products reduces menstruation to a hygiene issue when it should be much more. The monthly shedding of the uterine lining is part of a cycle that last, on average, for 40 years.”</p>\n<p>I want to contribute to this conversation by framing menstrual cycles as mirrors into a fascinating interior reality. I hope to reveal both the beauty of their natural form and their potential as vital signs within bodies.</p>\n<p>Again, Bobel: “[...] our aim must be to transform the revulsion into respect, to shift from ‘eww’ to ‘oh.’”</p>\n<p><b>“From ‘ew’ to ‘oh!’”</b></p>\n<p>It is a pity that many people feel squeamish around such common (and, I should add, beautiful) manifestations in billions of humans throughout the planet. We tend to concentrate on bleeding, the most evident manifestation, which shouldn't be a cause for revulsion in the first place. But I also want to shed light on what happens in between, and hopefully inspire a sense of wonderment and respect for the whole phenomenon.</p>\n<p>As Lara Briden, ND points out in her book <a href=\"https://www.amazon.com/Period-Repair-Manual-Treatment-Hormones/dp/1975926773/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1524069811&amp;sr=1-1&amp;keywords=period+repair+manual\">Period Repair Manual, Second Edition: Natural Treatment for Better Hormones and Better Periods</a>(2017), menstrual bleeding is but “a finale in a series of hormonal events which include ovulation<a href=\"#fn3\">3</a> and the making of progesterone [... it] is about the healthy functioning of [the] ovaries” (p. 7).</p>\n<p>As much as cycles can vary from person to person, and even between each other in a single person, all menstrual cycles with an ovulatory interlude in between reveal a consistent and beautiful form. As Weschler notes in her aforementioned book Cycle Savvy... \"Ovulatory cycles reflect a classic temperature pattern of lows before ovulation, followed by a consistent number of highs after.” This biphasic pattern resembles a wave (Onda means “wave” in Spanish): a waveform that repeats itself—granted, with variations—every cycle.</p>\n<p>Below are some explorations I've made of this form throughout my time at ITP:</p>\n<p>  <img src=\"http://itp.pilargomezruiz.com/wp-content/uploads/2018/04/self-portrait-1.png\"><br />\n  <i>Fig2. - Another visualization of the data I used for the self portrait (my temperatures for a whole cycle) in a linear way. The temperature shift looks more evident</i></p>\n<p>  <img src=\"http://itp.pilargomezruiz.com/wp-content/uploads/2018/04/linear-visualization-thesis-pilar-2018.gif\"><br />\n <i> Fig3. -</i> I made this self-potrait for Data Art with my own temperatures back in the Fall of 2017. Before ovulation, the temperatures tend to be low, and after it, there's a thermal shift that makes the rest of the temperatures of the cycle remain high.</p>\n<p>This rather exceptional figure emerges when a person that is ovulating tracks her basal body temperature (BBT). This is achieved by placing a thermometer below the tongue every morning upon waking up, before doing anything else (even standing), when it is possible to detect the lowest body temperature attained during rest. BBT can be thought of as the “footprint” left by progesterone, a reproductive hormone that soars post-ovulation. The rise in progesterone indicates that ovulation occurred in a given cycle, and this is paramount to period health.</p>\n<p>Again, Briden: \"[progesterone is] beneficial for mood, metabolism, and bones. It’s also highly beneficial for your period. In fact, you could say, that when it comes to period health, it’s all about progesterone\" (p. 9).</p>\n<p>While there are currently extremely sophisticated thermometers that can log data via Bluetooth and other wireless (or wired!) technologies<a href=\"#fn4\">4</a>, any common digital thermometer will do for Onda in conjunction with a smartphone.</p>\n<p><b>The menstrual cycle as a vital sign</b></p>\n<p>“What’s the point of having so much information on the exact part of womanhood most of us would happily forsake?” wonders Aline Hines <a href=\"https://www.thecut.com/2013/08/period-apps-where-big-data-meets-girly-graphics.html\">in an article</a> for The Cut wherein she writes about the increasing hype for period-tracker apps. Reporting on the same topic, Harvard Society of Fellows postdoctoral scholar Moira Weigel raises a valid concern <a href=\"https://www.theguardian.com/technology/2016/mar/23/fitbit-for-your-period-the-rise-of-fertility-tracking\">in a piece</a> written for The Guardian that these new technologies could reinforce very old beliefs, one being that “women should be fixated on their fertility in the first place.”</p>\n<p>Interrogating this stance—and articulating my own, that fertility need not be referred to solely as a reproductive health/sexual rights affair—necessitates further clarification. The reason people have periods at all is to shed the endometrium in the absence of a fetus. Tracking this natural process has overwhelmingly been of interest to either pregnancy achievers or pregnancy avoiders.<a href=\"#fn5\">5</a></p>\n<p>Yet the endocrinal dialogue between the brain and reproductive organs can play a significant role in  terms of energy levels and mental states—effects concerning female people who are not and might not ever consider achieving or avoiding pregnancy. A person keeping track of these fluctuations might detect insightful patterns, not least a read on one’s overall health by keeping track of her periods!<a href=\"#fn6\">6</a></p>\n<p>Let me elaborate. In 2015, the American College of Obstetricians and Gynecologists (ACOG) and the American Academy of Pediatrics (AAP) published<a href=\"https://journals.lww.com/greenjournal/fulltext/2015/12000/Committee_Opinion_No__651___Menstruation_in_Girls.59.aspx\"> a recommendation </a>for health practitioners to add teenagers’ menstrual cycles to their vital sign measurement protocol: “just as abnormal blood pressure, heart rate, or respiratory rate may be key to diagnosing potentially serious health conditions, identification of abnormal menstrual patterns in adolescence<a href=\"#fn7\">7</a> may improve early identification of potential health concerns for adulthood.”</p>\n<p>The experts I've quoted above all seem to be on the same page as the ACOG and AAP:</p>\n<p>      Briden: “Your period is not just your period. It is an expression of your underlying health. When you are healthy, your menstrual cycle will arrive smoothly, regularly, and without undesirable symptoms. When you are unhealthy in some way, your cycle will tell the story.”</p>\n<p>    Weschler: “Menstruation is more than just “that time of the month.” It’s a positive sign of health.”</p>\n<p>    Bobel: \"[Menstruation] is a vital marker of health and a pivotal developmental milestone for half the world’s population.”</p>\n<p>    <b>DISCLAIMER:</b> While the research above–which will be in part provided as content for the user– contains information relating to healthcare, it is not intended to replace medical advice and should NOT be used to supplement it.</p>\n<p>  1. [Taking Charge of Your Fertility... is the most comprehensive guide into the Fertility Awareness Method (FAM), and a significant source in this project’s development]<a href=\"#ref1\">↩</a></p>\n<p>  2. [To follow this method, some keep printed/Excel charts (Weschler <a href=\"//cyclesavvy.com/health/masters.asp\">provides templates)</a> and some people record their signs in apps. Onda aims to provide an ludified alternative to follow one of the main tenets of it (charting BBT).]<a href=\"#ref2\">↩</a></p>\n<p>  3. <a href=\"http://www.tcoyf.com/difference-anovulatory-cycle-anovulatory/\">Though[some cycles–with bleeding and all–can be anovulatory]</a><a href=\"#ref3\">↩</a></p>\n<p>  4. [Among them the <a href=\"https://www.avawomen.com/\">&gt;Ava</a>, <a href=\"https://usa.daysy.me/\">Daysy</a>, <a href=\"https://www.fairhavenhealth.com/tempcue-kit\">TempCue</a>, and <a href=\"https://www.kindara.com/wink\">Wink</a> devices]<a href=\"#ref4\">↩</a></p>\n<p>  5. [Disclosure: I am a member of one of these groups, and from browsing through forums I can say that many members of both communities are already cognizant of the health benefits that charting brings]<a href=\"#ref5\">↩</a></p>\n<p>  6. [Some common disorders of period health include endometriosis, ovarian cysts, and polycystic ovary syndrome (PCOS). It is important to note, though that balance/imbalance of said hormones can affect other systems in the body beyond the reproductive organs: <a href=\"https://www.ncbi.nlm.nih.gov/pubmed/23460719\">further reading</a> ]<a href=\"#ref6\">↩</a></p>\n<p>  7. [See <a href=\"#section2\">the second section</a>, “Period health, a long-term project” for examples]<a href=\"#ref7\">↩</a></p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/onda-cover-pilar-gomez.png","title":"onda-cover-pilar-gomez","alt":"sketch of a physical menstrual calendar scanned and stored digitally with a computer vision algorithm","caption":""},"topics":[{"name":"Education","slug":"education"},{"name":"Health","slug":"health"}],"video_presentation_url":"https://player.vimeo.com/video/270189959","video_documentation_url":"","project_url":"http://pilargomezruiz.com/onda/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/onda-cover-pilar-gomez.png","title":"onda-cover-pilar-gomez","alt":"sketch of a physical menstrual calendar scanned and stored digitally with a computer vision algorithm","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/1-user-interviews.png","title":"1-user-interviews","alt":"I did user interviews with 5 teens back in Mexico, and gave them a low-fidelity prototype to take and chart their temperatures, so that they could help me explore the experience.","caption":"I did user interviews with 5 teens back in Mexico, and gave them a low-fidelity prototype to take and chart their temperatures, so that they could help me explore the experience."},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/2-visual-thinking-sessions-with-daveed.png","title":"2-visual-thinking-sessions-with-daveed","alt":"visual thinkin sessions with resident daveed lockard","caption":"Exploring possible forms in a visual thinking session with resident Daveed Lockard."},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/3-sketching-physical-prototype.png","title":"3-sketching-physical-prototype","alt":"sketches of physical prototype","caption":"Sketches of physical prototype."},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/4-computer-vision-tests.png","title":"4-computer vision tests","alt":"Testing computer vision algorithm with ITP colleague sejo vega-cebrián","caption":"Testing computer vision algorithm with ITP colleague sejo vega-cebrián"}]}