{"post_id":237,"student_id":"86","student_name":"Nanou Dimachki","student_slug":"nanou-dimachki","advisor_id":"129","advisor_name":"Nancy Hechinger","advisor_slug":"nh19","project_title":"Intimate Patterns","project_question":"\"Intimate Patterns\" is a series of physical expressions that emerged from the intimate digital conversations between two people. \r\n<br />\r\n<br />\r\nThe relationship between the pair is translated into two/three physical installations. \r\n<br />\r\n<br />\r\nTexts become a metaphor, becomes tangible in concrete form.\r\n<br />\r\n<br />\r\n<i>How?</i>\r\n<br />\r\n<br />\r\nI thought of ordinary objects from daily life because physicality is exactly what we miss in digital interactions. Hence the two installations: two light bulbs and two wine glasses.\r\n<br />\r\n<br />\r\nRelationships, like the bulbs sometimes go on and off or dim and die... The tangible aspect of bulbs, their accessibility and presence everywhere in every room made me think about how we tend to take them for granted. We can put a bulb on and off when we want to… However, do we have that choice in relationships with people? Is it always our call? Are we ever conscious of the pattern we make with them? Maybe. Who knows? Regardless bulbs are only here to show us in a very simplified and poetic way these digital interactions.\r\n<br />\r\n<br />\r\nThey go “on” and “off” like the interaction of the texting between those people. On, when received; off, in the absence of it. The lights intensify and dim when the interaction is vivid or dull. The bulbs change colors when the words exchanged are positive or negative, etc.\r\n<br />\r\n<br />\r\nThe installation of the two wine glasses come in pairs too, to exchange liquid (the wine) just like the exchange of messages, to reflect the pattern of sending and receiving. The full glass is a metaphor for the emotional fulfillment someone make us feel, when we receive a text. And an empty one is the lack of it or when we are in return filling somebody’s cup. ","short_description":"How can we draw patterns from the data of social digital-relationships and visualize these in the physical world?","further_reading":"<p>My research consisted on fetching the data of texting between two people on different levels.</p>\n<p><b>Data Analysis</b></p>\n<p>Going through JavaScript tutorials and exploring different libraries: The RiTa library, Chart.js, momento.js, etc. I was able to analyze:</p>\n<p>. Real chronology of events based on Time/Date factor: When these exchanges happened. </p>\n<p>. Intensity of interaction: How frequent are the exchanges of these messages, when is it vibrant and intense vs dull and cold..</p>\n<p>. The most used words: Word counting. Sometimes a repetition of certain words could be unconsciously meaningful and significant between people.</p>\n<p>. Positive/negative words spoken are great indicator of how an interaction is between two people. </p>\n<p>. Silence factor (if very meaningful in a certain situation)</p>\n<p>. Exchange of pictures, music and videos</p>\n<p><b>Physical Installations:</b></p>\n<p>The two bulbs:<br />\nThe installation of the two bulbs connected to the Arduino is not the hardest task. However, the challenge is to make sure that the incoming data that is controlling and dictating this interaction, is being pulled from the real chronology of events that happened between these two people and not a random one. Just like in real life, the bulbs might as well dim gradually and die if the digital relationship had died in reality… The bulbs are the two people. The data is its soul. </p>\n<p><i>Process:</i></p>\n<p>The data is analyzed in JavaScript sent to Max Msp through (udp and osc) and then connected to Arduino with serial communication, this last one will parse it to the bulbs.</p>\n<p><i>The two wine glasses:</i></p>\n<p>Life sometimes eject people we love to other places, making it impossible for us to interact with them physically. Force us to turn our relationships to digital interactions.</p>\n<p>I sometimes miss having a real conversation over a drink with loved ones.<br />\nLife becomes smaller suddenly and the interaction is limited to a window in a phone, hence what we call “texting”. But as tiny as life can get, I many times feel an emotional fulfillment when I receive a text from loved ones it gives me some sense of security and emotional stability. </p>\n<p>It reminds me of their presence. The interaction comes as a need sometimes; and the lack of it becomes disturbing to my emotional state. These tiny momentum we share with people over text as silly as they sound, they sometimes have a serious effect on our emotions. The digital interaction has some sort of addiction to it. From here comes the installation of the two wine glasses, to exchange that drink we can’t have. </p>\n<p>The liquid (the wine) is exchanged between glasses just like the exchange of messages. The full glass is a metaphor to the emotional fulfillment someone make us feel. And an empty one is the lack of it or when we are in return filling somebody’s cup. And just like the two bulbs, the chronology of events is based on a real exchange that happened between two people.</p>\n<p><i>Process:</i></p>\n<p>How to move the liquid?:<br />\nI have researched and tried out different techniques to move the liquid from one cup to another, one of the attempts was to make one cup pour liquid into the other when a message is sent and the other one at his turn pour back the same liquid into the first cup when a message is sent from the other person. This process needed some physical fabrication and/or a robotic motion to pull it out, the problem I was facing in this process is that the same amount of liquid was moving from one cup to another. I had to figure out another way, where this exchange had a deeper layer which is the control of the amount of liquid in the cup. Eventually, after research and advisement I decided to pump the liquid from one cup into the other. In this manner the pump and the amount being poured in the cup is controlled by the interaction of the text between these people. I am using a peristaltic liquid pump and mounting the glasses with invisible transparent tubes. The pump will also be enclosed behind the glasses so we are only seeing the liquid being pumped from one cup to another. </p>\n<p>The data is analyzed in JavaScript sent to Max Msp through (udp and osc) and then connected to Arduino with serial communication, this last one will parse it to the glasses.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/20180424_142819-1024x768.jpg","title":"20180424_142819","alt":"bulbs two","caption":"bulbs two"},"topics":[{"name":"Data","slug":"data"},{"name":"Installation","slug":"installation"}],"video_presentation_url":"https://player.vimeo.com/video/270190362","video_documentation_url":"","project_url":"","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/20180424_142819-1024x768.jpg","title":"20180424_142819","alt":"bulbs two","caption":"bulbs two"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/20180424_142649-reduced.jpg","title":"20180424_142649 reduced","alt":"pic bulb red","caption":"pic bulb red"}]}