{"post_id":264,"student_id":"89","student_name":"Stephanie Koltun","student_slug":"stephanie-koltun","advisor_id":"129","advisor_name":"Nancy Hechinger","advisor_slug":"nh19","project_title":"How Thrilling","project_question":"As an installation, 'How Thrilling' explores these three themes by creating different relationships across contexts. A context is composed of bodies and technology, which together establish an expectation for people to behave and perform. Central in all scenes of the installation is the performance (and identification) of the body — whether that be as dancing, watching, or both. <br />\r\n<br />\r\nHow do contexts come together to give meaning to each other? How do we perform differently in different contexts? How is expectation for performance established and understood in a context?\r\n<br />\r\n<br />\r\nFrom the earliest artworks to the printed book to streaming video, technology has extended one’s capacity to represent oneself. But technology also extends one’s capacity to identify ourselves and others. Through computer vision and machine learning, this capacity to identify is extended to technology—independently of a contingent and changing psyche, or as an extension of the psyche who made it.\r\n<br />\r\n<br />\r\nContext as the situation of and relationships between, technology and bodies in space. Context establishes an expectation for performance, from which bodies are identified. A public restroom, a library, and a sports field are all examples of where a combination of signs, objects, uniforms, and spatial arrangements, are used to identify and enforce an expectation of a particular performance.\r\n<br />\r\n<br />\r\nContingency of the body-psyche can mean choosing to participate, where an example might be rejecting a gendered discourse through drag as discussed by Judith Butler. But there’s also contingency in the material condition of the body. Bodies come in all shapes, sizes, and capacities. Because of this contingency, our bodies may or may not be identified by the expected standards of a technology. ","short_description":"<i>How Thrilling</i> is an installation where people are expected to dance. Dancing, and seeing others dance, is used to explore how both context and technology shape our performance. Using elements from Michael Jackson's song \"Thriller\" — the icon, the choreography, the zombies — different expectations are established in different places.","further_reading":"<p><b>Set One</b></p>\n<p><iframe src=\"https://player.vimeo.com/video/264109388\" width=\"640\" height=\"360\"></iframe></p>\n<p>On a screen in the hallway, the original Thriller music video silently plays on loop. In the lounge, a group of people gather by another screen watching a live stream of someone dancing. Elsewhere, in a dark room, the person dancing sees themselves projected as a stick-figure alongside a stick-figure of Michael Jackson. Each of these spaces have their own context, establishing different expectations to view or perform. However, in moving between the spaces, each adds meaning to another.</p>\n<p><i>The Hint</i></p>\n<p>Encountered first, the screen in the hallway appears unremarkable. Without any sound, it’s easily missed, maybe soliciting a glance as you walk elsewhere. In a corridor, there isn’t enough room to congregate or the accommodation to watch for extended periods of time. Plus, we’ve all seen the video before. And yet, however subtle, this screen provides context for subsequent spaces.</p>\n<p><i>The Audience</i></p>\n<p>Located at the threshold to the lounge, the live-streamed performance encourages people to stop and watch. Unlike the previous screen, it’s clearly visible. What are they doing? Are they dancing? Where is that music coming from? Now the first screen makes sense: “They’re dancing to Thriller!” As someone stops to watch, more people gather. Their presence signals that there’s something to be seen.</p>\n<p><i>The Performance</i></p>\n<p>How we identify ourselves affects our performance. Represented as a stick figure, everyone is the greatest dancer on the stage. But we’re also anonymized. Am I controlling the stick-figure or is the person next to me? Or maybe my movement actually controls the Michael Jackson stick-figure? The two stick-figures are only differentiated by their movement.\n</p>\n<p>It quickly becomes apparent that the one representing Michael Jackson is endlessly looping, providing a comparison and prompt. Should we try to sync our figure with his? Upon recognizing his unachievable perfection, do we make up our own routine?\n</p>\n<p><i>The Switch</i></p>\n<p>In the dark room, suddenly the music stops. The stick-figures are replaced with a live-stream of the audience. The contexts are broken; each space becomes aware of the other. The performances change. The dancer stops, unsure of what to make of the new visual. The audience — no longer just watching but also being watched. They wonder why the dancing has stopped. Just as the dancer begins to wave, the music resumes and it’s back to stick-figures. But now that the switch is known, the performance changes. They’re aware of an audience. They dance (or don’t) with the anticipation of seeing the other side again, being able to communicate back and forth.\n</p>\n<p><b>Set Two</b></p>\n<p><iframe src=\"https://player.vimeo.com/video/264109504\" width=\"640\" height=\"360\"></iframe></p>\n<p>A single body takes on different meaning in different spaces, and establishes different contexts within. In one room, it's learning to dance from the icon. Elsewhere, it prompts others to dance alongside. Finally, as a recorded loop the original body can see their past self.\n</p>\n<p><i>The Original</i></p>\n<p>From the doorway of a dark room, someone sees a clip of the original “Thriller” music video. The song draws them in and suddenly they see themselves composited into the video. The iconic song and dance is encouraging and they begin to follow Michael Jackson like the rest of the zombies.\n</p>\n<p><i>The Partner</i></p>\n<p>Elsewhere, the isolated dancer is shown on a black screen as a prompt for others. As people gather to watch them dance, an audience member is detected and becomes a stick figure on screen. But they aren't led by the iconic Michael Jackson, just an imitator. And they're live, responding to us responding to them!\n</p>\n<p><i>The Flicker</i></p>\n<p>In the dark room, the original dancer periodically sees a flicker of the elsewhere-partner, dancing in response to them. As this momentary flicker repeats, does the dancer abandon Michael Jackson's zombie pack? Do they put on a show for the awaiting-partner, or do they synchronize across the spaces?\n</p>\n<p><i>The Recording</i></p>\n<p>After performing, dancers become an audience, seeing themselves on a screen in the hallways. Their previous dance moves now loop, juxtaposed against original Michael Jackson loop for comparison. Were we every as precise and repeatable as him?\n</p>\n<p><b>Set Three</b></p>\n<p><iframe src=\"https://player.vimeo.com/video/265641851\" width=\"640\" height=\"360\"></iframe></p>\n<p>While previous combinations explored how simultaneous interactions across different physical spaces changed performance, the final combination explores change within a space independent from action elsewhere. How does our identification as performer or observer respond to a changing context? In one moment, we're learning to dance with Michael Jackson and suddenly we become evaluators of this dance. Elsewhere, we think we're only watching someone else but become performers as well. How we identify our role within a space?\n</p>\n<p><i>The Lesson</i></p>\n<p>In a large empty room, a projection takes the place of a dance studio mirror. Standing in front of it, one can see themselves dancing as an audience might. But this is different. Composited into the mirror-image is a looping Michael Jackson cut out, moonwalking alongside us.\n</p>\n<p><i>The Playback</i></p>\n<p>Michael Jackson disappears and it becomes a solo show. But, the mirror is now historical as it plays back the past 10 seconds of dancing. It's a subtle shift; the representation hasn't changed and it takes a moment for the dancer to realize the feed is no longer live. The scene is one of only two contexts in which the performer sees their past self. When Michael Jackson returns is the performer more self-conscious having had the chance to review? Or do they focus more intently on following his actions?\n</p>\n<p><i>Just Watching</i></p>\n<p>At the threshold to the lounge, people gather to watch a dancer perform elsewhere. There's no music, making the actions difficult to discern. Are they really dancing? The stream is live and the performer is are unaware of being watched. But this stream is only a hook to get people to gather and focus on the actions of an other.\n</p>\n<p><i>Now Performing</i></p>\n<p>Abruptly, the audience-turned-performers see themselves as stick figures, replacing the live feed of the elsewhere-performer. Michael Jackson's 'Thriller' starts playing on speakers and he appears on screen as a looping cut-out. Distinguished from the stick-figure representation, he's the leader of the newly-established zombie-pack. His endlessly perfect performance prompts the crowd to perform in unison with each other and with him.\n</p>\n<p><i>Really Watching</i></p>\n<p>Elsewhere down the hallway, another audience watches the switch from people observing to become performers, or vice versa. It's a nondescript screen without any music. People may only catch a part of the action and miss the switch in roles. But it serves to illustrate that even when we're considered \"an audience,” we too are subject to identification based on another's context.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail-14.jpg","title":"thumbnail","alt":"a still from Michael Jackson's \"Thriller\"","caption":""},"topics":[{"name":"Performance","slug":"performance"},{"name":"Play","slug":"play"}],"video_presentation_url":"https://player.vimeo.com/video/270191081","video_documentation_url":"https://player.vimeo.com/video/265641972","project_url":"http://anothersideproject.co","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail-14.jpg","title":"thumbnail","alt":"a still from Michael Jackson's \"Thriller\"","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/02.png","title":"","alt":"A hallway with screens, one of which shows a frame of Michael Jackson's 'Thriller' video","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/01.png","title":"","alt":"A man dancing as a stick figure","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/04.png","title":"","alt":"Someone sees a mirror image of themselves with a cutout Michael Jackson composited into the scene","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/03.png","title":"","alt":"Two people in different spaces dance together, seeing themselves on screen","caption":""}]}