{"post_id":338,"student_id":"9","student_name":"Jina Jung","student_slug":"jina-jung","advisor_id":"114","advisor_name":"Adaora Udoji","advisor_slug":"aeu4","project_title":"Intangible Canvas","project_question":"Fragmentary Landscape is an experiment with the realm between new technology and traditional materials, combining both genres of work. Paralleling the way rays of light are untouchable in the physical world, this project focuses on the relationship between real and imaginary figures in an immersive natural environment. My real life paintings of nature are converted into a virtual space so people can experience my paintings in VR.   \r\n<br />\r\n<br />\r\nFurthermore, this project also focuses on questions of how the artist applied VR with traditional paintings or drawings as well as how their observation changes depending on the medium. It aims to create landscapes with different dimensions(2D&amp;3D) which are situated on real and virtual canvases.  Based on my artistic approach, and experiences with nature, I could explore new perspectives while creating landscapes and characteristics of elements and landscapes in a virtual environment.\r\n<br />\r\n<br />\r\nThe project consists of 3 methods – Drawings, titled ‘Fragments -  Intangible Objects’, Paintings, titled ‘Fragmentary forest’, and VR, titled ’Beyond forest’.  Handling these three different forms provides audiences the chance to fully immerse themselves and engage completely in the world that the artist has visualized. \t","short_description":"This project focuses on questions of how the artist can adapt VR with traditional paintings or drawings as well as how their observations change with different media. We question how we can define art using our experiences as artists and how we can manifest VR into a new artistic genre. The project combines various techniques and manifests the artist’s vision of a new experimental arena.","further_reading":"<p>The key feature of this artistic piece is an immersive experience created by adapting original paintings and a VR digital world in an exhibition space. Here is a description of the three works.</p>\n<p><i>1. 15 individual Drawings ‘Fragments -  Intangible Objects’</i></p>\n<p>This project plants the seed and begs the question: Can we control objects without physically manipulating them? In the real world, I can hold things like pencils to draw and paint brushes to paint, but using a VR controller to draw is rather unfamiliar to me. Learning new tools that are not as intuitive as our own hands takes time. Just like how rays of light are untouchable in the physical world, I feel like my surroundings aren’t actually something I can craft. </p>\n<p>In this series of drawings, I tried to express transparency. What I mean by this is that when we feel the suns' rays hit our skin or the wind blow over us, we feel connected to our surroundings even though we can’t hold onto them. Even though we can feel the sun and the wind, we can't actually reach out and grasp either one. These ideas of feelings sparked my interest in thinking about intangibility in virtual reality.</p>\n<p>These Images of hands and objects are located in the center of a 15 x 11 inch piece of paper, so that the margin creates a focus around the object. I depicted most of the objects on flat thin film-like layers with the hands holding various objects. I decided to use watercolor to add a very subtle feeling of transparency. The hand gestures are that of someone who is about to place something down, or about to lift something up. I used strong lighting to show an intertwinement between the tangible and transparent.</p>\n<p><i>2. 4 individual Paintings  ‘Fragmentary Forest’</i></p>\n<p>‘Fragmentary Forest’ are 4 pieces of acrylic paintings that contain trees and mountainous features that exist within the natural wilderness in both the virtual and the real world. In the paintings, There are distorted trees and geometrical cliffs, and all of these fragmented images make up the basic shape of stumpy mountains with waterfalls. Those images are inspired by real natural landscapes which I've experienced through travel. The paintings consist of deconstructed natural elements which are made up of basic tree figures coated with multiple paint layers. I aimed to merge some of the familiar objects to create unfamiliar landscapes. Specifically, The figures in the paintings are transformed into elements found in 3D space - lights, spheres and cubes. In terms of the basic shapes, I combined multiple mountains and stacked layers with small pieces of paint to end up with the final landscapes.</p>\n<p><i>3. VR or any other software</i></p>\n<p>Based on the hand drawing and painting series, I considered an extended space through VR. This unlimited 3D space allows both the viewer and the artist to immerse themselves in the conceived world. When creating a new scene in Unity, the game development platform, I utilized a new form of blank canvas which has XYZ space in contrast to just a flat 2D space. A horizontal line and an unlimited vanishing point are a huge leap from the traditional white paper and canvas. For me as a creator,  physical canvas can be equated with the blank screen of Unity. When adding the painting series to the scene, I broke up the paintings into smaller pieces so that each fragment could be replaced in a new context. I want my audience to experience deeper feelings based on the environments I depicted on the canvas. I installed paintings, drawings, and VR together to bring the audience a hands on experience. This is exhibited in the space of the 12th floor conference room, 721 Broadway. </p>\n<p>Learning how to paint using new tools and software like these took time to gain proficiency. I needed to learn not only just how to use these tools but also how to train myself to employ it as if it were my own hand. Our tools are constantly changing; new technology arises and continues to overwhelm us. today, I used unity but in the future, I might use a different program to actualize my art work. I feel it is our unique opportunity as artists to learn new technology and adapt our methods as it progresses. Although it is still a struggle at times, I enjoy the challenge of pushing the boundary of my creativity and ART.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Thumbnail.jpg","title":"Thumbnail","alt":"Jina001","caption":""},"topics":[{"name":"Installation","slug":"installation"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/video/270188980","video_documentation_url":"https://player.vimeo.com/video/265419085","project_url":"https://www.jinajung.com/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Thumbnail.jpg","title":"Thumbnail","alt":"Jina001","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/JinaJungSlide01.jpg","title":"JinaJungSlide01","alt":"001","caption":"Fragments, 15 x 10 in, watercolor on paper, 2018"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/JinaJungSlide02.jpg","title":"JinaJungSlide02","alt":"001","caption":"Fragmentary forest, 25 x 51 in, Acrylic on canvas, 2018"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/JinaJungSlide03.jpg","title":"JinaJungSlide03","alt":"002","caption":"Fragmentary forest, 25 x 51 in, Acrylic on canvas, 2018"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/JinaJungSlide05.jpg","title":"JinaJungSlide05","alt":"vr","caption":"Beyond Forest"}]}