{"post_id":493,"student_id":"91","student_name":"Yuqiao Qin","student_slug":"yuqiao-qin","advisor_id":"129","advisor_name":"Nancy Hechinger","advisor_slug":"nh19","project_title":"Vuja De","project_question":"When was the last time you paid attention to your breath, the magic gift we all receive when we first arrive in this world? Breathing is a deep connection between our interior bodies and the outside world and it records every step we live as human beings. We breathe differently when we are curious, when we feel appreciated, and when we are close to danger. \r\n<br />\r\n<br />\r\n<i>Vuja De</i> is an immersive virtual experience that welcomes users to a journey that responds to their breathing. By generating a unique experience in virtual space, it is meant to help users re-sensitize themselves as humans, and reaffirm physical and spiritual inter-connections. \r\n<br />\r\n<br />\r\nThe experience is built around three moments that are central to any human life—the moment of birth, a moment of wandering, and the embrace of a dream. The user’s breath is captured by a microphone embedded in the headset, which sends output into the digital environment that the user inhabits.","short_description":"<i>Vuja De</i> is a virtual reality experience that explores the connection between virtual and physical space. It is a 3-minute-long interactive voyage through the cycle of life, which creates an embodied experience by creating an emotionally compelling world that responds to the user’s breathing.","further_reading":"<p>By experiencing their breath ‘translated’ into the environment and embodied in different ways, an increased awareness of unconsciousness embodiment is facilitated. Emphasis is placed on the sentient to create a body-centered virtual reality experience. Inspired by ‘Osmose’, an immersive interactive virtual-reality environment installation, Vu Deja is set in three moments of the life journey. </p>\n<p><b>Part I: Birth</b></p>\n<p>In this scene, you are protected by the environment around you, as if you are living in a huge invisible bubble. There is no sorrow or joy, love or hatred in this young world. It is without form, and in it everything grows, like you. Instincts dominate. The rhythm is all around you, and you breathe in the same melody as the world does. You breathe to grow, to see the world more clearly.</p>\n<p><b>Part 2: On the Road</b></p>\n<p>Growing up, you leave the protected bubble to explore the road alone. This scene unfolds as a road that is dangerous, full of infinite darkness and strange sounds. Brightly lit stones fall scattered on the road, attracting you. As you approach, they disperse. Everything turns dark again and you feel cowardly. You keep breathing, trying to exhale 'smoke' to cover the face of the deep, even cover your soul, your destination. As you calm down gradually, a dim light starts to twinkle at the end of the road. It is the dream, it is always here, but it is always covered by yourself.</p>\n<p><b>Part 3: The Dream</b></p>\n<p>This scene is designed to instill a strong sense of beauty. But this gorgeousness is too strong to stay for long. It goes down and down, just like the beautiful sunset happens in your life every single day. You breathe strongly to try to hold it in, own it, even hide it. But no matter how hard you try, it will still disappear below the horizontal line and leave you alone. The world turns dark and blurred again. Life is always like this, hard but unexpected, dangerous but hopeful, a place where desires, dreams, achievements, and status always change and always break. What has not changed, is you, a breathing human being.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/vujade.jpg","title":"vujade","alt":"breathe deeply","caption":""},"topics":[{"name":"Narrative","slug":"narrative"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/video/270191842","video_documentation_url":"https://vimeo.com/265498281","project_url":"https://yuqiaoqin.info/vujade","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/vujade.jpg","title":"vujade","alt":"breathe deeply","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/t2-1.jpg","title":"Birth","alt":"breathe deeply","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/t1.jpg","title":"Road","alt":"breathe deeply","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/t3.jpg","title":"Dream","alt":"breathe deeply","caption":"The third scene"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/3-1.jpg","title":"Birth","alt":"breathe deeply","caption":""}]}