{"post_id":127,"student_id":"92","student_name":"Yeseul Song","student_slug":"yeseul-song","advisor_id":"129","advisor_name":"Nancy Hechinger","advisor_slug":"nh19","project_title":"Invisible Sculptures","project_question":"In a gallery setting, there are five identical display plinths. Each holds an invisible sculpture.\r\n<br />\r\n<br />\r\n<i>Sculpture I</i> is a solid 3d form made of sound. To experience the work, move your hand over the plinth. Concentrate all of your senses to find the connection between what you touch and what you hear. You will soon find yourself in the land of synesthesia. Once you are aware of the shape, try to recreate the form using a handful of clay that will be handed to you.\r\n<br />\r\n<br />\r\n<i>Sculpture II</i> is an obscure pattern floating on top of the second plinth. Move your hand over the plinth to hear and experience the sculpture. Is it rough or soft? Is it dense or light? Is it spiky? \r\n<br />\r\n<br />\r\n<i>Sculpture III</i> is made of heat. \r\n<br />\r\n<br />\r\n<i>Sculpture IV</i> is made of cold air.\r\n<br />\r\n<br />\r\n<i>Sculpture V</i> is stinky… You might not want to get too close to this one! The sculpture accompanies a video piece of the artist trying to create a large invisible sculpture with the smell of a durian at Grand Central Station.\r\n","short_description":"<i>Invisible Sculptures</i> is an experiment that challenges human perception with sculptures that can only be “seen” by senses other than vision. The audience will incorporate different sensory abilities and activate their imagination to interact with the sculptures made of sound, temperature, and smell.","further_reading":"<p><i>Q. What motivated you to create Invisible Sculptures?</i></p>\n<p>Yeseul: There are spaces that exist, but are not visible. For instance, in a subway car, people tend to not get close to a person who has an unpleasant smell or look and it creates an empty space around the person. Although there is nothing physical, I can sense an invisible boundary around those spaces. I wanted to create a place where invisible forms are perceivable. <i>Invisible Sculptures</i> invites audiences to develop senses toward structures and boundaries that affect us but are not visible to us.  </p>\n<p><i>Q. Why did you decide to use “invisible materials”?</i></p>\n<p>Yeseul: Most people believe that what they see in front of them is real. However, seeing is only one of many different ways of perceiving the world and moreover, what we see is just a sliver of the whole electromagnetic spectrum. </p>\n<p>What if what we see cannot tell anything to our brain and mind? To create a place that encourages people to use senses other than vision, I used invisible materials such as sound, temperature, and smell. </p>\n<p><i>Q. How can the audience “see” the sculpture?</i></p>\n<p>Yeseul: The audience can see the sculptures by syncing different senses while feeling the air over the plinths with their hands.</p>\n<p><i>Q. What do you want people to feel?</i></p>\n<p>Yeseul: Close your eyes. Imagine that you are hollow, all physical objects in this room are hollow. Now imagine that the empty spaces in this room are “full”– the air is a physical material and it is occupying the whole empty space. Now open your eyes. </p>\n<p><i>Q. What did you feel?</i></p>\n<p>I feel a new type of sense growing inside of my body. This unusual feeling makes my senses towards both myself and the world more acute and keen. It invigorates me, opens up my heart and creativity. I want to create work that can inspire and awaken senses that people have but are not aware of in everyday life.</p>\n<p>In an attempt to share this feeling, I sculpted a firm tofu to make a negative space of a classroom at ITP. I was glad to be able to start a conversation about the feeling by showing the sculpture, but I still wanted to find a more immersive and richer form of the expression. This is when I decided to create an installation with a memorable activity and invite an audience into the space. </p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/invisible_thumbnail-1.jpg","title":"invisible_thumbnail","alt":"thumbnail","caption":""},"topics":[{"name":"Installation","slug":"installation"},{"name":"Tangiable","slug":"tangiable"}],"video_presentation_url":"https://player.vimeo.com/video/270191990","video_documentation_url":"https://player.vimeo.com/video/265481089","project_url":"http://yeseul.com/Invisible-Sculptures","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/invisible_thumbnail-1.jpg","title":"invisible_thumbnail","alt":"thumbnail","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/invisible_1.jpg","title":"invisible_1","alt":"invisible_1","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/invisible_3-1.jpg","title":"invisible_3","alt":"invisible_3","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/invisible_4.jpg","title":"invisible_4","alt":"invisible_4","caption":""}]}