{"post_id":114,"student_id":"95","student_name":"Alexia Kyriakopoulou","student_slug":"alexia-kyriakopoulou","advisor_id":"131","advisor_name":"Stefani Bardin","advisor_slug":"sb4840","project_title":"Sygnómi","project_question":"Through my personal experience with domestic abuse, I realized that there is a big gap between people’s perceptions of domestic violence and the reality of these situations. Unfortunately, the traits of domestic abuse are so counter-intuitive that attempts to look at it through the lens of common sense can actually drive you further away from the truth.\r\n<br />\r\n<br />\r\nResearch has found that a lot of people still believe that domestic violence happens elsewhere.  It is often believed that it only happens in families of color or lower socioeconomic status. Another common misconception is that victims that experience domestic violence won’t leave their partners because they are fiscally dependent on them.\r\n<br />\r\n<br />\r\nThrough my project, I attempt to combat these misconceptions by creating a VR experience which tells the familiar story of a couple who used to be really in love and how it devolves the relationship into one of abuse and violence. The experience is based on my personal story as well as stories from victims I have interviewed and researched. In this experience, I choose to focus not on the event and traumatic experience of the abuse per se (i.e. beating, violence etc.) that most VR experiences have portrayed so far, but convey what domestic violence looks like <br />\r\n<br />\r\nfrom the inside in terms of cultural expectations as well as behavioral and gender paradigms. \r\nThrough this experience I am emphasizing that a major reason that victims stay in abusive relationships is because they tend to create an illusion of their relationship and they keep going back to the perfect/fairytale moments they once had out of denial with their partners instead of accepting the more painful but honest truth. Abuse victims are looked at and judged from the outside in; <i>Sygnómi</i> offers a view from the inside out.","short_description":"<i>Sygnómi</i> (Greek for “I’m sorry\") is an interactive VR experience exploring the memories of a victim of domestic abuse. <i>Sygnómi</i> attempts to explain and educate the audience about the depth and complexities behind domestic abuse in more nuanced and unexpected ways.","further_reading":"","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumb-1.png","title":"thumb (1)","alt":"sygnomi","caption":""},"topics":[{"name":"Narrative","slug":"narrative"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/video/269232217","video_documentation_url":"","project_url":"www.alexiak.com","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumb-1.png","title":"thumb (1)","alt":"sygnomi","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/couch.png","title":"couch","alt":"scene2","caption":"scene2"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/corridor.png","title":"corridor","alt":"corridor","caption":"happy moments"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/scene1.png","title":"scene1","alt":"scene1","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/giphy-2.gif","title":"interaction example","alt":"interaction","caption":"object interaction"}]}