{"post_id":101,"student_id":"96","student_name":"Chetan Hasabnis","student_slug":"chetan-hasabnis","advisor_id":"131","advisor_name":"Stefani Bardin","advisor_slug":"sb4840","project_title":"Building Emergency Intelligence","project_question":"I am part of an NGEMS team developing next generation emergency systems that delivers real-time situational information of people, location and occupancy in buildings to help assist rescue personnel mitigate emergency situations. It provides concise information at the most crucial time to help operators at dispatch centers allocate resources effectively and aid incident commanders en-route to the rescue site with life saving information even before they arrive on scene.\r\n<br />\r\n<br />\r\n100+ customer interviews were conducted and two facts were discovered – 1. Operational difficulty and limited site information are the biggest challenge for fire fighters 2. The rescue teams literally go in blind. There is a 15 minute window of crucial time lost from the time the initial call received dispatch centers and until the first responders arrive on the incident site to execute evacuation procedures. I plan maximize rescue operations by providing context relevant information during this brief time by developing real-time emergency system that collects data from IoT sensors installed in buildings.\r\n\r\nFor the thesis I am building a prototype of a browser based application that contains a collection of digital 2d floor maps for the NYU Tisch building at 721 Broadway, visualizing smoke and temperature levels of Wifi enabled smoke detectors installed at ITP on the 4th floor over a mesh network integrated with our NGEMS platform.\r\n<br />\r\n<br />\r\nMy efforts are directed toward making it accessible to the first responder community as well as integration with third party CAD provides and incident management application over public safety mesh network.","short_description":"A real-time web platform activated during a fire to deliver information from emergency IoT sensors installed in buildings to assist firefighters and emergency personnel with situational data that will maximize their rescue operations with diminished injury and loss of life. ","further_reading":"","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Untitled-1-01.png","title":"Building Emergency Intelligence","alt":"Building Emergency Intelligence","caption":"Building Emergency Intelligence"},"topics":[{"name":"Data","slug":"data"},{"name":"Society","slug":"society"}],"video_presentation_url":"https://player.vimeo.com/video/269185473","video_documentation_url":"","project_url":"https://ngems.co/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Untitled-1-01.png","title":"Building Emergency Intelligence","alt":"Building Emergency Intelligence","caption":"Building Emergency Intelligence"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Intelligent-Floor-Maps.png","title":"Intelligent Floor Maps","alt":"Intelligent Floor Maps","caption":"Intelligent Floor Maps"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/User-Test.png","title":"User Test","alt":"User Test","caption":"User Test"}]}