{"post_id":532,"student_id":"98","student_name":"Elizabeth White","student_slug":"elizabeth-white","advisor_id":"131","advisor_name":"Stefani Bardin","advisor_slug":"sb4840","project_title":"Body Lights","project_question":"<i>\"That you make visible, what, without you, would never have been seen.\" -Red Burns</i>\r\n<br />\r\n<br />\r\nThis series is a tribute to the body as a complex organism and a universe of delicacy and energetic travel. It is believed by many energy workers that there are subtle energies of the body that are too high or low in frequency to be easily measured, yet still produce a profound impact on our moment-to-moment experiences. In <i>The Subtle Body; an Encyclopedia of your Energetic Anatomy</i>, it is stated that “underlying physical reality are subtle, indiscernible, energies that create and sustain all matter. They are the structures of energies that underpin our physical bodies. If we look beneath the surface of the world—the world that includes our clothes, toaster ovens, philosophies, our flesh—we will discover a universe of swirling and subtle energies.”\r\n<br />\r\n<br />\r\nWith time, I have come to understand my body not just as an undesired shape, but rather a very sensitive terrain of mercurial subtle energies. I have grown a new appreciation for the world inside of it. The world of the unexpressed and the expressed: stories untold, relationships unresolved, memories buried deep within, oscillating pains and pleasures, questions and conflicts that lapse themselves with time.\r\n<br />\r\n<br />\r\n<i>Body Lights</i> is a respect for and a celebration of the body and all it’s wonder. It is my attempt at a new focus and perspective on my physical form, through color, light and open-mindedness. One where the body’s curvature is accentuated instead of loathed and tucked away. It is an empowerment of the body. A mental recontextualizing. A new conversation. A new personal relationship. One of love and respect. It is an apology, for all that I’ve put it through. It is forgiveness, it is an understanding that it is still not totally liberated from the dark places of my mind, but one step closer.","short_description":"The body is a complex organism with an underlying infrastructure of subtle energies, untold stories, unresolved experiences, buried memories, oscillating pains and pleasures, questions and conflicts that lapse themselves with time. How can light, technology and physical movement be used to capture and amplify sensations of these mercurial energies and visualize the subtle realities that underpin our physical bodies?","further_reading":"","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/BodyLightsThumbnail.jpg","title":"BodyLightsThumbnail","alt":"me","caption":""},"topics":[{"name":"Identity","slug":"identity"},{"name":"Performance","slug":"performance"}],"video_presentation_url":"https://player.vimeo.com/video/269194390","video_documentation_url":"","project_url":"https://elizabethwhite.squarespace.com/thesis/#/first-shoot","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/BodyLightsThumbnail.jpg","title":"BodyLightsThumbnail","alt":"me","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Thesis_Archive_Sarah.jpg","title":"Thesis_Archive_Sarah","alt":"Thesis_Archive_Sarah","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Thesis_Archive_Leah.jpg","title":"Thesis_Archive_Leah","alt":"leah","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Thesis_Archive_Tyllr.jpg","title":"Thesis_Archive_Tyllr","alt":"Tyllr","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Thesis_Archive_Me3.jpg","title":"Thesis_Archive_Me3","alt":"me","caption":""}]}