{"post_id":431,"student_id":"99","student_name":"Jasmine A Soltani","student_slug":"jasmine-a-soltani","advisor_id":"131","advisor_name":"Stefani Bardin","advisor_slug":"sb4840","project_title":"Manifest Energy","project_question":"The lifecycle of a product includes the mining and processing of natural resources, manufacturing, transport, product delivery, use, and its reuse, recycling or disposal. Embodied energy is the energy consumed by all of the processes associated with production: the life-cycle up until the use phase. <i>Manifest Energy</i> is a series of lenticular stickers, a mechanical animation, and website that illustrate the life-cycle and embodied energy of digital devices. \r\n<br />\r\n<br />\r\nElectronics are unique in that they have exceedingly high embodied energy, exacerbated by planned obsolescence, their difficulty to repair, lack of supply chain accountability, and the increasing ubiquity of computing. The energy economy, on which the ecologically destructive digital economy is based, is unsustainable in itself. Can illuminating the resource demand of our digital devices change our consumption habits, our relationship with our devices, the way we design and legislate their use, and handle end-of-life?\r\n<br />\r\n<br />\r\nIn addition to shifting the paradigm by which we think about energy consumption, I hope my project informs people of actions that can be taken. By extending the lives of our products through repair, we can reduce demand for new items. By developing more modular electronics, we can make these devices easier to repair. By putting pressure on companies and legislators, we can achieve greater supply chain transparency and improve the health of people working on or near production sites. By developing renewable energy sources and eliminating carbon emissions, we can mitigate the ecological impact of the production of digital technologies.","short_description":"A series of artifacts that explore the limitations and opportunities for ecologically sustainable computing, with a focus on the energy consumed in the production of our digital devices.","further_reading":"<p>As I reflect on my work, at ITP and in the world more broadly, I have to acknowledge the tension of creating work with social and environmental justice as end goals when the digital surfaces that mediate this work embody these injustices. My thesis began by asking: what does ecologically sustainable and humane computing look like? It is important to consider the activities that information and communication technologies displace, as well as the role computing plays in empowering people, democratizing information, and improving sustainability in society. At the same time, it is difficult to quantify and compare these benefits with the consequences of the technology itself. </p>\n<p>To begin to address this, I investigated how experts measure the sustainability of products, and everything that goes into producing, using, and discarding our digital devices and their intermediary components. My research led me to life-cycle assessments and structural decomposition analyses, both ways of assessing and quantifying the ecological impacts (carbon emissions, energy use, pollution, etc) of products. I investigated cradle-to-cradle design methods, life-cycle assessment software and their associated databases, guides to sustainable buying for consumers, and companies that try to be more green. </p>\n<p>I learned that through a combination of energy-intensive production methods, planned obsolescence, and a 2-5 year use window, many modern electronic devices have an embodied energy of 70-80%. That is, 70-80% of the energy consumed by the entire life-cycle of these products is associated with their production phase. As such, we consume the most energy the moment we buy or replace them. Depending on how the energy is produced, this could result in a significant portion of the product’s carbon footprint (in addition to other pollutants associated with production). </p>\n<p><i>Manifest Energy</i> began with a series of lenticular stickers that I imagined to be a small-tech alternative to the development of an augmented reality application. In the past I may have achieved the effect of having one image overlay or replace another with AR, but I wanted to experiment with a way of circumventing this and avoid having people use their smartphones to experience the result. In the context of this project, it seemed to be an appropriate technology. While my original lenticular images addressed embodied energy specifically, they grew into a series that reveal different aspects of the supply chain for common electronic consumer items. By making them stickers, they could be distributed and stuck on the items themselves. However, while learning to develop these images, I was acutely aware that by using a computer, a printer, and ordering supplies, this was still a technology-mediated process. </p>\n<p>I also became aware of my limitations in understanding relative energies. Becoming energy-fluent was a learning curve, and it occurred to me others might have similar difficulty in comparing, for example, the energy consumed by leaving the light on at night versus the energy it takes to produce a smartphone versus the energy it takes to power the New York City Subway system for a year. How could I put these energies in context? I imagined one way might be to create an installation where people could experience energy transfer and then see the output. Another way might be to create a data visualization or animation that explains energy units and compares different products or activities. I have built versions of both responses.</p>\n<p>Inspired by the Phenakisticopes, Zoetropes, and Flipbooks of animation’s history, I created a hand crank flipbook animation machine. The hand crank provides movement to the animation, which shows all steps embodied in the production of a smartphone, until the stage it gets sold. The hand crank also powers an LCD screen, which shows how much energy you have produced compared with the approximate energy of the production stages you’ve just watched. I faced a conundrum in the use of an Arduino, current sensor, and LCD screen for this portion of the project. Building a way to measure the energy produced by a hand crank was part of my learning process, and it felt important to me for others to have the same physical understanding. </p>\n<p>After attempting to create an animation that mimicked the original Powers of Ten to show different energy magnitudes, the feedback I received demonstrated this format was confusing. Instead, I simplified this to an information visualization using P5.js. The website introduces two energy measurements: joules and a watt-hours, as well as embodied energy in the context of the life cycle of electronics. In addition to shifting our understanding of energy consumption, I hope my project brings to light the ways in which technology can be made more sustainable. So, in addition to this information visualization, the site includes a call to action and links to companies, organizations, legislation, and campaigns that are already making an impact.</p>\n<p>As a result of this project, there are many related questions I want to continue to explore. The European Commision is developing standards so that ecological assessments can be comparable across companies and products. How can we globalize standards like these? How can we better leverage recycled materials from digital devices and urban mining save energy? How energy intensive is the maintenance of networks, like the internet? How might we measure and understand the ecological impact of a distributed network and our marginal contributions?</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnailV5.jpg","title":"thumbnailV5","alt":"earth and phone","caption":""},"topics":[{"name":"Data","slug":"data"},{"name":"Society","slug":"society"}],"video_presentation_url":"https://player.vimeo.com/video/269194497","video_documentation_url":"","project_url":"http://www.jasminesoltani.com/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnailV5.jpg","title":"thumbnailV5","alt":"earth and phone","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/animation_machine_diagram.gif","title":"animation_machine_diagram","alt":"animation machine system diagram","caption":"Animation Machine system diagram"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/inProgress.gif","title":"inProgress","alt":"Experimenting with glue for lenticular flip prints","caption":"Experimenting with glue for lenticular flip prints"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/computer_flip.gif","title":"computer_flip","alt":"lenticular flip sticker on the back of a computer","caption":"Lenticular flip sticker on the back of a computer"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/website.jpg","title":"website","alt":"landing page for manifest energy website","caption":"landing page for manifest energy website"}]}