[{"student_id":"40","student_name":"Akmyrat Tuyliyev","student_slug":"akmyrat-tuyliyev","advisor_id":"119","project_title":"Erteki: Storytelling by Children","project_question":"<i>Erteki<\/i> means fairy tale in Turkmen. Fairy tales are stories that were told to children as a way to teach in indirect, fanciful and metaphorical ways how to grow up in their culture. But in the 21st century, mass media entertainment has become the primary source for children’s development and how they perceive the world. \r\n<br \/>\r\n<br \/>\r\nUnfortunately, there has been a significant lack of representation of marginalized communities in the mainstream media for decades. Increasingly people are speaking out about not seeing a representation of themselves on television or in movies when growing up. As a Turkmen filmmaker and a new media artist, this issue was undoubtedly part of my own childhood. I found it troubling to see that the problems are presently stressed via conversation, but not much is done to solve them. For my thesis, I had to ask myself: is it possible to create a narrative experience that tells a unique and meaningful story to every individual user, tailored to their culture?  \r\n<br \/>\r\n<br \/>\r\nI decided to start with a culture I know best, my own. I reached out to the small Turkmen community in NYC and found many Turkmen-American children, who are in the midst of developing their identity. After my research with children, I realized that I had to put media in children’s hands, and give them a voice to represent their own stories and experiences. I developed an immersive installation <i>Erteki<\/i>, which listens to children’s stories and illustrates them live, using speech recognition, machine learning and projection. <i>Erteki<\/i>, or fairy tale, is designed to make stories and characters come to life in a magical experience. By providing a platform that empowers children with authorship over their own narratives, I hope that they grow up feeling included and visible. ","short_description":"<i>Erteki<\/i> is an immersive space for children from marginalized communities to tell their stories and experience their narratives coming alive.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/baby_thumbnail.png","title":"Erteki Thumbnail","alt":"A baby boy looking into a bright screen","caption":"Erteki thumbnail"},"topics":[{"name":"Identity","slug":"identity"},{"name":"Narrative","slug":"narrative"}]},{"student_id":"58","student_name":"Alejandro Matamala","student_slug":"alejandro-matamala","advisor_id":"124","project_title":"Archetype","project_question":"Many creative professionals - from visual artists to musicians, writers to digital media artists -all face a similar problem. Most of the information about their artwork and projects lives within a few concentrated online publishing platforms and social networks, and these companies typically control access to the information and how it is presented. For artists of all kinds, this turns out to be a huge threat; not only in terms of the openness of the web and the artist’s ability to maintain control over their intellectual property but also as an impediment to creative expression and sustainable ways to archive and distribute artwork digitally. \r\n\r\nArchetype aims to address the centralization and standardization of creative expression of how works of arts often inhabit the web. An alternative, independent and experimental set of desktop publishing tools that enable artists to share their artwork online without having to depend on centralized publishing platforms or cloud computing services. \r\n\r\nThe project runs on a distributed peer-to-peer network using the DAT Protocol (https:\/\/datproject.org), which adds important characteristics to the publishing practice. It enables the publishing of content from any device connected to the network, including an artist’s individual personal computer. \r\n\r\nUnlike centralized models, where company-owned servers assume the right of publishing, a peer-to-peer protocol enables any computer, even an artist’s personal computer, the right to serve content,  allowing affordable and accessible alternatives to the display of information online. In addition, DAT, allows users to distribute data through an archive system, enabling features like going back and revert previous versions. Distributed archive systems follow a bottom-up model which makes interconnected data solutions possible. Artists’ collections of work can be integrated together allowing anyone interested to contribute and participate.","short_description":"<i>Archetype.cc<\/i> is a response to my thesis question: How can a peer-to-peer network offer new and beneficial ways for artists to display and share their work on the web? \r\n\r\nThe goal of the project is to design and prototype accessible, open source tools focused on the publishing of artistic material in a p2p network.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/arche.jpg","title":"archetype","alt":"archetype","caption":""},"topics":[{"name":"Culture","slug":"culture"},{"name":"Tool\\Service","slug":"toolservice"}]},{"student_id":"2","student_name":"Alex Fast","student_slug":"alex-fast","advisor_id":"114","project_title":"See the Ball","project_question":"What makes a baseball player good? How many home runs he hits? How many strikeouts he records? <i>See The Ball<\/i> answers that question in ways the baseball community is yet to: through interactive, and engaging data visualization. \r\n<br \/>\r\n<br \/>\r\nBaseball has reached the age of Big Data and it’s messier than ever. The race to find the next great catch-all metric has left in its wake a myriad of statistics splashed onto a spreadsheet. Go to Fangraphs.com, baseball-reference.com or any other baseball website and search for any player. You’ll be met with dozens of rows and columns of data with esoteric names like wRC+, bRUP, fWAR, and wBBZ. Heard of them? I hope not because half of them are made up. While a sabermetrician may be able to keep up with and comprehend the latest metrics the most die-hard fans are often left scratching their head when trying to figure them out. The usage of bland spreadsheets to convey this often complex data isn’t helping either. \r\n<br \/>\r\n<br \/>\r\n<i>See The Ball<\/i> aims to fix that by presenting the same data in a clearer, more intuitive way so that fans and non-fans alike can both understand and enjoy America’s past-time.","short_description":"How can we change the way baseball data is represented to make it more intuitive, contextualized and interactive?","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/Berrios.jpeg","title":"Berrios","alt":"berrios","caption":"Berrios"},"topics":[{"name":"Data","slug":"data"},{"name":"Narrative","slug":"narrative"}]},{"student_id":"77","student_name":"Alexander Zimmer","student_slug":"alexander-zimmer","advisor_id":"129","project_title":"Portraits of Evanston","project_question":"For middle school students, history is often seen as the truth, rather than a version of it.  Only by doing, can students begin to understand what it means to write history.   For three months, five students at the McGaw Hill YMCA in Evanston, IL engaged in writing pieces of their own family histories.\r\n<br \/>\r\n<br \/> \r\nEach student engaged with their history by interviewing a family member about archival photos that they found in their home.  They subsequently engaged with the present state of their family’s history by interviewing various citizens in Evanston, IL.\r\n<br \/>\r\n<br \/>\r\nThroughout these experiences, students created media, working with a team of filmmakers to film their entire process.  In creating this media, students considered more deeply the writing of history itself.\r\n<br \/>\r\n<br \/>\r\nMoving forward, the stories of these five students will be used by teachers interesting in having their students engage in similar projects.  Shorts films depicting the process of researching and writing history that these five students went through, will be used to get other students excited about doing the same.\r\n<br \/>\r\n<br \/>\r\nAs these five students, and the others who follow, grow older, they will already have set the groundwork to think critically about history as being written by humans, and not a definitive truth.","short_description":"<i>Portraits of Evanston<\/i> is an audiovisual storytelling project and a curriculum that engages students with the concept of writing history. Students used qualitative skills such as interviewing and photography to research stories of their family history.  They documented these stories through film to inspire other students to understand what it means to write history.\r\n","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/ymca2.jpg","title":"ymca","alt":"ymca","caption":"ymca"},"topics":[{"name":"Education","slug":"education"},{"name":"Narrative","slug":"narrative"}]},{"student_id":"95","student_name":"Alexia Kyriakopoulou","student_slug":"alexia-kyriakopoulou","advisor_id":"131","project_title":"Sygnómi","project_question":"Through my personal experience with domestic abuse, I realized that there is a big gap between people’s perceptions of domestic violence and the reality of these situations. Unfortunately, the traits of domestic abuse are so counter-intuitive that attempts to look at it through the lens of common sense can actually drive you further away from the truth.\r\n<br \/>\r\n<br \/>\r\nResearch has found that a lot of people still believe that domestic violence happens elsewhere.  It is often believed that it only happens in families of color or lower socioeconomic status. Another common misconception is that victims that experience domestic violence won’t leave their partners because they are fiscally dependent on them.\r\n<br \/>\r\n<br \/>\r\nThrough my project, I attempt to combat these misconceptions by creating a VR experience which tells the familiar story of a couple who used to be really in love and how it devolves the relationship into one of abuse and violence. The experience is based on my personal story as well as stories from victims I have interviewed and researched. In this experience, I choose to focus not on the event and traumatic experience of the abuse per se (i.e. beating, violence etc.) that most VR experiences have portrayed so far, but convey what domestic violence looks like <br \/>\r\n<br \/>\r\nfrom the inside in terms of cultural expectations as well as behavioral and gender paradigms. \r\nThrough this experience I am emphasizing that a major reason that victims stay in abusive relationships is because they tend to create an illusion of their relationship and they keep going back to the perfect\/fairytale moments they once had out of denial with their partners instead of accepting the more painful but honest truth. Abuse victims are looked at and judged from the outside in; <i>Sygnómi<\/i> offers a view from the inside out.","short_description":"<i>Sygnómi<\/i> (Greek for “I’m sorry\") is an interactive VR experience exploring the memories of a victim of domestic abuse. <i>Sygnómi<\/i> attempts to explain and educate the audience about the depth and complexities behind domestic abuse in more nuanced and unexpected ways.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumb-1.png","title":"thumb (1)","alt":"sygnomi","caption":""},"topics":[{"name":"Narrative","slug":"narrative"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"20","student_name":"Amanda Min-Jin Lee","student_slug":"amanda-min-jin-lee","advisor_id":"123","project_title":"JAM-JAM","project_question":"I love music and we all love music. Music is always on in our daily lives. Music is powerful as it can change the mood of the environment and the people that reside in it. These shared musical spaces bring out strong emotional connections between each listener. Hip-hop, jazz, classical; these are different genres that deliver different emotions and moods, depending on where we are and who we are with. \r\n<br \/>\r\n<br \/>\r\nHowever, sometimes an annoying situation happens when we are listening to music together with friends. Somebody needs to control the music. But it is hard to satisfy everyone because we all have different musical tastes. If there are more than two people in the same room who have different musical tastes, who will make the decision for what’s playing on the stereo? \r\n<br \/>\r\n<br \/>\r\nBased on this question, my goal was to find an answer to this small dilemma in my own playful way. How can I shuffle music playlists in a fair and equal way?\r\n<br \/>\r\n<br \/>\r\nI ended up with two keywords: “competition + shuffle”. I wanted the users to focus on the music-listening experience rather than the competitive action, so I chose a simple and dynamic “shaking” interaction for the game. It is fast and dynamic, so that users may quickly associate this action with the process of mixing music.","short_description":"This is a mobile app that solves the world’s greatest problem… who gets to control the music playlist? <i>Jam-Jam<\/i> is a playful and democratic music player that helps create a mixed playlist that everybody can enjoy.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/amanda-01-1024x768.jpg","title":"amanda","alt":"-","caption":"-"},"topics":[{"name":"Play","slug":"play"},{"name":"UX\\UI","slug":"uxui"}]},{"student_id":"76","student_name":"Anastasios Germanidis","student_slug":"anastasios-germanidis","advisor_id":"129","project_title":"Sybil Society","project_question":"In <i>Sybil Society<\/i>, you are not tied to one identity, one personality, one past. Here, you can create as many identities as you like and switch between them freely. Once you have selected an identity, an algorithm matches you with other users nearby, and a scene is generated based on your respective identities. \r\n<br \/>\r\n<br \/>\r\nExamples of scenes include: meeting a friend, going on a date, breaking up with a significant other, doing a job interview, having an existential crisis. You can continue living the life of that identity for as long as you like – an hour, a day, a month, a year. Then you can decide to become someone else.\r\n<br \/>\r\n<br \/>\r\nMark Zuckerberg said in 2010: “You have only one identity. Having two identities for yourself is an example of a lack of integrity.” In the past decade Zuckerberg’s vision of social life, where most of one’s online and offline activity is linked directly to a single legal identity, has become reality.\r\n<br \/>\r\n<br \/>\r\nBut pseudonymity is having a comeback, as people wake up to the myriad problems of the “real name internet.” Cryptocurrencies will enable people to participate in economic transactions without using their legal identity. Mixed reality headsets will get people to start identifying with the faces and bodies they choose, instead of those they were born with. Machine learning will allow people to mimic the style and behavior of others with ever-increasing accuracy. <i>Sybil Society<\/i> is today’s approximation of this weird future of fluid identities.","short_description":"<i>Sybil Society<\/i> is an experiment. It is a simulated society that operates in parallel with “real” society. Users choose fictional identities and have interactions in public spaces, receiving real-time instructions on their phones for all their dialogues and actions.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/Artboard-Copy-3.png","title":"Artboard Copy 3","alt":"thumb","caption":""},"topics":[{"name":"Identity","slug":"identity"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"39","student_name":"Anne-Michelle Gallero","student_slug":"anne-michelle-gallero","advisor_id":"119","project_title":"100 Days of News","project_question":"My thesis project is an interactive data art piece that tracks my journey through my <i>100 Days of News<\/i> and immersing myself in the fast paced news cycle. I felt as if important events were getting lost or drowned out in the 24-hour news and media cycle of our phones, the internet, TV and podcasts, and that I wanted to create a time capsule of important events of the year as a ‘memory bank’ of the news. \r\n<br \/>\r\n<br \/>\r\nThe result is an interactive experience on a website documenting my reaction and absorption of news media content and exploring our relationships with the news.","short_description":"How do we start a conversation about the news to help find common ground? With that in mind, I created an interactive data art web page that follows my 100-day journey of immersing myself in the news to understand the flow and organization of news information.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/100News_Thumbnail_320x240.jpg","title":"100News_Thumbnail_320x240","alt":"Thesis: 100 Days News_Thumbnail","caption":"Thesis: 100 Days of News_Thumbnail"},"topics":[{"name":"Data","slug":"data"},{"name":"Society","slug":"society"}]},{"student_id":"3","student_name":"Ari Melenciano","student_slug":"ari-melenciano","advisor_id":"114","project_title":"OJO ORO Neo-retro Experimental Cameras","project_question":"At a time when alluring technology hyper extends the possibilities, we tend to forget the earlier analog inventions that played crucial roles in culture without the instant advancement of technical convenience. So, what if in applying the emerging technologies to analog inventions, we explored and discovered a world of the best of culture and innovation?\r\n<br \/>\r\n<br \/>\r\nThere are a variety of different forms of photography, from digital to film to instant, and they have each played into the development of society and culture. Cameras are a tool used to document life, and can often be used as a artistic expression. Through <i>OJO ORO<\/i>, I explore photography for artistic purposes, self identity, artistic expression, brand identity, design, and user experience to build a brand and product experience that creates moments of wonder.","short_description":"In applying emerging technologies to analog inventions, and developing human-centric, visceral brand strategies, what are the possibilities for an experimental neo-retro camera company?","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/ari1.png","title":"OJO ORO","alt":"OJO ORO","caption":"a line of neo reto experimental cameras."},"topics":[{"name":"Tool\\Service","slug":"toolservice"},{"name":"UX\\UI","slug":"uxui"}]},{"student_id":"78","student_name":"Ariana Vassilopoulou","student_slug":"ariana-vassilopoulou","advisor_id":"129","project_title":"A Fresh View","project_question":"Cyprus is a divided island separated by what is known as a political “Green Line.” Its formal name is the United Nations Buffer Zone, which is a demilitarized area patrolled by the United Nations Peacekeeping Force in Cyprus (UNFICYP). It’s been this way since the Turkish Invasion of Cyprus of 1974. The Northern side of the island is the Turkish Republic of Northern Cyprus, and the Southern side is the Republic of Cyprus—the Greek side—where I am from. While the separation isn’t as absolute as North and South Korea—for example, I can cross the border—each side is run like a totally different country.  ","short_description":"A 360 Video installation that simulates the division of Cyprus, and shows the perspectives of the two communities—The Greek and Turkish Cypriots.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnailphoto.jpg","title":"thumbnailphoto","alt":"thumbnail","caption":"thumbnail"},"topics":[{"name":"Education","slug":"education"},{"name":"Installation","slug":"installation"}]},{"student_id":"4","student_name":"Brandon Kader","student_slug":"brandon-kader","advisor_id":"114","project_title":"IMVII","project_question":"I made an immersive experience without a device or VR headset.  I have tried a VR headset and felt disoriented and extremely uncomfortable.  I most definitely do not want to work in that medium.  It is important that the performer not touch things like a conductor does not play a specific instrument in an orchestra, rather directs the performance.  My experience with piano performance is that it is not very physically moving, the piano is stationary and the performer is seated at the keyboard.  There is little showmanship or stage presence.  I have felt the need to perform my music in another way.  \r\n<br \/>\r\n<br \/>\r\nI explored how to make an immersive experience - including music and visual effects - using a touch free interface for modern composers to perform room scale installations.  I used a Kinect camera to gather depth sensory data with Processing to map music and generative visuals in a system I built with Max MSP Jitter, a visual programming language that patches and connects the data to music and visual elements.  I used a triplehead2go for 3 projector display to create a room-scale visual experience and performed at NYU Steinhardt’s Recital Room.   ","short_description":"I created a system to seamlessly integrate music, visuals, and depth sensory data to perform as a conductor.  The performer moves in a space to conduct music samples and generative visuals.\r\n","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/IMVII-THESIS-ARCHIVE-THUMBNAIL-1.jpg","title":"IMVII THESIS ARCHIVE THUMBNAIL","alt":"IMVII","caption":"caption"},"topics":[{"name":"Installation","slug":"installation"},{"name":"Performance","slug":"performance"}]},{"student_id":"21","student_name":"Bryan Hsu","student_slug":"bryan-hsu","advisor_id":"123","project_title":"Cascade","project_question":"<i>Cascade<\/i> is an autobiographical virtual reality film that explores an experience of near death. When I was young, I almost drowned. I remember what it felt like: the struggle of grasping onto hope, and the eventual release of it. The experience of it never really left me, and the goal of the film is to recreate these complex feelings. My mother also experienced something that many fear to even think about: the unknown status of her child’s well being. To this day, more than 15 years later, my mother still recalls this event as the worst moment of her entire life.\r\n<br \/>\r\n<br \/>\r\nI view VR as a tool to immerse people into scenarios that are often un-experienceable in their life. I also view it as a therapeutic tool that aids in expressing complicated thoughts. It’s hard to describe to people what life changing experiences feel like because no one can truly imagine all the nuanced emotions and feelings present during the described event.\r\n<br \/>\r\n<br \/>\r\nVR is a medium where perspective and point of view is the focus. I am recreating these perspectives to share with people because it’s the only way that I am able to truly surface these guarded emotions.","short_description":"Cascade is a cinematic VR project that retells the near death experience of its creator. The piece delves into the natural discomfort of virtual reality and how this discomfort can be utilized as a catalyst for surfacing buried emotions.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnail-cascade2.png","title":"thumbnail-cascade2","alt":"Cascade thumbnail","caption":"Cascade thumbnail"},"topics":[{"name":"Narrative","slug":"narrative"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"23","student_name":"Chester Dols","student_slug":"chester-dols","advisor_id":"123","project_title":"On Otherness and Queer Affect","project_question":"<i>On Otherness and Queer Affect <\/i>was designed in order to encourage conversations around queerness and raise awareness around biopolitics and queer issues. It is an interactive installation of intersex sculptures which exhibit life and sentience through light and sound. \r\n<br \/>\r\n<br \/>\r\nThe Queer identity is defined by that which is normative. Queer, unlike normalcy, is neither constant nor clearly defined. It is outside of the gender binary of male and female, and outside of the heteronormative dichotomy of man and woman. Inherently, those who identify as Queer are Othered by those around them because their identity exists outside of what is normal or ‘natural’ to these communities.\r\n<br \/>\r\n<br \/>\r\nIn society, we often equate the identities of those who are Other to us to animals, beasts, inanimate objects, and degrading ideas in order to reduce the power of these minorities within the larger normative system. \r\n<br \/>\r\n<br \/>\r\nThe sculptures which I have made are designed to be fantastical, alluring, human, familiar, but also alien and undefined. They are animated through technology and take on an Otherness through life. From afar, these objects are radiant and affect the space around them, exhibiting a vibrant performance of light and sound. As you move closer to them, their animated performance diminishes. Thus, your presence affects their ability to exert their will within their space.\r\n<br \/>\r\n<br \/>\r\nYour intrusion upon the space creates a power shift and tension between you and these sculptures. Why is your presence silencing? Does their lack of reaction inhibit your will as well? The work is intended to evoke thoughtful reflection within the viewer and generate conversation around the ideas of queer otherness.","short_description":"My thesis is about communication. I question whether popular aesthetics can be used as a form of ethos to engage in conversations around LBGT queerness. Or in other words, can beauty and\/or popular taste be used as convincing forms of rhetoric to entice, disarm, or persuade audiences to engage in conversations around Queerness?","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/THUMBNAIL-Converted.jpg","title":"THUMBNAIL","alt":"On Otherness and Queer Affect","caption":"On Otherness and Queer Affect"},"topics":[{"name":"Identity","slug":"identity"},{"name":"Installation","slug":"installation"}]},{"student_id":"96","student_name":"Chetan Hasabnis","student_slug":"chetan-hasabnis","advisor_id":"131","project_title":"Building Emergency Intelligence","project_question":"I am part of an NGEMS team developing next generation emergency systems that delivers real-time situational information of people, location and occupancy in buildings to help assist rescue personnel mitigate emergency situations. It provides concise information at the most crucial time to help operators at dispatch centers allocate resources effectively and aid incident commanders en-route to the rescue site with life saving information even before they arrive on scene.\r\n<br \/>\r\n<br \/>\r\n100+ customer interviews were conducted and two facts were discovered – 1. Operational difficulty and limited site information are the biggest challenge for fire fighters 2. The rescue teams literally go in blind. There is a 15 minute window of crucial time lost from the time the initial call received dispatch centers and until the first responders arrive on the incident site to execute evacuation procedures. I plan maximize rescue operations by providing context relevant information during this brief time by developing real-time emergency system that collects data from IoT sensors installed in buildings.\r\n\r\nFor the thesis I am building a prototype of a browser based application that contains a collection of digital 2d floor maps for the NYU Tisch building at 721 Broadway, visualizing smoke and temperature levels of Wifi enabled smoke detectors installed at ITP on the 4th floor over a mesh network integrated with our NGEMS platform.\r\n<br \/>\r\n<br \/>\r\nMy efforts are directed toward making it accessible to the first responder community as well as integration with third party CAD provides and incident management application over public safety mesh network.","short_description":"A real-time web platform activated during a fire to deliver information from emergency IoT sensors installed in buildings to assist firefighters and emergency personnel with situational data that will maximize their rescue operations with diminished injury and loss of life. ","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/Untitled-1-01.png","title":"Building Emergency Intelligence","alt":"Building Emergency Intelligence","caption":"Building Emergency Intelligence"},"topics":[{"name":"Data","slug":"data"},{"name":"Society","slug":"society"}]},{"student_id":"5","student_name":"Chloe Gao","student_slug":"chloe-gao","advisor_id":"114","project_title":"Ephemeral","project_question":"During my first summer in New York, many of my friends visited me and slept in my living room. Since my apartment is close to the Hudson River Park, I always took them to the park for a walk in the evenings. They shared with me their stories of the city: hopes, dreams; sweet and broken hearts. I have lived in the city for three years now, but not as many friends visited me since that summer. Sometimes they came, but they no longer slept in my living room. This project is for the ephemeral summer nights that will never happen again.\r\n<br \/>\r\n<br \/>\r\nInspired by site-specific kinetic sculpture, my thesis project Ephemeral explores the potential forms of kinetic sculptures, specifically in my thesis human forms in augmented reality. I chose a wireframe material because its transparent texture delivers the feeling of memory: it looked like a shadow in the day, and glowing particles at nights. \r\n<br \/>\r\n<br \/>\r\nUsers who download the app can see and explore the AR experience I created at the Hudson River Park west of Manhattan. Users have to go to the exact area in order for the virtual sculptures to show up. As the camera moves away, the sculpture vanishes.  The app Ephemeral is essentially an AR magazine of the city, and it will help you understand the city in a  unique, emotional and romantic way. \r\n<br \/>\r\n<br \/>\r\nThe app is written in Swift and ARkit, and uses Google Geo-Location API.","short_description":"<i>Ephemeral<\/i> consists of three site-specific AR installations. Each characterizes one emotion: lost and exploration, excitement, and desperation. It explores the technique of objectifying emotions into AR scenes at specific locations. Users see through a mobile app to watch these stories and experience the emotions.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/Thumbnail-2.jpg","title":"Thumbnail","alt":"Thumbnail","caption":""},"topics":[{"name":"Installation","slug":"installation"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"22","student_name":"Christina Hall","student_slug":"christina-hall","advisor_id":"123","project_title":"The Masks I Wear","project_question":"<i>The Masks I Wear<\/i> is a solo live performance, alternative documentary that explores the harassment experienced by women in industry. The artist has collected personal stories from four women who have experienced harassment in a professional environment and then “wears” projected motion controlled digital masks to portray the collected stories. \r\n<br \/>\r\n<br \/>\r\nEach performance sits only four audience members, each paired with a narrative from a different woman. Through the physical interaction of pushing a button, audience members will be able to influence how much of the narrative is told.  This interaction will challenge the audience, putting them in a position of power and control, deciding how much of the emotional story to experience. \r\n<br \/>\r\n<br \/>\r\nThe artist sits on a rotating stool with the audience surrounding her in a circle. An element of privacy is added by dividing the space between each audience member, allowing them to feel comfortable with varying degrees of interaction during the performance.  \r\n<br \/>\r\n<br \/>\r\nThe artist will be using a combination of facial tracking software and projection mapping to portray the sketched face of the woman that have gone through the harassment or assault.","short_description":"This is an investigation to determine if audience interaction changes the impactfulness of a narrative. This study is conducted by way of a one-woman show, utilizing face tracking technologies and interactive elements. The performance explores stories of harassment experienced by women and the power dynamics responsible for it.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/HallC_TMIW_thumbnail320x240.jpg","title":"HallC_TMIW_thumbnail320x240","alt":"tmiw","caption":""},"topics":[{"name":"Narrative","slug":"narrative"},{"name":"Performance","slug":"performance"}]},{"student_id":"59","student_name":"Cristobal Valenzuela","student_slug":"cristobal-valenzuela","advisor_id":"124","project_title":"Runway","project_question":"As both an artist and newcomer to the field of machine learning, I am fascinated by what the technology can achieve yet somewhat overwhelmed by its complexity\r\n<br \/>\r\n<br \/>\r\nBut while commercial and political applications — such as speech detection and image recognition, can be found everywhere- experimentation with machine learning remains, for the most part, confined to computer scientists and engineers. For an outsider, with no previous computer science experience, trying to understand and use modern machine learning techniques to explore its creative potential can be overwhelming and deeply frustrating.\r\n<br \/>\r\n<br \/>\r\nMy ITP thesis project, Runway, is an invitation to explore some of these ideas. If models are the building blocks of machine learning, how can we create more accessible tools to access them? If we could have modern zinc paint tubes for digital artists, what would they look like?\r\n<br \/>\r\n<br \/>\r\nRunway’s main goal is to make the process of running and using a state of the art machine learning model as easy as possible. This project is not about creating the right training environment to deploy It is not about training an algorithm and it’s not about hyper-parameters or hard code data science. It is a project built around the simple idea of making models accessible.\r\n<br \/>\r\n<br \/>\r\nIn Runway, inputs are ways of triggering a pre-trained model to perform a certain operation. A model runs over the inputs and then outputs results. You can use these results in any way you want. Models are open-source and you can pick from a collection of trained models. Runway provides a library of models you can use any way you want.  Runway allows users to connect the inputs or outputs of those models to other software.","short_description":"<i>Runway<\/i> is an invitation to artists, designers, educators and anyone interested, to learn and explore machine learning through accessible tools. Machine learning is a complex field that will likely continue to impact our society for years to come and we need more ways of giving more people access to this technology.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnail.jpg","title":"thumbnail","alt":"runway","caption":""},"topics":[{"name":"Machine Learning","slug":"machine-learning"},{"name":"Tool\\Service","slug":"toolservice"}]},{"student_id":"41","student_name":"Daniella Garcia-Rosales","student_slug":"daniella-garcia-rosales","advisor_id":"119","project_title":"Curiosity Algorithm","project_question":"What occurs in the brain of a child when he\/she perceives a soap bubble floating in thin air? How can we explain our shared capacity to wonder, have a sense of curiosity and the potential of discovery? \r\n<br>\r\n<br>\r\nFrom infancy, humans have a significant ability to infer the physical structure of the world, our brains intuitively explore possible interpretations of sensory stimuli and extrapolate beyond presented data. As an artist\/designer immersed in the world of technology, I constantly wonder how could we benefit from understanding our innate drive for curiosity? Can we develop the tools needed to enhance our shared capacity to discover? \r\n<br>\r\n<br>\r\nToday we teach machines to “perceive” and learn based on algorithms that have little to do with the full complexity of human experience. However, it is believed that these technologies present an opportunity to understand the human brain and its underlying mechanisms. Many vital questions remain, particularly in our comprehension of human innateness. Curiosity or an intrinsic desire to learn and an engine for discovery seems essential to human experience, yet such spontaneous behavior remains an uncertain territory. \r\n<br>\r\n<br>\r\nI would like to approach this challenge from a speculative angle, informed by a thorough research on the pertinent fields. Designing and conducting a series of experiments, not intended to provide immediate answers to my initial hypothesis but as a new empirical methodology to question the logic behind our own data. This project might enable a more accessible and malleable understanding of the technologies that currently attempt to explore and determine our cognitive potential.\r\n<br>\r\n<br>\r\nTechnology has allowed us to make visible, what without us, might never have been seen. Can we design a curiosity algorithm that might lead us to our own discoveries? Can we redefine our own limitations? \r\n<br>\r\n<br>\r\nAn algorithm as a metaphor \r\nA metaphor as a tool\r\n <br>\r\n<br>\r\nThis project will entail a research approach and an experiential component, with an accompanying manual for empirical experiment design. Please find more information here: \r\n<br>\r\n<br>\r\nhttp:\/\/curiosity-algorithm.com\/\r\n<br>\r\n<br>\r\n<i>“When you admire something you become larger than yourself. When you\r\nwitness beauty, you begin to have hope again.” Louise Bourgeois<\/i>","short_description":"How do we learn to formulate the right questions that lead us to our own discoveries? ","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/uno.png","title":"uno","alt":"curiosity","caption":"a curiosity algorithm"},"topics":[{"name":"Education","slug":"education"},{"name":"Machine Learning","slug":"machine-learning"}]},{"student_id":"79","student_name":"Danni Huang","student_slug":"danni-huang","advisor_id":"129","project_title":"Jamais Vu","project_question":"Memory is a completely personal experience, constructed from nothing but pure perception. And since memories are always retroactively altered, the perspectives that are based upon them are also never solid and always shifting. Being interested in reading myself through the shifting terrain of subconsciousness and unconsciousness, I started to record my dreams on a regular basis to track their patterns over time.\r\n<br \/>\r\n<br \/>\r\nI found it interesting that many of my dreams were of a looping nature, with no beginnings or ends. My project is an attempt to transport the looping nature of these dreams to the waking world via virtual reality, to allow for more lucid exploration of the meaning of loops in our lives. \r\n<br \/>\r\n<br \/>\r\nWe are so close to our own life that most of us don’t see the structure of it; we live unaware of the loops in which we live. In <i>Jamais Vu<\/i> I shortened the cycle of the loops, set an observation distance between us and them and created an immersive virtual world full of repetitions of those endless loops. It consists of four looping scenes that are based on dreams of mine. Together, these four scenes represent the repetitions that fill our life through a series of immersive metaphors: a loop of time, of matter, of energy and of human behaviors. ","short_description":"An experimental VR meditation that consists of repetitive loops inspired by dreams. Drawing on the surrealist approach, <i>Jamaias Vu<\/i> aims to provide a rich metaphorical representation of our unconscious by transporting the looping feeling of our dreams into the waking world.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnail-12.jpg","title":"thumbnail","alt":"0","caption":""},"topics":[{"name":"Narrative","slug":"narrative"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"42","student_name":"David Temchulla","student_slug":"david-temchulla","advisor_id":"119","project_title":"Beast of Burden","project_question":"For thesis I wanted to further my practice of developing interactive, data-driven sculptures that investigate the spaces between the art object and lived experience. \r\n<br \/>\r\n<br \/>\r\nMore specifically, I wanted to create works that take the promise of technology and incorporate the surrounding natural environment. In doing so, I aimed to deepen and extend methods I have used in previous work (e.g., Cosmic Breath, where data taken from a wind sensor that measures the power of an individual’s breath is used to activate motors that tug at stalks of wheat, simulating a powerful gust of wind blowing through a field) to develop a new body of work that focuses no longer on the individual, but on the collective.\r\n<br \/>\r\n<br \/>\r\nThese new works will manifest as a new form of social sculpture - one that perpetuates meaningful collective interactions between humans and the material world. Ultimately, I aim to create works that require an aggregation of small individual actions to demonstrate and explicate how the actions of many can create something monumental.","short_description":"An interactive sculpture that promotes collective action and collaboration amongst individuals. Through an aggregation of small individual gestures, the unified voice of three individuals becomes a monumental natural event- a thunderstorm. Inspired and based on the ideas of Joseph Beuys's Social Sculptures, I call it this work Collective Sculpture.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/Thumb-3.png","title":"Beast of Burden","alt":"Social Sculpture","caption":"Interactive Collective Sculpture"},"topics":[{"name":"Installation","slug":"installation"},{"name":"Sound","slug":"sound"}]},{"student_id":"60","student_name":"Diego Cruz Castillo","student_slug":"diego-cruz-castillo","advisor_id":"124","project_title":"The Future of Comics","project_question":"Comics are a unique way to tell stories and it's being part of our culture since the beginning of modern civilization. \r\n<br \/>\r\n<br \/>\r\nI love reading comic books since I can remember, and now I enjoy reading them with my 3-year-old son. I honestly want him to keep loving them as long as he wants.\r\n<br \/>\r\n<br \/>\r\nBut in our increasingly digital world, the industry is still strongly dependent in print sales. Current efforts for a digital transition have yet to gain significant traction.\r\n\r\nWe haven't seen successful efforts in fully embracing the mobile platform as distribution channel, and more important, mobile technologies as new storytelling tools.\r\n<br \/>\r\n<br \/>\r\nThere could be a number of reasons for this: status quo inertia, fear of the uncertain and the evident skillset gap between current comics creators and technologists capable of making mobile applications.\r\n<br \/>\r\n<br \/>\r\nI planned to fully tackle this last reason. And for that, I needed to build a tool that is easy to use but powerful enough for helping creators unleash mobile's full potential as a mainstream storytelling platform.\r\n<br \/>\r\n<br \/>\r\nMoreover, this tool can help them publish their work directly to Apple's App Store, without a publisher intervention, further democratizing distribution channels.","short_description":"Can comics survive a digital-only world?\r\n<br \/>\r\n<br \/>\r\nComics is a quintessential art that is relevant now more than ever. But we're living in a increasingly digital world where the print medium is slowly fading. It's my desire to help comics fully embrace digital and mobile as platforms for finding new audiences and keep telling great stories.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnail-1.png","title":"thumbnail","alt":"The Future of Comics","caption":"The Future of Comics"},"topics":[{"name":"Narrative","slug":"narrative"},{"name":"Tool\\Service","slug":"toolservice"}]},{"student_id":"6","student_name":"Dimosthenis Markopoulos","student_slug":"dimosthenis-markopoulos","advisor_id":"114","project_title":"PoolBuddy","project_question":"Imagine being able to understand and play pool like the pros do. In order to achieve the highest level of pool status a lot of practice has to come into play. And by practicing we don’t just say to hit balls and expect to get better just by doing so. \r\n<br \/>\r\n<br \/>\r\nEffective practice is something that most people don’t understand when they are out there trying to shoot balls on their own and hoping to get better over the next days. There are some vital steps a player needs to follow and understand. <i>PoolBuddy<\/i> will help establish these steps offering an instructional training software designed for all skill levels that will help players with their practice drills and understanding of each shots and their strategy behind them. <i>PoolBuddy<\/i> will be projected mapped into any pool table desired and could be very easily being navigated using the App included. \r\n<br \/>\r\n<br \/>\r\nSeveral additional  options will be available which will include: shot replay, timer, challenges, personal records. By having drills designed or taken directly from pros all around, the level of information would be enormous and will help make players establish the proper mindset when tackling a pool table. ","short_description":"A billiards instructional training software that will be projected mapped on the pool table and will help players excel their skills, get feedback and maximize self-practicing procedure.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/Asset-4.png","title":"Asset 4","alt":"0","caption":""},"topics":[{"name":"Education","slug":"education"},{"name":"Tool\\Service","slug":"toolservice"}]},{"student_id":"24","student_name":"Dominic Barrett","student_slug":"dominic-barrett","advisor_id":"123","project_title":"Going Forward","project_question":"<i>Going Forward: A Recipe Book for the Continuing Creative Technologist<\/i> is a tutorial book serving artists who have started making with technology. Not a beginners guide, nor for in depth advanced concepts, <i>Going Forward<\/i> positions itself as the second book, or what you do after your first class.\r\n<br \/>\r\n<br \/>\r\nYet as you continue to read, the lessons become strange. Projects become unusual, and code comments begin to fill with short stories. More and more, the technical lessons mutate into the poetic. Further and further the transformation takes place, until the reader realizes that this is anything but the normal programming tutorial.\r\n<br \/>\r\n<br \/>\r\nIt is common for those starting to program in hopes of making art to have doubts in their abilities. Despite completing introductory courses, they insist they still aren’t “real programmers”. Their beginner skills make achieving sophisticated output feel miles away. Console errors that plague them for days are fixed by “better” programmers in minutes. Impostor syndrome runs rampant. Motivation is sapped by obscure and idiosyncratic platform bugs, broken drivers, and unrequested operating system updates.\r\n<br \/>\r\n<br \/>\r\nThis is not fertile ground for newcomers, let alone artists.\r\n<br \/>\r\n<br \/>\r\nIt is enough to make any sensible person want to quit. These common, and reasonable emotions stand in the way of programmers making programs. Which to me, is a programming problem. An emotional one. How do we solve it?\r\n<br \/>\r\n<br \/>\r\nWhile development as a creative technologist does require more advanced technical and programming skill, a different kind of lesson is simultaneously required. It needs to be something that lets people know that these struggles aren’t uncommon. And not just for beginners, but for professionals. The experts are on Stack Overflow. Your favorite artist is in the forums, describing a bug that can’t be replicated by anyone but them.\r\n<br \/>\r\n<br \/>\r\nThe lesson of <i>Going Forward<\/i> is a depiction of our creative technologist culture. It’s a story about our ups and downs. How our technology isn’t a hurdle, but where our art happens. A reminder that we put ourselves in our art. And when things finally work, against all odds, the magic at the other end is worth it.","short_description":"<i>Going Forward<\/i> is a tutorial book for the continuing creative technologist. Yet as it progresses, it strays from instruction and reveals itself as something unexpected. Technical transforms into narrative. The story: the real life of creative technologists, and the struggles of making art with technology.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/plug_tongue_320x240.jpg","title":"plug_tongue_320x240","alt":"Power cable close to a tongue","caption":"Going Forward Thumbnail"},"topics":[{"name":"Education","slug":"education"},{"name":"Narrative","slug":"narrative"}]},{"student_id":"97","student_name":"Dong Chan Kim","student_slug":"dong-chan-kim","advisor_id":"131","project_title":"The Son&#8217;s Drawer","project_question":"In virtual reality, my father is invited to my home in New York where he's never visited in person. He looks around the son's living room, which is hand-painted. Some of the things in there are distinguished from the surroundings because they're 3D scanned and colored. These objects are specifically associated with the memories from my personal history. \r\n<br \/>\r\n<br \/>\r\nWhen he touches or grab one of these, the story begins with my narration and the sketches are drawn around the object. After he puts all the things to the drawer, a photography pops up. It is the photo of him when he was in the hospital. And the experience ends with my message saying that I hope I can collect more memories with him in the future.\r\n<br \/>\r\n<br \/>\r\nThis project is to get my father who underwent cancer surgery last year to take care of himself. The way I chose to do it is a story. Because I believe that story can change one’s behavior.\r\n<br \/>\r\n<br \/>\r\nI have a drawer of my little things from last 20 years. They may be nothing special to look at, but for me, each one is a treasure with a precious story on it. By telling my father about these stories, I want to remind him that he has a family that cares about his health more than he does. And I expect this experience will inspire him.\r\n<br \/>\r\n<br \/>\r\nSince I'm in New York and my father is in Seoul, it's hard to demonstrate the actual things. Also, it can also be hard to focus on because it starts with small, nothing-special objects. So I chose virtual reality. Since it uses HMD (Head-Mounted Display), which blocks outside interference. I think it will help my father become more absorbed in the story.","short_description":"<i>The Son’s Drawer<\/i> uses immersive technology in order to tell the story of the artist’s bond with his father. It was created in response to his father’s recent illness and intends to communicate to his father the importance of his ongoing health to his family.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/key-image_320x240.jpg","title":"key image_320x240","alt":"Main image of the project","caption":""},"topics":[{"name":"Narrative","slug":"narrative"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"25","student_name":"Dror Dov Ayalon","student_slug":"dror-dov-ayalon","advisor_id":"123","project_title":"Soundscape: a Tool for Music Makers","project_question":"Soundscape is an online platform that allows music lovers to record loops, and sync them with music by other people around the world. \r\n<br \/>\r\n<br \/>\r\nUsing Music Information Retrieval (MIR) algorithms and RNN models, \r\nSoundscape analyzes users’ music recordings and finds music loops, that were recorded by other users and fit well together. Then, Soundscape syncs these loops and mixes them automatically. This process could be done repeatedly to create robust sounds and interesting patterns. \r\n<br \/>\r\n<br \/>\r\nEvery loop on Soundscape is free, open source, and available for everyone to use, mix, jam and have fun with! \r\n<br \/>\r\n<br \/>\r\nSoundscape's mission is to liberate music from its common usage, such as performance art, entertainment or as a design tool.\u2028\r\n<br \/>\r\n<br \/>\r\nSoundscape's goal is to let those people who believe in this mission to feel connected in a way that will allow them to stay intimate with their music, but never ever alone. \r\n<br \/>\r\n<br \/>\r\nMusic and sound can (and should) be enjoyable as a purposeless act, or as a free jam, that is formed by the 'vibes' of the community, by the sound of the room, or by the randomness of an algorithm.","short_description":"<i>Soundscape<\/i> is a smart looping tool that automatically syncs your loops with music by other people around the world. It allows music lovers to experience sound and music patterns, while discovering music by other people, like yourself. The results are always surprising.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/card-copy-1.png","title":"Soundscape","alt":"Soundscape","caption":"Soundscape"},"topics":[{"name":"Machine Learning","slug":"machine-learning"},{"name":"Sound","slug":"sound"}]},{"student_id":"98","student_name":"Elizabeth White","student_slug":"elizabeth-white","advisor_id":"131","project_title":"Body Lights","project_question":"<i>\"That you make visible, what, without you, would never have been seen.\" -Red Burns<\/i>\r\n<br \/>\r\n<br \/>\r\nThis series is a tribute to the body as a complex organism and a universe of delicacy and energetic travel. It is believed by many energy workers that there are subtle energies of the body that are too high or low in frequency to be easily measured, yet still produce a profound impact on our moment-to-moment experiences. In <i>The Subtle Body; an Encyclopedia of your Energetic Anatomy<\/i>, it is stated that “underlying physical reality are subtle, indiscernible, energies that create and sustain all matter. They are the structures of energies that underpin our physical bodies. If we look beneath the surface of the world—the world that includes our clothes, toaster ovens, philosophies, our flesh—we will discover a universe of swirling and subtle energies.”\r\n<br \/>\r\n<br \/>\r\nWith time, I have come to understand my body not just as an undesired shape, but rather a very sensitive terrain of mercurial subtle energies. I have grown a new appreciation for the world inside of it. The world of the unexpressed and the expressed: stories untold, relationships unresolved, memories buried deep within, oscillating pains and pleasures, questions and conflicts that lapse themselves with time.\r\n<br \/>\r\n<br \/>\r\n<i>Body Lights<\/i> is a respect for and a celebration of the body and all it’s wonder. It is my attempt at a new focus and perspective on my physical form, through color, light and open-mindedness. One where the body’s curvature is accentuated instead of loathed and tucked away. It is an empowerment of the body. A mental recontextualizing. A new conversation. A new personal relationship. One of love and respect. It is an apology, for all that I’ve put it through. It is forgiveness, it is an understanding that it is still not totally liberated from the dark places of my mind, but one step closer.","short_description":"The body is a complex organism with an underlying infrastructure of subtle energies, untold stories, unresolved experiences, buried memories, oscillating pains and pleasures, questions and conflicts that lapse themselves with time. How can light, technology and physical movement be used to capture and amplify sensations of these mercurial energies and visualize the subtle realities that underpin our physical bodies?","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/BodyLightsThumbnail.jpg","title":"BodyLightsThumbnail","alt":"me","caption":""},"topics":[{"name":"Identity","slug":"identity"},{"name":"Performance","slug":"performance"}]},{"student_id":"61","student_name":"Ellen Kim","student_slug":"ellen-kim","advisor_id":"124","project_title":"At Home","project_question":"Many people today have smart home devices. Some even interact with their devices more than they interact with other people. My project addresses the question, \"What would it be like if these devices could provide more than information such as the weather, shopping assistance, and entertainment on-demand? What if it were possible to create a device that could collect voice statements that a user makes to smart devices, observe the user's daily patterns, and analyze their emotional state?” \r\n<br \/>\r\n<br \/>\r\nIf devices could analyze the way users interact with them and users' emotional states, users could monitor their emotional health and acquire deeper knowledge of themselves. Allowing users to gain a better understanding of how they are feeling could help them make better decisions. \r\n<br \/>\r\n<br \/>\r\n\"At Home\" is a sentiment-journaling device that helps monitor the emotions expressed in a user's interactions with smart home devices. It is valuable to monitor these interactions because people's interactions with devices are sometimes more revealing than their interactions with other people. Through data visualization, users will be able to track the range of emotions they exhibit during the day while interacting with their home monitoring devices. Also, a larger goal for the future is for smart home devices to better assess your mood better and to have the ability to adjust their behaviors along with other IoT devices based on your mood.","short_description":"What if a smart home device could support people emotionally by providing feedback like friends and family do when they are around?","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnail-13.jpg","title":"thumbnail","alt":"thumbnail","caption":""},"topics":[{"name":"Data","slug":"data"},{"name":"Tool\\Service","slug":"toolservice"}]},{"student_id":"7","student_name":"Grau Puche Recarens","student_slug":"grau-puche-recarens","advisor_id":"114","project_title":"lligam","project_question":"The main thread of this project is the desire to break out of screen-based interactions. Wanting to go away from a visual-feedback-only world, and building something engaging that comes through touch. [ʎigam] is not about finding a solution but going away from the norm and making something weird through an exploration of physical interaction. And that relies on screen just as an accessory or an intensifier.\r\n\r\nThis experimentation had various parameters decided a priori as it had to have a clear end goal making sure something came out of this. The resulting device would be a game composed of two different items; a physical controller, and a digital game. The control was built first and is the main element and platform for the digital game. The video game is linked directly to the controller and only makes sense with it. The reasoning for these parameters besides personal ones is the fact that games are a great exemplifier of good, and bad interaction *building.*\r\n\r\nAll these contributing factors have coalesced into the creation of CCR (CatCat Revolution). An arcade-style game where the player has to pet a cat according to their picky request and try to make them happy (no one is sure if it is even possible)","short_description":"Most video games are built on top of an existing platform, meaning that the main focus is what we see on the screen. <i>lligam<\/i> [ʎigam] explores the idea of building a platform as the main element, therefore, making the screen's content just a support element for the physical interaction.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/Screen-Shot-2018-04-18-at-15.05.48.png","title":"CCR, realization of lligam","alt":"the face of a cat","caption":""},"topics":[{"name":"Tangiable","slug":"tangiable"},{"name":"UX\\UI","slug":"uxui"}]},{"student_id":"43","student_name":"Hayeon Hwang","student_slug":"hayeon-hwang","advisor_id":"119","project_title":"Expressive Tactile Controls","project_question":"Push buttons, sliders, switches and dials—we use such controls everyday, and yet we barely notice them. ‘Expressive Tactile Controls’ is a series of playful research experiments that ask: how could our relationship to tactile controls be augmented by giving these controls more personality? How would buttons that have a stronger, more evocative personality affect and improve our relationship with the applications they are built into? How would people react to buttons that ‘talk back?’\r\n<br \/>\r\n<br \/>\r\nThis question was approached by constructing and testing a series of experimental pushbutton prototypes able to express themselves with various tactile and kinesthetic feedback (vibration, tension, and movement), according to the user’s touch or environment. \r\n<br \/>\r\n<br \/>\r\nThe first series included controls designed to feel Stubborn, Sensitive\/Impatient, Lazy, Timid, and Spontaneous. These ‘personality-enriched’ buttons were then used to provide users with a more intuitive tactile feedback, in accordance with the application they were serving.","short_description":"What if physical controls such as buttons, dials, and sliders had more expressive personalities? How could this inform and deepen our interaction with them? <i>Expressive Tactile Controls<\/i> is a series of reactive tactile controls designed to interact with their user in a variety of ways. This is a playful investigation into pushing the limits of our controls. \r\n","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thum1.gif","title":"thum1","alt":"thum","caption":""},"topics":[{"name":"Tangiable","slug":"tangiable"},{"name":"UX\\UI","slug":"uxui"}]},{"student_id":"8","student_name":"Hayeon Kim","student_slug":"hayeon-kim","advisor_id":"114","project_title":"Droplet: an AR Experience Design System","project_question":"The goal of <i>Droplet<\/i> is to deepen our understanding of AR interface, virtual space, and application design. I designed and built a tool that allows users to manipulate AR in expanded ways. \r\n<br \/>\r\n<br \/>\r\nI started with the question how could I reduce the feeling of disconnectivity between virtual and physical world? To smooth the meeting of physical and virtual worlds, I designed several AR interactions that go beyond the mobile screen and into the environment. My goal was to provide a new experience for users to change the physical environment. \r\n<br \/>\r\n<br \/>\r\nA concept from <i>Droplet<\/i> demonstrates how augmentation can enhance a user’s engagement by employing an AR to control real object. My objective of this project is to mediate augmentation and reality by diminishing the barrier between the virtual and physical world.\r\n<br \/>\r\n<br \/>\r\nI build a set of prototyping interfaces where augmentation takes an essential role as the controller. It \"a visual controller\" works; when a droplet is given to start in a virtual space, the physical object built with neo pixels will be operated by a user's dropping motion. It is the interactable element is calling assigned states to change the physical object so that it looks gradually soaking from the virtual waterdrop. Since the idea of getting users to control intuitively is my goal, user experiences I want to create though augmentation is prominent. Next, thunder has interaction with the physical object as well. In particular, thunder is created in a virtual space shown on your device. Once a user hits it the physical object will be x-rayed to reflect the thunders at a certain level. Lastly, a pinwheel is rotating at different speed consoled by users' interactivity, it will create augmentation of flying particles.\r\n<br \/>\r\n<br \/>\r\nIt overlays augmented environment with a physical environment to interact while using this app. It enables virtual objects to be controlled at precise positions and depths. As a virtual object composed of GUI appears in mid-air shown on their mobile screen, the user can change the physical object. Users thereby enjoy the interaction with the physical environment using a virtual object.","short_description":"<i>Droplet<\/i> is an experimental system for designing intuitive, natural interfaces for AR applications. It consists of a series of prototypes aimed at demonstrating how a fluid connection can be achieved between a user, physical environment, and virtual space, through tactile, visual-based on-screen manipulation of networked objects.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnail-4.png","title":"droplet","alt":"title","caption":""},"topics":[{"name":"UX\\UI","slug":"uxui"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"63","student_name":"Jacquelyn Zen","student_slug":"jacquelyn-zen","advisor_id":"124","project_title":"Spotter","project_question":"I’m sure a lot of ladies have felt this fear before: you are sitting in class when suddenly, Aunt Flo makes a surprise visit. A lot of people in this situation are ready, however, some people are not so prepared.\r\n<br \/>\r\n<br \/>\r\nDo you struggle with the tampon machine in the bathroom only to find that it’s empty? Do you run to the pharmacy a few blocks away? What if you are in the middle of nowhere and cannot find help?\r\n<br \/>\r\n<br \/>\r\nThe usual solution is to find another woman and discreetly ask for a tampon. The common experience amongst women is that there is a built-in community where we are more than happy to help one another in these times of need. However, it is not so easy to find help in the STEM field where the majority of your colleagues are male.\r\n<br \/>\r\n<br \/>\r\nIn comes <i>Spotter<\/i>, an app that can help you locate other women around you who can offer you help. The idea is simple: when you are in need of a tampon, you can send an emergency signal from your phone, and it notifies other women in your vicinity that you are in need of help.","short_description":"<i>Spotter<\/i> is an app that allows women to send an emergency signal from their phone to other women in their vicinity when they are in need of a tampon.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/mockup2.jpg","title":"Spotter Thumbnail","alt":"Spotter Thumbnail","caption":""},"topics":[{"name":"Tool\\Service","slug":"toolservice"},{"name":"UX\\UI","slug":"uxui"}]},{"student_id":"80","student_name":"Jarrett C Slavin","student_slug":"jarrett-c-slavin","advisor_id":"129","project_title":"Spectrum","project_question":"What does life look like through the bipolar lens?\r\n<br \/>\r\n<br \/>\r\nSpectrum is a mobile audio app that places the user in the shoes of a bipolar mind through various situations &amp; thoughts.  The user adjust a slider to hear three different perspectives, (depressed, baseline, and manic) on the same subjects, from the same mind experiencing different mood states.  \r\n<br \/>\r\n<br \/>\r\nThis version of 'Spectrum' is comprised entirely of my own personal thoughts, re-living various events in specific situations through each of the 3 primary lenses of the bipolar spectrum.\r\n<br \/>\r\n<br \/>\r\n'Spectrum' serves as a prototype that could eventually expand to include the thoughts of several different bipolar individuals. For now, for the sake of focus and scale, I choose to focus on expressing my own personal perspective.\r\n<br \/>\r\n<br \/>\r\nFor anyone who has ever struggled to understand what it means to be bipolar, 'Spectrum' seeks to increase empathy, understanding, and communication.  Whether you are bipolar yourself, seeking to relate &amp; compare your own experience to mine, or if you are not bipolar but would like to better understand &amp; empathize with those in your life who are, 'Spectrum' offers a valuable, insightful experience.","short_description":"Can I convey the bipolar experience in a way that is immersive, authentic, and effective? Can I increase empathy &amp; understanding for this perspective and its difficulties?","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/spectrumThumbnail.jpg","title":"spectrumThumbnail","alt":"thumbnail","caption":""},"topics":[{"name":"Health","slug":"health"},{"name":"Identity","slug":"identity"}]},{"student_id":"99","student_name":"Jasmine A Soltani","student_slug":"jasmine-a-soltani","advisor_id":"131","project_title":"Manifest Energy","project_question":"The lifecycle of a product includes the mining and processing of natural resources, manufacturing, transport, product delivery, use, and its reuse, recycling or disposal. Embodied energy is the energy consumed by all of the processes associated with production: the life-cycle up until the use phase. <i>Manifest Energy<\/i> is a series of lenticular stickers, a mechanical animation, and website that illustrate the life-cycle and embodied energy of digital devices. \r\n<br \/>\r\n<br \/>\r\nElectronics are unique in that they have exceedingly high embodied energy, exacerbated by planned obsolescence, their difficulty to repair, lack of supply chain accountability, and the increasing ubiquity of computing. The energy economy, on which the ecologically destructive digital economy is based, is unsustainable in itself. Can illuminating the resource demand of our digital devices change our consumption habits, our relationship with our devices, the way we design and legislate their use, and handle end-of-life?\r\n<br \/>\r\n<br \/>\r\nIn addition to shifting the paradigm by which we think about energy consumption, I hope my project informs people of actions that can be taken. By extending the lives of our products through repair, we can reduce demand for new items. By developing more modular electronics, we can make these devices easier to repair. By putting pressure on companies and legislators, we can achieve greater supply chain transparency and improve the health of people working on or near production sites. By developing renewable energy sources and eliminating carbon emissions, we can mitigate the ecological impact of the production of digital technologies.","short_description":"A series of artifacts that explore the limitations and opportunities for ecologically sustainable computing, with a focus on the energy consumed in the production of our digital devices.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnailV5.jpg","title":"thumbnailV5","alt":"earth and phone","caption":""},"topics":[{"name":"Data","slug":"data"},{"name":"Society","slug":"society"}]},{"student_id":"81","student_name":"Jaycee Holmes","student_slug":"jaycee-holmes","advisor_id":"129","project_title":"Nigga Inventions","project_question":"Racism exists in New York City.  \r\n<br \/>\r\n<br \/>\r\nA ‘Nigga Invention’ is a colloquialism for a work-around; a method for overcoming a difficult problem. In the context of this thesis, the problem is racism. The <i>Nigga Inventions<\/i> toolkit focuses on the survival of the black creative community in New York City from the exhaustion and distraction that is racism. \r\n<br \/>\r\n<br \/>\r\nThis thesis is a result of a continuing exploration into understanding what utopia means for marginalized communities. In an age of racist\/ ableist\/ transphobic\/ heteronormative\/ patriarchal\/ capitalist\/ xenophobic\/ environmentally unjust\/ religiously intolerant\/ political leadership, I wanted to map the obstacles that prevent utopia from existing for vulnerable populations in the United States. Following a human-centered design process, the <i>Nigga Inventions<\/i> toolkit proposes a series of interventions for these obstacles. This thesis research is my own attempt at preventing erasure and creating utopia. ","short_description":"<i>Nigga Inventions<\/i> is a survival toolkit for the black community: a series of screen-based tools that focus on community, education, and access to reparations. ","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnail-9-1024x773.png","title":"thumbnail","alt":"Nigga Inventions.","caption":""},"topics":[{"name":"Culture","slug":"culture"},{"name":"UX\\UI","slug":"uxui"}]},{"student_id":"101","student_name":"Jeffrey Park","student_slug":"jeffrey-park","advisor_id":"131","project_title":"Responsibly.me","project_question":"Responsibly.me is a web platform for consumers to make more socially responsible purchasing decisions. Responsibly.me aggregates existing rankings on a company’s Corporate Social Responsibility initiatives and recommends similar products from brands with higher grades. Responsibly.me also provides a dashboard for users to understand their social responsibility values and purchasing habits in order to encourage them to shop more consciously.\r\n<br \/>\r\n<br \/>\r\nIn this current climate where we face a growing number of wicked problems, both the public and private sector need to do more to create a better world for all of us. According to the 2017 Cone Communications CSR study, 63% of Americans are hopeful businesses will take the lead to drive social and environmental change moving forward. This number increases to 71% for millennials and younger generations. However, only 39% of consumers “researched a company’s business practices or support of social and environmental issues” (2017 Cone Communications CSR study). The majority of users simply are not aware of the efforts corporations take to tackle these social issues and make their businesses more socially responsible.\r\n<br \/>\r\n<br \/>\r\nResponsibly.me aims to make these efforts more transparent and easier to access for regular consumers. I have collected data on 50 of the top 100 brands according to Forbes and have built a web extension in which users can learn about a brand’s social responsibility rankings. I have also created design wireframes for product recommendations and the user dashboard to get an idea of where I hope to take this project.","short_description":"A web platform for consumers to make more informed choices based on a company’s initiatives on sustainability, environmental health, and fairness in the workplace. Armed with this information, consumers can use their buying power to influence the Corporate Social Responsibility of companies.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/ext-min-thumb.png","title":"extension-minimized","alt":"The Responsibly.me Extension","caption":"At a glance, learn how the brand you're shopping at is doing and learn how their competitors are doing."},"topics":[{"name":"Society","slug":"society"},{"name":"Tool\\Service","slug":"toolservice"}]},{"student_id":"26","student_name":"Jennifer G Tis","student_slug":"jennifer-g-tis","advisor_id":"123","project_title":"In Their Steps","project_question":"<i>In Their Steps<\/i> is a concept for a mobile app bringing users on a guided audio walking tour of the women’s suffrage movement that took place in New York City in the early 1900s. Following the same path suffragists often marched during their popular parades, users walk in the footsteps of the individuals who fought for women’s right to vote while learning about the suffrage movement and the women who led it. \r\n<br \/>\r\n<br \/>\r\nWhile <i>In Their Steps<\/i> is focused on exploring the past, it also makes connections to the present, particularly the Women’s Marches of the past two years. My hope is that people who are interested in the recent marches can use In Their Steps to learn about women from the past who engaged in similar acts of protest, find connections with women who marched years ago, and find inspiration to continue fighting for women’s rights. \r\n<br \/>\r\n<br \/>\r\nI’m interested in creating experiences that help us uncover the past in interesting and engaging ways, and my goal is that <i>In Their Steps<\/i> does that for people who are curious to learn about the history of women’s rights in New York City. ","short_description":"A walking tour app exploring the history of New York City’s women’s suffrage movement and its connections to today’s Women’s Marches. The app takes users along the same route suffragists marched, as they listen to stories, discover landmarks, and view historical images using augmented reality.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thesisarchivethumbnail.jpg","title":"thesisarchivethumbnail","alt":"iPhone app displaying ahistorical image with New York City's Washington Square Park in the background","caption":""},"topics":[{"name":"Society","slug":"society"},{"name":"UX\\UI","slug":"uxui"}]},{"student_id":"10","student_name":"Jenny Lim","student_slug":"jenny-lim","advisor_id":"114","project_title":"Awkward Thanksgiving","project_question":"I’ve recently noticed myself censoring my speech out of fear: fear of seeming ignorant, bigoted or worse. While I think it’s important to watch one’s words out of sensitivity and respect for others, I believe that self-censorship due to fear hinders discourse. For my thesis, I wanted to make a game that creates a safe space for people to discuss politics. \r\n<br \/>\r\n<br \/>\r\nIn Awkward Thanksgiving, players begin by adopting an ideology: libertarian, progressive, socialist, etc. This is the ideology that they must represent throughout the game. Some players choose ideologies because it’s fun to pretend to be on the other side. Others choose ideologies because it gives them the freedom to express opinions that their friends may not share.\r\n<br \/>\r\n<br \/>\r\nThe mechanics of the game force players to think beyond their initial stereotypes of their ideologies. Players must use Argument cards when they discuss a topic, and often players will find themselves with Argument cards that do not perfectly align with the “party line.” According to one player, “It’s fun to puzzle out, ‘How am I going to use this card?’ Making arguments that buck stereotype is really nice.”\r\n<br \/>\r\n<br \/>\r\nThe trickiest part of making a “serious” game is making it fun. It doesn’t matter how important a game’s mission is; if it’s not fun, no one will play it. Awkward Thanksgiving provides two kinds of fun: the relief of saying the unsayable, and the joy of improvising family history. During one playtest, two friends playing a divorced couple began bickering over a stolen lawnmower. The exchange provided some relief to a fairly serious discussion on Universal Basic Income.\r\n<br \/>\r\n<br \/>\r\nAwkward Thanksgiving has gone through 6 distinct iterations since mid-February. I’ve run over 12 playtests, with 4-8 players each time. The game is both fun and thought-provoking. I will continue to develop it after graduation.","short_description":"Can games change the way people think about complex issues? For my thesis, I developed a game called <i>Awkward Thanksgiving<\/i>, a roleplaying card game that creates a safe (and fun!) space for people to discuss political and social issues.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/TurkeyThumb_color.png","title":"Turkey_thumbnail","alt":"Turkey Is Not Happy","caption":""},"topics":[{"name":"Play","slug":"play"},{"name":"Society","slug":"society"}]},{"student_id":"44","student_name":"Jesal Trivedi","student_slug":"jesal-trivedi","advisor_id":"119","project_title":"Mindful Technology: Aduri","project_question":"<i>Aduri<\/i> is a technology company on a mission to make the world happier, healthier and more mindful. My work covers the progress of my tech startup, <i>Aduri<\/i>, which I have been working on since the first semester of ITP.","short_description":"How can technology be used to amplify mindfulness and positive well-being?\r\n\r\n","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/ITP-Thesis-Thumbnail.png","title":"ITP Thesis Thumbnail","alt":"meditation","caption":"meditation"},"topics":[{"name":"Health","slug":"health"},{"name":"UX\\UI","slug":"uxui"}]},{"student_id":"100","student_name":"Ji Young Chun","student_slug":"ji-young-chun","advisor_id":"131","project_title":"Semper Simul","project_question":"<i>Semper Simul<\/i>, a real-time multi-user webVR experience, is my artistic approach to use current technologies to shorten the physical and emotional gap of my family, who are separated by long distance. I hope my family can use this technology to spend more time together and feel connected. \r\n<br \/>\r\n<br \/>\r\nSince I came to United States to study when I was 17, I have been living far away from my loving family in my home country, South Korea. My sister also left Korea shortly after. I miss my childhood when my family always stayed together under one roof, and enjoyed meals together everyday. \r\n<br \/>\r\n<br \/>\r\nHow can I recreate this feeling of togetherness with my family? According to a study, eating with one’s family is important because it not only helps the family to be mentally healthy but also makes them stay together. \r\n<br \/>\r\n<br \/>\r\nI believe that eating together is the most basic and meaningful family ritual that makes the family emotionally connected. What if my family can eat with each other everyday with the help of an immersive communication platform I create? To explore some possibilities, I made a webVR experience, where users can experience dining with other users by being immersed in a 3D scene, created with real-time depth footages of all of the participating users’ eating moments. \r\n<br \/>\r\n<br \/>\r\nThe users will feel like they are eating at one shared table in one shared virtual space by witnessing all of the participants’ dishes on one table and interacting with each other with their gazes and gestures. The 3D footages are captured with the Kinect depth camera, the real-time communication is executed through WebRTC (a javascript API for real-time web communication), and the whole scene is built in three.js (a 3D javascript library). Ultimately, I hope my family will be able to connect with each other more by sharing these eating rituals over long distance, because life is too short and I want to share more memories with my family even when we are apart.","short_description":"How can technology help my family emotionally connect when are separated by a great physical distance?\r\n<i>Semper Simul<\/i>, meaning ‘always together,’ is a real-time multi-user webVR experience to assist my physically separated family in creating an environment of togetherness by giving a feeling of eating together in one shared space.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thmb-e1524291318103.png","title":"Semper Simul","alt":"Semper Simul","caption":"Semper Simul"},"topics":[{"name":"Culture","slug":"culture"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"9","student_name":"Jina Jung","student_slug":"jina-jung","advisor_id":"114","project_title":"Intangible Canvas","project_question":"Fragmentary Landscape is an experiment with the realm between new technology and traditional materials, combining both genres of work. Paralleling the way rays of light are untouchable in the physical world, this project focuses on the relationship between real and imaginary figures in an immersive natural environment. My real life paintings of nature are converted into a virtual space so people can experience my paintings in VR.   \r\n<br \/>\r\n<br \/>\r\nFurthermore, this project also focuses on questions of how the artist applied VR with traditional paintings or drawings as well as how their observation changes depending on the medium. It aims to create landscapes with different dimensions(2D&amp;3D) which are situated on real and virtual canvases.  Based on my artistic approach, and experiences with nature, I could explore new perspectives while creating landscapes and characteristics of elements and landscapes in a virtual environment.\r\n<br \/>\r\n<br \/>\r\nThe project consists of 3 methods – Drawings, titled ‘Fragments -  Intangible Objects’, Paintings, titled ‘Fragmentary forest’, and VR, titled ’Beyond forest’.  Handling these three different forms provides audiences the chance to fully immerse themselves and engage completely in the world that the artist has visualized. \t","short_description":"This project focuses on questions of how the artist can adapt VR with traditional paintings or drawings as well as how their observations change with different media. We question how we can define art using our experiences as artists and how we can manifest VR into a new artistic genre. The project combines various techniques and manifests the artist’s vision of a new experimental arena.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/Thumbnail.jpg","title":"Thumbnail","alt":"Jina001","caption":""},"topics":[{"name":"Installation","slug":"installation"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"27","student_name":"Jingfei Lin","student_slug":"jingfei-lin","advisor_id":"123","project_title":"Runway in Store","project_question":"The retail industry is undergoing a major transformation as e-commerce disrupts traditional brick-and-mortar store models and gives rise to new modes of “experiential retail.” By creating a more immersive retail experience, retailers can drive people towards their stores and ensure they leave not just with your products but also memories. Runway in store explores how technology can enhance the retail experience, and especially adopts Augmented Reality to provide shoppers the experiences that engage, inform and entertain. \r\n<br \/>\r\n<br \/>\r\nRunway in store is a physical playground that encourages customers in the retail store to move around and interact with the augmented visuals that are projected on the wall or an LED screen, where a Kinect v2 is used to capture the real-time the human image and drive a real-time movement of a 3D character in Unity. By choosing Nike as the brand, the AR installation tracks human motions with multiplayer features and metaphorical explorations of the augmented 3D visuals.\r\n<br \/>\r\n<br \/>\r\nCustomers then could save and share the looks to social media, so that the brand can employ social media as a means of reaching out and connecting with potential customers.","short_description":"<i> Runway in Store<\/i>  is a projection-based Augmented Reality photo booth installation designed for Nike retail store. It explores the future of retail experience using AR with Kinect that gives shoppers compelling new interactive experiences. ","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/THUMBNAIL.jpg","title":"Runway in store","alt":"Runway in store","caption":""},"topics":[{"name":"Installation","slug":"installation"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"45","student_name":"Jingru Yin","student_slug":"jingru-yin","advisor_id":"119","project_title":"I&#8217;m With Mr. Zhou","project_question":"This is a dream interpretation VR installation experience. It’s around 6 minutes long. One person per round. The audience will be invited by a doctor to participate in dream research. Then lie on a bed to into the virtual world. During the “dreaming,” the audience will have different experiences based on his\/her choices and interactions. In the end, the doctor will give the audience a printed paper tells about his\/her dream interpretation.","short_description":"How to recreate and share my perception of light, space, and fantasy?","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnail-10.jpg","title":"thumbnail","alt":"thumbnail","caption":""},"topics":[{"name":"Performance","slug":"performance"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"62","student_name":"Jinhee Ahn","student_slug":"jinhee-ahn","advisor_id":"124","project_title":"textARt","project_question":"The state of UI\/UX design in virtual worlds is still evolving. The use of typography and text is a prime example of this. At the moment, text elements in virtual worlds for the most part still follow the design conventions developed for 2D environments, such as print or flat web pages, rather than taking into account the more dimensional and experiential characteristics of 3D environments. I have been curious to explore new ways to visualize text in virtual spaces that move beyond traditional 2D graphic design. \r\n<br \/>\r\n<br \/>\r\nFor my thesis project I have experimented with ways to make text come alive with AR by creating more animated and dimensional text examples in the process of learning simple verbs in a new language. For example, the word ‘SPIN’ could be visualized by displaying a spinning animation of the word, or the letters that make up the word, with related environmental elements that help provide a context for the spinning action.","short_description":"My thesis question is how can text be better visualized to more fully take advantage of the dimensionality made possible in virtual spaces. I have been curious to explore new ways to visualize text in virtual spaces that move beyond traditional 2D graphic design.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnail-7.jpg","title":"thumbnail","alt":"textARt","caption":""},"topics":[{"name":"Education","slug":"education"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"11","student_name":"Jixuan Sun","student_slug":"jixuan-sun","advisor_id":"114","project_title":"Xiangrui: Patterns at the Palace Museum","project_question":"With rapidly changing technologies, how can we find a better way to get the most of information, explore hidden context and stories behind museum exhibits, and maximize the experience? How can we connect with millions of artifacts during the limited visiting hours? \r\n<br \/>\r\n<br \/>\r\nMy thesis project is based on exploring and building a cutting-edge Augmented Reality mobile application. The focus here is to reveal and present the meaning of iconic symbols and the series of antique collections in the Beijing Palace Museum. The purpose of my thesis is to result in a better understanding of how those symbols exist in the history of Chinese high culture, the content of storytelling is from the research of Chinese mythology and idiom.\r\n<br \/>\r\n<br \/>\r\nThe museum's collection of more than 1.8 million items will take hundreds of years to exhibit to the public entirely. There are numerous of mysterious patterns existing in every aspect of the space. Jade ware, textile patterns, furniture, architectures, paintings, etc. Some of them have the abstract shapes that needed to be carefully distinguished by archaeologists. But there are seldom accessible applications on the market that interpret the meaning and tell the story to the public. How to best use your limited visiting hours in the vast museum and find hidden beauty without the need for guides? For me, an AR experience is the most friendly and exciting way to explore the historical place when you walk around with curiosity. ","short_description":"How to use cutting-edge 3D digital media and technology to interpret and communicate the importance and value of contemporary Chinese culture, and maximize the museum experience?","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thesis-thumbnail.png","title":"thesis thumbnail","alt":"XIANGRUI – Auspicious Symbols in the Palace Museum","caption":""},"topics":[{"name":"Machine Learning","slug":"machine-learning"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"83","student_name":"Kar Rosen","student_slug":"kar-rosen","advisor_id":"129","project_title":"The Quantum Carnival","project_question":"Step right up, and enter the Quantum Carnival!\r\n<br \/>\r\n<br \/>\r\nQuantum Carnival is a proposal for a museum exhibition that  presents key principles of quantum physics in the form of a carnival sideshow performance.\r\n<br \/>\r\n<br \/>\r\nConcepts like Schrödinger’s Cat experiment, the double slit experiment, relativity, Heisenberg’s principle of uncertainty, multiverse theory\/butterfly effect, probability, and others are shown as sideshow acts or staged as carnival games.\r\n<br \/>\r\n<br \/>\r\nA central goal of this project is to cut through the widespread perception that  quantum physics is too complex for most people to understand, by offering an introduction to this important and fascinating scientific field in an engaging and playful way.\r\n<br \/>\r\n<br \/>\r\nThe smoke-and-mirror aesthetics of turn-of-the century fairgrounds is well-suited to explaining principles of quantum physics, due to its penchant for playfully blurring the lines of reality and uncertainty. Embracing the performative, welcoming, and down-to-earth tone that has come to define this unique part of American culture allows audiences an immediate, appealing connection to quantum physics - which, just like the sideshows that dotted the boardwalks and campgrounds of the early 20th century, is full of mind-bending wonder that can truly astound.\r\n<br \/>\r\n<br \/>\r\nMinimal Viable Product is a design booklet and a prototype of one of the interactive demonstrations: The Great Heisenberg’s Uncertainty Chest, a game where audiences are asked to guess if a light (programmed to a random state) concealed within a closed trunk is on or off. I will demonstrate the trunk but without the performative element it would have in the exhibit, where a facilitator would be there acting like a performer running the carnival game.","short_description":"A proposal for a museum exhibit that explains quantum physics principles framed as a boardwalk carnival sideshow.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thesis_archive_thumb.jpg","title":"thesis_archive_thumb","alt":"A brown wooden trunk stands before a red curtain. White light emits through the cracks of the open trunk top.","caption":""},"topics":[{"name":"Education","slug":"education"},{"name":"Play","slug":"play"}]},{"student_id":"13","student_name":"Katherine A Takacs","student_slug":"katherine-a-takacs","advisor_id":"114","project_title":"AWall","project_question":"I am going to build a wall using modules that are L-shaped. Those blocks are strategically stacked to look solid. The back of the blocks will be lined with neo-pixels. As people approach the wall, the lights will move and light is. They will become brighter in an exponential growth - so that the light permeates the wall, and shows it to be an illusion more than anything else. \r\n\r\nTo borrow Richard Serra's words, I am showing how the viewer can become the subject of their own experience in a way that allows you to connect more readily to the world around you.","short_description":"What can a physical installation do to create better understanding between people and the walls they build around themselves? Can one's presence reveal the permeability of a structure? To borrow Richard Serra's words, can the viewer become the subject of their own experience in a way that allows you to connect more readily to the world around you?","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/TakacsThumbnail.jpg","title":"TakacsThumbnail","alt":"Thumbnail","caption":"Takacs"},"topics":[{"name":"Identity","slug":"identity"},{"name":"Installation","slug":"installation"}]},{"student_id":"64","student_name":"Koji","student_slug":"koji","advisor_id":"124","project_title":"Mtindo","project_question":"What kinds of practical style transfer applications can be developed for non-technical people, such as creative professionals, that are easy to use, efficient, and push beyond the limits of what is currently possible with existing graphics tools? People think that machine learning requires a Ph.D.\/CS degree and a background in mathematics and statistics. It all sounds very complicated and difficult. \r\n<br \/>\r\n<br \/>\r\nUnfortunately, machine learning isn’t easy to learn, but using applications designed with non-technical people in mind isn’t so hard and can be a lot of fun. Style transfer, which is the technique of recomposing images in the style of other images, is one form of machine learning that has started to be made available online to the general public through simple games. \r\n<br \/>\r\n<br \/>\r\n<i>Mtindo<\/i> is a style transfer application for the desktop that offers non-technical people a unique opportunity to experience machine learning in action that explores some of the practical potentials of style transfer, beyond the game-like applications that are currently available. <i>Mtindo means style in Swahili.<\/i> ","short_description":"<i>Mtindo<\/i> is a style transfer application for the desktop that offers non-technical people a unique opportunity to experience machine learning in action that explores some of the practical potentials of style transfer, beyond the game-like applications that are currently available. <i>Mtindo<\/i> means style in Swahili.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/mtindo_journal_thumbnail.png","title":"mtindo_journal_thumbnail","alt":"mtindo","caption":""},"topics":[{"name":"Machine Learning","slug":"machine-learning"},{"name":"Tool\\Service","slug":"toolservice"}]},{"student_id":"12","student_name":"Kyung A Na","student_slug":"kyung-a-na","advisor_id":"114","project_title":"Synesthesia","project_question":"Have you ever been to a concert in a big park, like Central Park? Have you experienced music in a large outdoor venue? These are questions of interest to me, so I chose to focus on them in my thesis. Augmented reality (AR) is a way to experience music and visuals in a new way. \r\n<br \/>\r\n<br \/>\r\nNowadays, AR is a very popular topic in the technology industry, a reason why I have been imaging everything in a world tagged by AR. Furthermore, I imagine AR visual effect with music will bring new sensation and unique experience to people. Therefore, I decided to create a music visualization hololens application by using AR effect called <i>Synesthesia<\/i>. This application enables the AR visual effect synchronized with audio rhythm. AR is the most advanced visual effect and flexible in reality. Through hololens, people can feel themselves immersing into reality compared to just looking at a small screen of smart phones. \r\n<br \/>\r\n<br \/>\r\nMoreover, I imagine that people will use smart glasses than smart phone. I believe that if people could listen to music with synchronized visual effect, they can get a more advanced level of inspirations. Adding onto my theory is the location of this application. \r\n<br \/>\r\n<br \/>\r\nI decided on Bryant Park as it has a rectangular shape and is surrounded by the graphical buildings. Combining reality with the nature and AR effect, people can feel the surrealism when listening to music. ","short_description":"<i>Synesthesia<\/i> is a music visualization hololens application that will be used in Bryant Park. Hololens provides sound, space, and space depth with visual effect in reality. These features utilize the mixed reality visualization with sound which translates into audio music visualizer. ","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbsupArtboard-1.jpg","title":"thumbsnail","alt":"hmhm","caption":""},"topics":[{"name":"UX\\UI","slug":"uxui"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"104","student_name":"Laura Kerry","student_slug":"laura-kerry","advisor_id":"131","project_title":"Beachcomber","project_question":"<i>Beachcomber<\/i> is an interactive storytelling experience premised on the idea that the things humans consume and cast aside tell the most vibrant stories about us and the places and times we live in. With objects found on the beach at Dead Horse Bay in Brooklyn—all bits of city trash from the 1850s to the 1950s—and a layer of technology, the installation piece transports users back to the moment in New York City history when each object was used. \r\n<br \/>\r\n<br \/>\r\nThe project invites users to choose an artifact from the collection, handle it, and place it onto a platform covered in sand. Using an NFC reader embedded in the platform and a chip on the object, the device recognizes the object and responds with its story, told through projected visuals and audio. This multimedia story environment includes historical documents, archival video, as well as recorded sound and video from Dead Horse Bay. \r\n<br \/>\r\n<br \/>\r\nDead Horse Bay offers a story about what’s discarded in New York—not only the landfill objects, but the people who lived and worked on its shores in the 1800s and those whose homes were destroyed and carted to the beach under the dictates of 1950s urban planning. By bringing history alive through tangible objects, <i>Beachcomber<\/i> aims to recover these discarded bits of New York City’s past and encourage those who live here to imagine what stories the things we consume and throw away might tell about us in the future. ","short_description":"How can technology help expose the historical and personal narratives contained within physical objects?","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnail-lk-e1524493107305.png","title":"thumbnail-lk","alt":"Shoe soles in sand","caption":""},"topics":[{"name":"Narrative","slug":"narrative"},{"name":"Society","slug":"society"}]},{"student_id":"14","student_name":"Li-Chung Chen","student_slug":"li-chung-chen","advisor_id":"114","project_title":"Iso-principle in the Digital World","project_question":"Iso-principle is “a technique by which music is matched with the mood of a client, then gradually altered to affect the desired mood state. This technique can also be used to affect physiological responses such as heart rate and blood pressure” (Davis, Gfeller, &amp; Thaut, 2008). This method has been widely adopted in the industry, however, this technique requires a certified music therapists to be present which is very expensive and not always accessible. Therefore, this project will be focusing on recreating the same experience in the digital platform. \r\n<br \/>\r\n<br \/>\r\nThe software created for this project will be collecting user’s physical data such as their motions and heart-rates, then use these data to modify the music users are listening to. Furthermore, this system can also affect user’s physiological responses. By modifying the music in certain ways, it can either increase or decrease user’s heart-rate and blood pressure to help users to achieve their desired mood state.","short_description":"This project focusing on recreating the Iso-principle in the digital platform.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/iso-principle-in-the-digital-world.jpg","title":"iso-principle in the digital world","alt":"11","caption":"thumbnail"},"topics":[{"name":"Health","slug":"health"},{"name":"Sound","slug":"sound"}]},{"student_id":"65","student_name":"Lin Yang","student_slug":"lin-yang","advisor_id":"124","project_title":"PathIndoor","project_question":"As more and more cities are being formed and skyscrapers are being built, everyone has, at some point, been lost inside a large shopping mall, struggled to find their doctor’s room at the hospital or been late to a meeting, because they couldn’t find the right conference room in huge office building. \r\n<br \/>\r\n<br \/>\r\nToday, outdoor GPS navigation apps, such as Waze and Google Maps, have been proven to be lifesavers to countless people. However, it is still quite easy for us to get lost inside large, indoor venues. To fill the gap, I created an app prototype with customized 3D venue models and inside structures based on Grand Central Station in New York City, which people can use to navigate around and search for their destination. Augmented routes are shown on screen with real-time distance information giving the most intuitive guidance to people.","short_description":"<i>PathIndoor<\/i> is an augmented reality wayfinding app that helps people navigate inside large venues with interactive 3D maps and realtime route information.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnail-2.png","title":"thumbnail","alt":"thumbnail","caption":""},"topics":[{"name":"UX\\UI","slug":"uxui"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"103","student_name":"Lindsey Daniels","student_slug":"lindsey-daniels","advisor_id":"131","project_title":"Basic Ingredients","project_question":"If everyone eats and has food habits, then food is able to be used as a shared language among all people. And in that language, everyone proceeds to reveal a lot about themselves—history, socioeconomic status, personal hang-ups, weird quirks, how they handle time, etc. \r\n<br \/>\r\n<br \/>\r\nIt happens inadvertently and without notice; we can’t help but pour ourselves into that which we (in an ideal world) do everyday. \r\n<br \/>\r\n<br \/>\r\nAnd if the self is so wrapped up in what we eat and cook, when we offer to feed others, we offer that same self to be consumed. In this way, as we have become an ingredient, we engage in an act of emotional cannibalism.  \r\n<br \/>\r\n<br \/>\r\nBut while feeding others is a nurturing and compassionate act, acts of cannibalism usually manifest as a power exchange. Where is the power in my particular exchange? Is it equal?\t\r\n<br \/>\r\n<br \/>\r\n<i>Basic Ingredients<\/i> is a sound installation and personal exercise constructed from  recordings in home kitchens and facilitated discussions around the topic of food. What do people reveal about themselves by talking me through recipes? When moving through their own kitchens? If I ask about breakfast, lazy foods, or coffee, what do they tell me outside of eggs, milk, and sugar? \r\n<br \/>\r\n<br \/>\r\nFor my thesis, I ask people about food and they proceed to tell me about everything else. \r\n<br \/>\r\n<br \/>\r\nAnd while their answers and actions seemingly all differ, even the sound of the supposed common ones (the shapes of those sounds—how to break an egg, light a stove, measure an ingredient) act as fingerprints, all distinct to the individuals and their spaces. \r\n<br \/>\r\n<br \/>\r\nIf eating is an experience of the senses, I challenged myself to channel that experience through the limited scope of sound to make an individual available to be known by others, to be consumed by others.","short_description":"What, besides food, do we offer when when we cook for others? What do we inadvertently make available of ourselves to be consumed?","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/icon1.jpg","title":"icon1","alt":"smallIcon","caption":"small icon"},"topics":[{"name":"Identity","slug":"identity"},{"name":"Sound","slug":"sound"}]},{"student_id":"46","student_name":"Lindsey Piscitell","student_slug":"lindsey-piscitell","advisor_id":"119","project_title":"Pack Your Things and Go","project_question":"Gaston Bachelard says that “We cover the universe with drawings we have lived.” But where do we leave these drawings? How are they contained? How do we unlock them and what do they mean to us when we finally see or hear them again? \r\n<br \/>\r\n<br \/>\r\nSimilarly, when we leave a place that might contain memories, do we leave part of our identity behind? And how do emotions facilitate the recursion of such memories—especially when distanced from their context? I have always been curious to see how much of our identity is rooted in place and our ability to recollect. In order to explore this linkage, I have examined cognitive perception, emotional mapping, and the psychological impact of sound frequencies in order to inform eight sound sculptures I have crafted for this installation. \r\n<br \/>\r\n<br \/>\r\nEach sculpture is a 60-second abstract narrative expression of one of eight emotions—ecstacy, vigilance, rage, loathing, grief, amazement and terror—that starts frivolously but through time amplifies. It’s buttressed by a “behavioral frequency” and sounds that have been identified in a survey to elicit its designated emotion, as well as by my own artistic interpretation. Ultimately, each sculpture is in an expression of the emotion in what I have interpreted to be its purest form.\r\n<br \/>\r\n<br \/>\r\nI have using the action of packing as a framing mechanism for the user to interact with my installation. When the user enters, they are entering a space that is in the process of being “packed up”. Through a series of visual cues they are prompted to pick up any of eight objects placed throughout the space. When each object is picked up, a sound sculpture is unleashed. When the object is put back down, it is silenced. The user is given their own “packing box” and is asked to choose up to four sound sculptures to “bring with them” when they go. Asking the user to choose their objects is an exercise in asking one to choose one’s memories. The unique combination of the overlaid sounds in the packing box is an amalgam of memory and ultimately an acknowledgement of the individual's unique identity. ","short_description":"<i>Pack Your Things and Go<\/i> is a single person immersive sound interaction that prompts the user to explore and answer questions surrounding identity, memory and time.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/8W0B7922-1-1024x768.jpg","title":"8W0B7922-1","alt":"Brass lantern and mosaic box in larger box surrounded by dried flowers.","caption":"Thumbnail"},"topics":[{"name":"Installation","slug":"installation"},{"name":"Sound","slug":"sound"}]},{"student_id":"102","student_name":"Luqian Chen","student_slug":"luqian-chen","advisor_id":"131","project_title":"Foodies","project_question":"My thesis focuses on creating a real-life community with the goal of optimizing food resources and reducing food waste. Through establishing a mobile platform, Foodies is able to ease individual’s pressure of independently changing behaviors of wasting food. Instead, it relies on food to bringing people together to create communities, and eventually achieve the goal of reducing food waste. \r\n\r\nPut it in a simple way: if there is only chicken left in my fridge while there are merely some tomatoes and cheese left in yours; instead of purchasing more ingredients, (it might lead to more food waste,) we can bring our leftover together and cook them in order to reduce all of our waste and have a good experience at the same time.","short_description":"<i>Foodies<\/i> is a social platform aimed at reducing food waste by bringing people together through food.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/320240.jpg","title":"Foodies","alt":"Foodies","caption":"Foodies"},"topics":[{"name":"Society","slug":"society"},{"name":"UX\\UI","slug":"uxui"}]},{"student_id":"66","student_name":"Manning Qu","student_slug":"manning-qu","advisor_id":"124","project_title":"DING: Intuitive Comm Tool for Grandma","project_question":"Like most of the elderly population in China, my grandmother isn't a smartphone user. Operating technology can be a very frustrating experience for her. She loves to use the functionalities she is already familiar with, like making phone calls, however with her recent hearing loss, calling her on the phone became difficult. \r\n<br \/>\r\n<br \/>\r\nAfter failing to teach her how to send a voice message through existing APPs many times, I realized it’s not her fault that she isn't able to operate these 'simple' technologies, it is our fault for expecting her to use something that was not designed for her generation. DING is a project designed specifically for her and individuals of her generation by answering my question: \"how can I make it easier for my grandmother to stay connected with her family and loved ones?” \r\n<br \/>\r\n<br \/>\r\nThe project consists of a series of devices mounted to her wall in the form of photo frames, with each frame representing one of the family members. The frames are activated through a user-friendly app. My grandmother will be able to make easy video\/phone calls, hear read-out texts and see caption of voice messages, and browse through our social media feeds with simply touching the frames.\r\n<br \/>\r\n<br \/>\r\nSome of the strongest barriers in communication between generations are due to the different tools we are primed to use. To bridge this gap, <i>DING<\/i> is capable of receiving data from other APPs through APIs, which means, I can send her messages with WeChat.\r\n<br \/>\r\n<br \/>\r\nOlder adults are a huge group of users but products\/services designed for them are very rare. I wish more designers could take parts in this field after reading about my exploration. I believe design for the older adults is design for the future, a future we will all eventually experience.","short_description":"<i>DING<\/i> is a custom communication tool designed for my grandmother to help her connected to her family and loved ones. It’s a series of devices mounted on her wall like photo frames, running an easy-to-use APP. Each frame represents a different family member.\r\n","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnail-15.jpg","title":"DING_thumbtail","alt":"A picture of photo frame has D I N G on it.","caption":""},"topics":[{"name":"Tool\\Service","slug":"toolservice"},{"name":"UX\\UI","slug":"uxui"}]},{"student_id":"28","student_name":"Marco Guarino","student_slug":"marco-guarino","advisor_id":"123","project_title":"Genealogy of a Rhythm","project_question":"<i>Genealogy of a Rhythm<\/i> tells the ethnomusicological story of Candombe (Afro-Uruguayan music and dance) using modern tools such as 360 cameras and motion capturing. In virtual reality, I give the viewer a glimpse into some of the lives of the people that take part in Candombe, presented as a non-linear narrative.\r\n<br \/>\r\n<br \/>\r\nThe motion capturing portion of the project documents the bodies of the drummers, (and in the future, of the dancers) to collect data of body movements and create anthropological data sets of these movements. \r\n<br \/>\r\n<br \/>\r\nFuture work would include a Music Information Retrieval approach to dissecting the rhythmic patterns of Candombe, as well as other prominent Afro-Latin rhythms. This information can then be presented as a family tree of rhythmic patterns, depending on similarities and differences between rhythms. This is an expression of advocacy for a musical form as well as a proposal to document cultural information with the tools of our time.","short_description":"<i>Genealogy of a Rhythm<\/i> tells the ethnomusicological story of Candombe (Afro-Uruguayan music and dance) using modern tools and approaches with virtual reality, non-linear storytelling, and motion capturing technology.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/4.jpg","title":"4","alt":"Genealogy of a Rhythm","caption":"Genealogy of a Rhythm"},"topics":[{"name":"Culture","slug":"culture"},{"name":"Data","slug":"data"}]},{"student_id":"84","student_name":"Maria Del Pilar Gomez Ruiz","student_slug":"maria-del-pilar-gomez-ruiz","advisor_id":"129","project_title":"Onda: Data Portraits for Period Health","project_question":"Onda is a product that combines tangible and digital elements to create data portraits of a person's menstrual cycle. As the user collects data portraits over time, she strengthens her body confidence and self-esteem, gaining invaluable insights into her internal patterns and becoming an active participant in her period health. \r\n<br \/>\r\n<br \/>\r\nThe tangible interface is a counter that resembles an abacus. Its sliding red beads allow the recording of users’ daily basal body temperature (BBT) within a range of 97–99 degrees Fahrenheit, including decimal points (More on why I chose this indicator in the “Further Reading” section).\r\n<br \/>\r\n<br \/>\r\nA mobile companion app enables users to scan the counter and parse these images via a computer vision algorithm which detects each red bead (representing a temperature reading in a given cycle day) and saves it as a data point within the current cycle. \r\n<br \/>\r\n<br \/>\r\nThe app also generates an alternative circular data visualization of a cycle day by day.  Users may also input other period-related phenomena (mood swings etc.,) that may reveal unique patterns. Finally, the app creates an archive—a data diary—of users’ information to track privately or share. My aim is to form a habit or ritual, physicalizing the charting component to reinforce the need for healthy self-reflection and digitizing cycle data for personal record or to provide to healthcare practitioners. \r\n<br \/>\r\n<br \/>\r\nIn the following section I detail some of the findings of my research, which comprised a significant part of my project. ","short_description":"A body-literacy toolkit that allows menstruating teenagers to chart and discover the patterns of their cycles by combining tactile and digital components. ","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/onda-cover-pilar-gomez.png","title":"onda-cover-pilar-gomez","alt":"sketch of a physical menstrual calendar scanned and stored digitally with a computer vision algorithm","caption":""},"topics":[{"name":"Education","slug":"education"},{"name":"Health","slug":"health"}]},{"student_id":"105","student_name":"Maxwell Nakamura","student_slug":"maxwell-nakamura","advisor_id":"131","project_title":"Plaza Project: Mapping US public opinion","project_question":"A stimulated mind and working awareness are necessary for a thoughtful and informed people.  And so The Plaza Project poses questions to and attempts to convey the opinions, attitudes, and values of the public.\r\n<br \/>\r\n<br \/>\r\nThe project hosts a growing database of active polls.  The questions on which the polls are based are taken from the news, political surveys, local ballots, personality quizzes, dating websites, psychology tests, morality tests, and canonical philosophy.  Questions also come directly from users.\r\n<br \/>\r\n<br \/>\r\nResponses are visualized across time, geography, and population segments so that the public may see how opinions change from one year to another, across the country’s fifty states, and between American identities, age groups, and political affiliations.\r\n<br \/>\r\n<br \/>\r\nThe open network democratizes public opinion polling, which until now has been conducted by small yet influential organizations like the Pew Research Center, Gallup, and national news organizations, and gives everyday people a forum to ask and be asked important questions.","short_description":"<i>Plaza<\/i> is an open-sourced platform for measuring and visualizing public opinion over space, time, and population segments on political, moral, and philosophical questions.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/PlazaThumbnail.png","title":"PlazaThumbnail","alt":"Plaza logo","caption":""},"topics":[{"name":"Data","slug":"data"},{"name":"Society","slug":"society"}]},{"student_id":"85","student_name":"Melissa Parker","student_slug":"melissa-parker","advisor_id":"129","project_title":"Honeybee Training Academy","project_question":"The first activity in <i>Honeybee Training Academy<\/i> is called 'Pollination Protocol.' Giant fabric flowers with embedded arcade buttons are spread out in a large space. One at a time, the children run between the flowers, pollinating them by pushing the buttons. Their path and current distance is visualized and displayed in real time using a projector. Once all the flowers have been pollinated, the total distance the children traveled is displayed along with a 'leaderboard' showing the best scores of their classmates.\r\n<br \/>\r\n<br \/>\r\nThe objective of this lesson is to teach kids the basics of permutations. Pollination Protocol is an adaptation of the Traveling Salesman Problem. When honeybees are collecting pollen from different clusters of flowers, it is important for them to fly the path with the shortest total distance in order to conserve energy. This is an extremely difficult math problem! For ten clusters of flowers, there are almost two million unique paths that a bee could take. Thanks to evolution, bees’ collective intelligence allows them to instinctively find the optimal order of flowers to visit. Humans, of course, do not have this innate ability. <i>In Honeybee Training Academy<\/i>, kids will tackle this classic math problem head on.","short_description":"A classroom-adaptable installation where children learn about math by role playing as honeybees.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/archive-site-thumbnail.png","title":"archive-site-thumbnail","alt":"A giant fabric flower with 15 inch pink petals and a yellow arcade button in the center.","caption":""},"topics":[{"name":"Education","slug":"education"},{"name":"Play","slug":"play"}]},{"student_id":"106","student_name":"Miao Tian","student_slug":"miao-tian","advisor_id":"131","project_title":"Commodity Fetishism","project_question":"Consumption is inevitable. It is in our nature and it is part of the whole ecosystem. However, excessive consumption is a social mentality. In our recent past, overconsumption was viewed as greed, a moral vice. In our current time however, greed is viewed rather differently. Living in our current economic society, we as consumers become further and further away from the production and waste department. Because of that consumption seems independent from the guilt of wasting someone’s hard work or polluting a piece of land somewhere. Consumers enjoy an exhilarating sensation by satisfying their greed.\r\n<br \/>\r\n<br \/>\r\nFor the project, instead of announcing statistic numbers of overconsumption and its effect, I’d like to have audiences experience it directly. I hope to generate an emotional linkage between our daily consumption life and the amount of waste we produce.\r\n<br \/>\r\n<br \/>\r\nThere are three players to participate three parts of this project: a shopper to a commercial shopping website; a consumer to a trash can controller device; a receiver to an interactive VR film. The shopping website represents the drive that pushes us to shop more and more. The trash can symbolizes the end of a product’s commercial life and the start of its waste life. The VR film visualizes waste that we don’t see. The shopper 'buys' products and corresponding waste will show up in VR for the receiver. The consumer will step on a physical trash can and release the trash in VR. The receiver will endure the outcome, then the players can rotate and experience each other’s action.","short_description":"Consumption has become an exhilarating indulgence in today's economic culture. However, consumers are remote from creation, production and demolishment of commodities. Many developed fetishes on commodities. The purpose of this project is to recreate an emotional linkage between overconsumption due to our social mentality and its harmful effect. ","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumb.jpg","title":"thumb","alt":"Enduring Commodity Fetish","caption":"Enduring Commodity Fetish"},"topics":[{"name":"Society","slug":"society"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"15","student_name":"Michael Kripchak","student_slug":"michael-kripchak","advisor_id":"114","project_title":"Touch at a Distance","project_question":"This research addresses how to enhance telepresence with the use of haptic feedback in a way that generates, for users, the perception of a more 'real,' face-to-face experience. The solution consists of the creation of a real-time virtual reality (VR) experience that allows two users to share a virtual space as holograms. Telepresence is generated by employing body and hand tracking 3D cameras to project a person’s real-time image into a VR environment. Both users wear glove-like devices that place vibration motors on their fingertips. This allows them to reach out and not only touch the other person’s holographic representation, but to <i>feel<\/i> the interaction through the haptic response.","short_description":"Have you ever wanted to hug someone on the other side of the planet? Touch is one of the most powerful senses we have. It has also become increasingly absent as our interpersonal communications move online. This project is a first step in adding haptics to our virtual representations of self.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/KripchakThesisThumbnail.png","title":"Kripchak Thesis Thumbnail","alt":"Telepresence projection in VR.","caption":"Screen-capture of holographic telepresence from within VR."},"topics":[{"name":"Tangiable","slug":"tangiable"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"67","student_name":"Michael Simpson","student_slug":"michael-simpson","advisor_id":"124","project_title":"MLTK: Machine Listening Toolkit","project_question":"The <i>Machine Listening Toolkit<\/i> is a software toolkit for streamlining the use of machine listening algorithms. The toolkit was designed to be used in real-time applications and provides access to utilities and data structures that help alleviate the related burdens.\r\n<br \/>\r\n<br \/>\r\n <i>MLTK<\/i> currently includes an openFrameworks add-on, a collection of learning resources, and a standalone tool that can be used to visually explore representations of the  data and data flows. \r\n<br \/>\r\n<br \/>\r\nThe dashboard allows users to select, configure, and explore a vast array of relevant algorithms and have their output rendered in real-time as a graphic visualization. The dashboard can display a matrix of real-time visualizations which the user can arrange freely. The simultaneous view allows differences between graphs to become apparent and observed. This is useful as a way of better understanding the algorithms and their relationships to each other but also provides a real-time indication of how the algorithms perform and seem most appropriate for a certain task given the sound. The graphs can individually be explored in 3D to help reveal historical trends in the data visually. Visualizations can be selected on-the-fly to make their data stream available to external applications using OSC. Data can also be exported into flat files in several common data file formats.","short_description":"Sound is a multiplicity of qualities and features. What if a tool allowed us to easily extract and use more of these data points in real-time?\r\n<br \/>\r\n<br \/>\r\nThe <i>Machine Listening Toolkit<\/i> is a project aimed at easing the use of computational audition for creative purposes.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thesis_final_thumb.gif","title":"thesis_final_thumb","alt":"CATK_thumb","caption":"CATK_thumb"},"topics":[{"name":"Machine Learning","slug":"machine-learning"},{"name":"Sound","slug":"sound"}]},{"student_id":"47","student_name":"Mithru Swarna","student_slug":"mithru-swarna","advisor_id":"119","project_title":"Internet of T̶h̶i̶n̶g̶s̶  Humans (IoH)","project_question":"The <i>Internet of T̶h̶i̶n̶g̶s̶ Humans<\/i> is a collection of artefacts for a speculative version of our connected selves. The artefacts are whimsical takes on our understanding on internet infrastructure and the tools and services that come with it. They take physical or virtual forms, and address the gap between our increased interaction with these devices and our understanding of them. \r\n<br \/>\r\n<br \/>\r\nI've always been interested in our relationships with the devices we use in our day-to-day activities. Marshall McLuhan, in <i>Understanding Media: Extensions of Man<\/i>, wrote about the implications of our tools on our society. He wrote about numerous media from clothing to electricity. These tools extended the limits of the capabilities of our bodies. We've perceived and navigated our world with just our biological senses and analog tools to help us from time to time. Today, our tools not only help us communicate, but speak to one another themselves, thus creating representations of this communication in physical phenomena that we cannot biologically perceive (electromagnetic waves). \r\n<br \/>\r\n<br \/>\r\nWhat most of us do not realize or understand are the vulnerabilities that these devices and services create. People could run malicious code on our devices or steal our passwords if they're unencrypted. Notifications are engineered as dopamine cues. And the connected devices in our homes sometimes talk to their server-overlords (server-lords?) even when we don’t use them. My intention with this project is to start a dialogue around the gap between our increased reliance of these devices and our limited education about their vulnerabilities.","short_description":"If our modern internet-connected tools and services are considered extensions of the human form, how could we translate, augment and influence our biological selves to understand these devices and their vulnerabilities better?","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/ioh-colour.png","title":"ioh-colour","alt":"A dark blue logo with white background that has a representation of a human with wireless signals coming off the human's head. It's a combination between a human icon and the WiFi icon.","caption":"Internet of Humans - logo"},"topics":[{"name":"Culture","slug":"culture"},{"name":"Data","slug":"data"}]},{"student_id":"86","student_name":"Nanou Dimachki","student_slug":"nanou-dimachki","advisor_id":"129","project_title":"Intimate Patterns","project_question":"\"Intimate Patterns\" is a series of physical expressions that emerged from the intimate digital conversations between two people. \r\n<br \/>\r\n<br \/>\r\nThe relationship between the pair is translated into two\/three physical installations. \r\n<br \/>\r\n<br \/>\r\nTexts become a metaphor, becomes tangible in concrete form.\r\n<br \/>\r\n<br \/>\r\n<i>How?<\/i>\r\n<br \/>\r\n<br \/>\r\nI thought of ordinary objects from daily life because physicality is exactly what we miss in digital interactions. Hence the two installations: two light bulbs and two wine glasses.\r\n<br \/>\r\n<br \/>\r\nRelationships, like the bulbs sometimes go on and off or dim and die... The tangible aspect of bulbs, their accessibility and presence everywhere in every room made me think about how we tend to take them for granted. We can put a bulb on and off when we want to… However, do we have that choice in relationships with people? Is it always our call? Are we ever conscious of the pattern we make with them? Maybe. Who knows? Regardless bulbs are only here to show us in a very simplified and poetic way these digital interactions.\r\n<br \/>\r\n<br \/>\r\nThey go “on” and “off” like the interaction of the texting between those people. On, when received; off, in the absence of it. The lights intensify and dim when the interaction is vivid or dull. The bulbs change colors when the words exchanged are positive or negative, etc.\r\n<br \/>\r\n<br \/>\r\nThe installation of the two wine glasses come in pairs too, to exchange liquid (the wine) just like the exchange of messages, to reflect the pattern of sending and receiving. The full glass is a metaphor for the emotional fulfillment someone make us feel, when we receive a text. And an empty one is the lack of it or when we are in return filling somebody’s cup. ","short_description":"How can we draw patterns from the data of social digital-relationships and visualize these in the physical world?","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/20180424_142819-1024x768.jpg","title":"20180424_142819","alt":"bulbs two","caption":"bulbs two"},"topics":[{"name":"Data","slug":"data"},{"name":"Installation","slug":"installation"}]},{"student_id":"107","student_name":"Nathaniel Padgett","student_slug":"nathaniel-padgett","advisor_id":"131","project_title":"Open Kinetics","project_question":"An exciting aspect of the rapid proliferation of technology over the past decade is that much of it is open and remixable by anyone with access to a computer and the internet. This has created unprecedented opportunities for anyone to contribute to and use these technologies for research, to start businesses, or to make art. \r\n<br \/>\r\n<br \/>\r\nBut despite these advances, access to technology is still largely concentrated in the wealthiest communities. A major reason for this digital divide is cost. <i>Open Kinetics<\/i> addresses this problem with engaging DIY technology kits designed to be affordable and accessible. Students learn programming, electronics, and design by making a simple motion controller used to play free movement-based games that they can also remix and build themselves. Through building these kits, they learn to use technology for their own creative ends, developing technological agency and preparing them for careers of the future.   \r\n<br \/>\r\n<br \/>\r\nBy pairing hardware with games, <i>Open Kinetics<\/i> kits give context to what students can do once they have built their controller. <i>Open Kinetics<\/i> give students a virtually endless array of experiences to choose from, whether moving a character, playing virtual tennis, or making kinetic art. Because these games are movement-based, they engage students in active, physical participation that facilitates learning. Built for kids ages 8-16 but great for all ages, <i>Open Kinetics<\/i> turn players into makers and empowers students to contribute to rather than simply consume technology.\r\n<br \/>\r\n<br \/>\r\nOne simple project for <i>Open Kinetics<\/i> is a twist on the Atari classic Pong. In this game has players move paddles up and down the screen to deflect a puck and prevent their opponent from scoring. Rather than using joysticks or buttons, players use the <i>Open Kinetics<\/i> motion controller they build to move the paddles with their arm movements, making a sedentary game into an active one. ","short_description":"Low cost kits that inspire learners of all ages to explore programming and electronics through movement-based play. The aim of <i>Open Kinetics<\/i> is to create an affordable, accessible, and engaging platform that teachers can easily bring into their classrooms to foster technological agency in their students. ","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/OKlogosymbol.png","title":"OKlogosymbol","alt":"Open Kinetics Logo","caption":"Open Kinetics Logo"},"topics":[{"name":"Education","slug":"education"},{"name":"Play","slug":"play"}]},{"student_id":"69","student_name":"Nitish Wakalkar","student_slug":"nitish-wakalkar","advisor_id":"124","project_title":"The Quirk Bot Experiment","project_question":"The goal of my thesis project was to comment on society’s current rush to automate everyday tasks, for better or for worse, by creating a fictionalized work-space scenario where office products are made to perform mundane human tasks and assume human personality traits.\r\n<br \/>\r\n<br \/>\r\nMy primary research consisted of trying to understand the office organization and modular systems, as well as process of automation, machine learning and fabrication. Based on my findings, I made a catalog of the different kinds of motions work-space objects might perform if automated, created a few preliminary simulations and ultimately, built a desktop installation comprised of two prototypes, a ‘lamp bot’ and a ‘stationery bot.'\r\n<br \/>\r\n<br \/>\r\nThe preliminary simulation I developed included: lamp bot, which is a study lamp that automatically positions itself over a rectangular object held in hand, such as a book or paper. Stationery bot, which is a pen holder that moves around the desk and collects small oblong objects (like pens or pencils). Knolling bot, which is an aligner cube that moves around the desk trying to align edges of rectangular objects to the edges of the table. Monitor bot, which is a computer screen that automatically positions itself to the user's viewing angle.\r\n<br \/>\r\n<br \/>\r\nMy experiments were motivated by several design questions. Will making desktop objects smarter be helpful? Funny? Or just annoying? Will it help reveal and solve any problems that were previously unnoticed or help create new product ideas? Will it become a common feature of new products? Can it help us be more productive? Should smart objects be able to work for us in our absence? Can virtual assistants pair-up with other smart objects to form a new kind of smart work-space?\r\n<br \/>\r\n<br \/>\r\nCurrently we use smart devices like virtual assistants at home and work, but they have physical and spatial restrictions. Products with automation capabilities could give these smart assistants partial spatial access, which may help various users suit their different needs.","short_description":"How much is too much with respect to robotic task automation? Can automation in the work space help us be more productive?\r\n<br \/>\r\n<br \/>\r\n<i>Quirk bots<\/i> is an experimental project that speculates on the value of making work- space objects smarter and whether or not they have the potential to enhance the day-to- day work experience.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/quirk-bots-thumbnail.png","title":"quirk bots-thumbnail","alt":"smart objects","caption":""},"topics":[{"name":"Tangiable","slug":"tangiable"},{"name":"UX\\UI","slug":"uxui"}]},{"student_id":"68","student_name":"Nouf Aljowaysir","student_slug":"nouf-aljowaysir","advisor_id":"124","project_title":"Nouf.io","project_question":"What information is collected about me online? Can I recreate another version of myself based on who this data describes?\r\n<br \/>\r\n<br \/>\r\nNouf.io seeks to answer these two questions. I extract, scrape, and collect different archives of my digital information in order to understand who I am online. On a personal level, Nouf.io is a self-reflective character whose actions and behaviors visualize my digital persona.\r\n <br \/>\r\n<br \/>\r\nOn a broader level, she is a character representative of my data and its categorization and labeling of who I am. After looking through large amounts of my information, I noted many inaccuracies to how I was being portrayed such as “Nouf’s hobbies include acting and playing the harp”. Hence, I wanted to paint a picture to how algorithms categorize us based on interactions we have had online.\r\n<br \/>\r\n<br \/>\r\nServing as both a self-reflective piece and a commentary, I want users to interact with Nouf.io in order to push the boundaries of privacy and accessibility to my information. Depending on the identity of the user and the amount of interactions we have had via text and Facebook, Nouf.io discloses private information based on our level of digital intimacy. In the same manner that data is passed around online between Facebook and Google, what if I just handed it out and made it available to you? What does it feel like to get to know me if you have never met me? Does her honesty and raw information make you feel uncomfortable? ","short_description":"<i>Nouf.io<\/i> is a 3D scanned digital avatar that is simulated from my scraped online data points. She invites you to click on different objects within her virtual environment to learn more about the data she contains. Once clicked, Nouf.io discloses my private information depending on your identity and our level of online interaction. ","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnail-9.jpg","title":"thumbnail","alt":"nouf.io","caption":"nouf.io"},"topics":[{"name":"Data","slug":"data"},{"name":"Identity","slug":"identity"}]},{"student_id":"48","student_name":"Or Fleisher","student_slug":"or-fleisher","advisor_id":"119","project_title":"Volume","project_question":"Volume is a system that generates 3D models from single view 2D images and video using state-of-the-art Machine Learning research. It is intended to provide a way to reconstruct archival, historical and pre-existing images and video in 3D space. \r\n<br \/>\r\n<br \/>\r\nBy providing an interface to bridge between machine learning and storytelling practices, Volume enables content creators to easily prototype 3D assets from 2D images and video in Augmented, Virtual and Mixed reality environments. Volume is built as a cloud service, which abstracts all the machine learning processing and provides a simple interface to reconstruct and view your assets. Upon reconstruction, you are able to download and use these assets in popular game engines such as Unity, Unreal or Three.js using the Volume plugin. \r\n<br \/>\r\n<br \/>\r\nVolume's main audience are content creators. By allowing anyone, with no previous coding background, to easily prototype 3D Volume encourages inclusion in the content creation process.","short_description":"3D photography and immersive mediums have been booming over the past years. Culturally, 2D images have been an integral part of how we develop an identity. Given the transition from 2D to 3D, how can we use historical, archival and pre-existing 2D images and video in the 3D era?","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/volume_archive.png","title":"volume_archive","alt":"Volume Logo","caption":""},"topics":[{"name":"Culture","slug":"culture"},{"name":"Machine Learning","slug":"machine-learning"}]},{"student_id":"29","student_name":"Oriana Neidecker","student_slug":"oriana-neidecker","advisor_id":"123","project_title":"The Nude Museum","project_question":"<i>The Nude Museum<\/i> is an exploration into how we can view and engage with art that is not physically displayed. Whether it is art in a private collection or in a museum’s storage, the reality is that most art  lives in boxes and in warehouses. Virtual reality provides an experience of viewing the art itself that lies somewhere between seeing it in person and seeing it as a jpeg on a 2D screen. \r\n<br \/>\r\n<br \/>\r\n<i>The Nude Museum<\/i> is a prototype that is part tool\/part art piece that places a curated exhibition of a private collection of nude photography in various environments in virtual reality.  It adds an otherworldly layer where the photos are curated with their environment and the experience is interactive.\r\n<br \/>\r\n<br \/>\r\nApproaching a photo triggers an audio story about the piece, by the artist, their gallerist or from someone knowledgeable about it. It emulates the feeling of hearing about a piece from somebody first hand. Its conversational tone creates an enhanced viewing experience that makes the art more accessible and allows the viewer to connect on a deeper level with the work through stories.  It is informative and surreal. \r\n<br \/>\r\n<br \/>\r\nYou have the opportunity to get closer to the art and really study it in a way that isn’t possible in a real museum. There are three different exhibitions of the collection in <i>The Nude Museum<\/i>, one in the desert, one on Mars, and one in a traditional museum setting.","short_description":"<i>The Nude Museum<\/i> is a series of curated interactive virtual reality exhibitions that showcase a private collection of nude photography in the desert, on mars, and in a gallery setting.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/mars320.jpg","title":"Nude Museum on Mars","alt":"Curated selection of photos for the Mars Environment","caption":""},"topics":[{"name":"Culture","slug":"culture"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"71","student_name":"Pan Pan","student_slug":"pan-pan","advisor_id":"124","project_title":"Actively","project_question":"There is no one like your child. Every child's development is unique and complex. Although children develop through a generally predictable sequence of steps and milestones, they don’t necessarily proceed through these steps in the same way or at the same time. Play is essential to development because it contributes to the cognitive, physical, social, and emotional well-being of children and youth.\r\n<br \/>\r\n<br \/>\r\nPlay also offers an ideal opportunity for parents to engage more fully with their children. Unfortunately, given the hectic pace and over-scheduling of life today, time for free play has been markedly reduced in recent years despite the benefits derived from play for both children and parents.\r\n<br \/>\r\n<br \/>\r\nMore and more kids are glued to their phones or tablets for endless hours every day. Even those children who are fortunate enough to have abundant available resources and who live in relative peace may not be receiving the full benefits of offline play. Parents are not only worried about all the time their children are spending with technology, but they are also worried about the lack of time they are spending with them. Active.ly is an app designed to help parents turn the time they have with their children into more memorable moments that maximize the benefits of play offline.","short_description":"Parents of young children are often at a loss when it comes to knowing the best kinds of activities to pursue with their preschoolers. Most parents often wonder how to optimize the time. <i>Active.ly<\/i> is an app created for parents to help them find appropriate, customized, offline activities.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/logo-2.png","title":"logo","alt":"LOGO","caption":""},"topics":[{"name":"UX\\UI","slug":"uxui"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"70","student_name":"Patrick Presto","student_slug":"patrick-presto","advisor_id":"124","project_title":"Decrypt.Ed","project_question":"<i>Decrypt.Ed<\/i> is an interactive and practical guide to understanding cryptocurrencies in an approachable way. Societies and communities at one time traded with salt or cowrie shells as these were seen as trusted forms of currency which everyone agreed held value. Eventually, multiple shifts gave rise to coins, banknotes, and later, plastic cards which act as proxies of value and offer consistency to the system of exchange. If is often the case that currencies, or our understanding of value, evolves faster than societies can adapt. \r\n<br \/>\r\n<br \/>\r\nMany things are gained as well as lost in the process, including elements of culture, languages, design, and politics. The process of adapting to a new currency often involves a steep learning curve. <i>Decrypt.Ed<\/i> is a project that evolved from an exploration of the ways in which value is understood, agreed upon, retained and exchanged and attempts to help newcomers up the cryptocurrency learning curve. ","short_description":"In the last couple of years, we have witnessed an evolution of a new kind of currency with the rise of technology-enabled cryptocurrencies. But do we really understand this new future? <i>Decrypt.Ed<\/i> is an interactive, visual guide that attempts to explain the basic concepts which are foundational to this potential future.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/Logo_3.png","title":"Logo_3","alt":"logo3","caption":""},"topics":[{"name":"Education","slug":"education"},{"name":"Machine Learning","slug":"machine-learning"}]},{"student_id":"30","student_name":"Paula Leonvendagar","student_slug":"paula-leonvendagar","advisor_id":"123","project_title":"Oneiric Lab","project_question":"<b>The installation<\/b>\r\n<br \/>\r\n<br \/>\r\nOutside a dark room, there is a computer where the audience can input dreams, which are added to a database that connects the installation and the web platform. The web platform collects the dreams people share, and the installation creates written and audiovisual poetry with them. \r\n<br \/>\r\n<br \/>\r\nInside the room there are two projections that represent inner and external aspects of the dream experience. In the walls there is projected a 3D animation of electronic poetry that moves around, appearing and disappearing. The written poems are created by a program that picks random sentences and words from the database made from what the visitors have shared. This decontextualizes the unitary dreams, mixing ones with others.\r\n<br \/>\r\n<br \/>\r\nAt the center of the installation, there is a round structure that looks like the top of a human skull. Inside there are projected image sequences created by an algorithm that emulate dream narratives with automated video techniques, subtly related to the dreams users share through word associations. The videos are tagged with words, and depending on the words of the dream, random videos will be selected by the program to create the sequences.\r\n<br \/>\r\n<br \/>\r\n<b>The web platform<\/b>\r\n<br \/>\r\n<br \/>\r\nThe second component of this project is a web platform where the dreams are stored. It is a Dream Archive that has a community and a personal dimension. Half of the site lets you publicly share your dreams, and the other half is a personal archive that privately keeps track of the dreams you do not wish to share.\r\n<br \/>\r\n<br \/>\r\nThe public dreams are shown in the installation and throughout the web site. Your private dream archive lets you search by word filters and make creative analysis. I will also be showing the artistic research I am doing in a gallery, working with analog and digital techniques, to create visual representations of the received dreams.","short_description":"<i>Oneiric Lab<\/i> is an art installation and a web platform to archive dreams and create artistic research about the dream image and its narratives. How is the language of dreams composed? Which brain mechanisms create them? How are they displayed? These questions are explored through the poetics of digital language.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/ThesisThumbnailImage1-2.png","title":"ThesisThumbnailImage1","alt":"Oneiric Lab Art Installation","caption":"Oneiric Lab Art Installation"},"topics":[{"name":"Installation","slug":"installation"},{"name":"Narrative","slug":"narrative"}]},{"student_id":"49","student_name":"Philip McCausland","student_slug":"philip-mccausland","advisor_id":"119","project_title":"Feeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeed","project_question":"Many people interface with much of the content on the web through various types of feeds, as lists or other forms of visual collections of content. Modern feeds tend to be virtually infinite, and blur the distinction between personal, commercial , self-picked and algorithmically curated content. One particularly interesting feature of such feeds is their ability to incite positive feedback loops through the emotional impact of the content's subject matter and the psychological reward of scrolling on to something new to repeat the process. \r\n<br \/>\r\n<br \/>\r\n<i>Feeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeed<\/i> is an exploration of this prolific media consumption paradigm. As a hypnotic and overstimulating space that is simultaneously hyper-commercialized and intimately personalized, how is this mode of information consumption affecting our capacity to reflect more deeply on what we're seeing? How much of our time is wasted on garbage? This project aims to stimulate dialogue and imagination about what the future of web media consumption can or might be.","short_description":"What are the aesthetics and politics of infinite distraction and relentless forgetting? What is our relationship to the past in a landscape constantly feeding us the 'now'? \r\n<br \/>\r\n<br \/>\r\n<i>Feeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeed<\/i> is a multimedia installation that attempts to critically reflect on these cumulative effects of modern media consumption habits through web feeds.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnail-7.png","title":"thumbnail","alt":"feeeeeeeeeed thumbnail","caption":""},"topics":[{"name":"Culture","slug":"culture"},{"name":"Installation","slug":"installation"}]},{"student_id":"109","student_name":"Ran Tian","student_slug":"ran-tian","advisor_id":"131","project_title":"Heart Health","project_question":"Unlike some disease that can be instantly felt by the patient or can be life threatening, cardiovascular disease is a silent killer. One third of patients after a cardiac event are not adherent to their medication irrespective of the cardiac medication prescribed, which is a major high growth situation in the US and globally. Patient adherence to medication is crucial for risk reduction following a cardiac event. Cardiac rehabilitation is complex and the workflow consists of 5 phases: patient ID, referral management, enrollment, patient rehabilitation, and maintenance. My thesis is focusing on patient rehabilitation and maintenance.\r\n<br \/>\r\n<br \/>\r\nThe primary reasons that cause non-adherence after a cardiac event are no symptoms, not filling the prescription, complexity, forgetting, cost and side effects. To address these problems, I’m creating a visually rich AR experience that will improve medication adherence, patient engagement, and create a better relationship between the patients and their heart anatomy to help them think about medication and rehab differently.\r\n<br \/>\r\n<br \/>\r\nTargeting the elderly, but highly applicable for youth as well, this AR app has three primary features: medication education via AR animated heart modules; integrated apple watch with realtime heart rate data; fun, emotional, and engaging gamified notifications for medication management. By turning the burdensome rehab trajectory into  an experience of a beautiful garden inside the room, the process becomes more like meditation rather than work.","short_description":"Through a visually rich AR experience, <i>Heart Health<\/i> helps cardiac patients understand in layman’s terms the impact of the medication they are taking directly on their heart health, and improves medication adherence by gamifying medication management; it also provides heart condition monitoring by integrating apple watch’s heart sensor.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/Thumbnail.png","title":"Thumbnail","alt":"Heart Health AR app","caption":""},"topics":[{"name":"Health","slug":"health"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"50","student_name":"Regina Cantu De Alba","student_slug":"regina-cantu-de-alba","advisor_id":"119","project_title":"Epoche","project_question":"Originated from the urge to reveal the complexity of relations between organisms that exists in different forms and moments in 'time.' My initial hunch was that through being able to open the possibility for users to transition between their regular experience of time to one that required them to think of a different scale, I would awaken a certain empathy.\r\n<br \/>\r\n<br \/>\r\nLooking into why I wanted to raise a conversation regarding the complexity of life systems, I realized that I kept on reiterating a statement I have championed for a while now: until we accept complexity and  scarcity as the moving forces of life cycles, we will continue to understand—and design—our existence on this planet based on a mindset that is destructive. This destruction is a result of a collective effort to achieve the unconditional availability of goods and services used to supplement an existence understood as 'comfortable.'\r\n<br \/>\r\n<br \/>\r\nWith a background in social science research and project management for sustainable urban development. I faced the challenge of translating my ideas from a communication style based in theoretical thinking through writing, into a process of designing objects and experiences meant for other people to use and understand.\r\n<br \/>\r\n<br \/>\r\nThis meant that I had to dissect my concepts to their core components in order to have raw matter to work with. I then used these to design objects that would represent the ideas I was trying to transmit.These objects were used for my explorations. First a prompted dinner and second a guided exercise in wondering and questioning through which two concepts ran throughout: empathy and systems thinking.\r\n<br \/>\r\n<br \/>\r\nI’ve realized that in the quest to fulfill my original urge, I’ve come into a place of exploring how to design for the purpose of philosophy. ","short_description":"<i>Epoche<\/i> is an exploration on ways in which I could, by designing objects and implementing guided experiences, invite an audience to consider what is Time without conventional reference points.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/epocheThumb.png","title":"epocheThumb","alt":"The logo for a project that looks like a broken clock","caption":"Epoche Logo"},"topics":[{"name":"Society","slug":"society"},{"name":"UX\\UI","slug":"uxui"}]},{"student_id":"16","student_name":"Richard Lapham","student_slug":"richard-lapham","advisor_id":"114","project_title":"Customizing Reality: Immersive Painting","project_question":"How would you customize your reality? In a world where mixed reality eyewear is integrated into our lives, how would you augment the space around you and why would you want to? \r\n<br \/>\r\n<br \/>\r\nWith many possible applications of mixed reality, my research focuses on one: immersive digital painting. I’m most interested in the creative potential of mixed reality and with the release of immersive painting softwares, like Tilt Brush and Quill, I explored some of the possibilities offered by this new medium through a series of mixed reality experiments. \r\n<br \/>\r\n<br \/>\r\nMy research began with a technical component as I familiarized myself with developing for mixed reality. In this time I created a workflow allowing me to incorporate digital painting assets (including animated digital paintings) with mixed reality as a mobile application. \r\n<br \/>\r\n<br \/>\r\nWith this toolkit, I structured the remaining experimentation around three categories: environment, people, and narrative. \r\n<br \/>\r\n<br \/>\r\n<b>Environment<\/b>\r\n<br \/>\r\n<br \/>\r\nI reimagined Washington Square Park as a procedurally produced impressionist painting (inspired by Van Gogh and Seurat). In addition to experimenting with my own paintings in a space, I ran user testing with several volunteers in VR to see how people would paint and collaborate with each other. \r\n<br \/>\r\n<br \/>\r\n<b>People<\/b>\r\n<br \/>\r\n<br \/>\r\nInspired by several clothing collections, I created personal animations intended to track and overlay onto a person as a speculative digital accessory and a future form of self expression. \r\n<br \/>\r\n<br \/>\r\n<b>Narrative<\/b>\r\n<br \/>\r\n<br \/>\r\nI built a database of illustrative paintings that depict a specific action, character, environment, and many other elements that can be combined to create a story. In a mobile application, users can add these paintings to a mixed reality scene and rearrange them to create their own narrative. I plan to work on this application in the future and create a tool that makes mixed reality more accessible for creators to engage with the medium. ","short_description":"With ubiquitous mixed reality on our horizon, I’m creating several speculative environments exploring some of the creative possibilities afforded by this new medium. Using digital painting softwares such as Quill and Tilt Brush, my research illustrates several sceneroes of incorporating immersive media in our everyday lives.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/RL_thumbnail.jpg","title":"RL_thumbnail","alt":"thumb","caption":""},"topics":[{"name":"Narrative","slug":"narrative"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"108","student_name":"Rita Cheng","student_slug":"rita-cheng","advisor_id":"131","project_title":"The Personal Panopticon","project_question":"<i>The Personal Panopticon<\/i> is a multimedia project exploring the Internet of Things (IoT), surveillance culture, and the aesthetics of wellness and self-help. The project is a critical look at internet-enabled care devices (e.g. the Fitbit, smart scales, Apple Health) and the politics of their usage. Using them produces metrics to try and improve your well-being, but also is an implicit agreement to data surveillance and continuous monitoring.\r\n<br \/>\r\n<br \/>\r\nThe project consists of an IoT hub called Karma. Karma will take care of and manage your life, as a vision of the dystopia in which surveillance and monitoring is taken to extremes. Karma will collect information from other devices and will nag you to meet your goals and stay connected. When you are in range, she will talk to you and care for you in person. When you are away, she will call you and remind you of your obligations. You cannot opt out of Karma—she is connected to your phone, email, and social media, so connecting to any network necessitates connecting to Karma.\r\n<br \/>\r\n<br \/>\r\nThe project also includes marketing such as the <a href=\"http:\/\/www.karma.care\">landing website found here<\/a> and the Indiegogo campaign. A trade show setup was designed for the quick and dirty show. In this way, I examine how technology companies sell IoT devices and look at the aesthetics of surveillance, gadgets, and wellness.","short_description":"How are IoT devices like the Fitbit aiding in our collective exploitation and surveillance? What is the future of these caretaking devices? Most importantly: how do I get a piece of this action?","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/render.png","title":"Karma. The Smarter Assistant.","alt":"A Render of Karma","caption":"Karma. The Smarter Assistant."},"topics":[{"name":"Data","slug":"data"},{"name":"Health","slug":"health"}]},{"student_id":"17","student_name":"Roi Lev","student_slug":"roi-lev","advisor_id":"114","project_title":"Inventing America","project_question":"In 1623 the first immigrants came to what is known today as New York city. They were young, ambitious and came to reinvent themselves in America. \r\n<br \/>\r\n<br \/>\r\n<i>Inventing America<\/i> is a story of a new society, a new city, being told from the point of view of a single person, an immigrant.\r\n<br \/>\r\n<br \/>\r\nThe project uses augmented and virtual reality technologies to explore the relations between time and space. Using their mobile devices, visitors are immersed in the same space they are physically standing in, the way it was in the past. <i>Inventing America<\/i> provides an opportunity to experience immigration to a new dimension, to different times, using the city of immigrants as a canvas.\r\n<br \/>\r\n<br \/>\r\nI believe we are witnessing a revolution in the way we integrate digital content into our lives. Latest technologies take content beyond the screen and provide exciting new ways for us to interact with it. The novel uses of immersive media we can see today in entertainment will eventually evolve to include other aspects of our lives. <i>Inventing America<\/i> demonstrates the potential of using those technologies to interact with historical data, with our past, in a new vivid and engaging way.\r\n<br \/>\r\n<br \/>\r\nIn order to realize this project we developed unique solutions and tools. The process involved unique production techniques such as 3D scanning, motion, face capture, custom graphics, branching narrative mechanisms and augmented reality platforms for mapping virtual environments to physical spaces.","short_description":"An immersive journey back in time, set on Governors Island, the landing spot of the first immigrants in New York.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnail_new2.png","title":"thumbnail","alt":"","caption":"thumbnail"},"topics":[{"name":"Narrative","slug":"narrative"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"31","student_name":"Rushali Rupchand Paratey","student_slug":"rushali-rupchand-paratey","advisor_id":"123","project_title":"NYC Beats","project_question":"New York City has an amalgam of influences from all over the world, which reflects in the city’s ever vibrant street music culture. A custom that diligently extends into the the century old subway of the city. Subway music is unpredictable, chaotic, rebellious and these tunes reverberating underground have an ecosystem that has flourished over the years. \r\n<br \/>\r\n<br \/>\r\nProtected by the First Amendment yet outlawed depending on decibel levels—whether it’s a music student rehearsing or U2 in disguise, the subways have become a unifying stage. Inspired by this ecosystem, NYC Beats was created to unravel the intricate relationships between commuters, musicians, music and locations. An interactive map of NYC made with Mapbox and Three.js, a user can navigate to find artists currently playing in the subways, a commuter can ‘spot’ musicians, and musicians can ‘geo-tag’ themselves on the map. \r\n<br \/>\r\n<br \/>\r\nOfficial MTA ‘Music Under New York’ program locations are indicated on the map as hotspots. NYC Beats places the underground experience in a disparate public space, the world wide web. It breaks the fourth wall by merging the physical and the digital, bringing us together in a shared experience. ","short_description":"<i>NYC Beats<\/i> is a web art experiment about New York City’s iconic subway musicians. It allows both their immediate and global audience to explore and engage with artists in real-time through a crowdsourced three dimensional interactive map.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnail-thesis-pink.png","title":"thumbnail-thesis-pink","alt":"pink music location icon with black background","caption":""},"topics":[{"name":"Culture","slug":"culture"},{"name":"Sound","slug":"sound"}]},{"student_id":"110","student_name":"Samantha Schulman","student_slug":"samantha-schulman","advisor_id":"131","project_title":"Breathe With Me","project_question":"Anxiety disorders affect more than 40 million Americans, many of whom suffer from panic attacks. Panic attacks are unpredictable, debilitating episodes typically characterized by shaking, chest tightness, difficulty breathing, and intense fear. The combination of fear and physiological symptoms continues to heighten one another, escalating the panic attack. Paralyzed with fear, one’s breathing becomes short and shallow. While some strategies for coping with anxiety involve meditation or medication, I want to offer a new solution, one that transforms the anti-anxiety techniques of both diaphragmatic breathing and applied deep body pressure into a garment that could be worn anywhere.\r\n<br \/>\r\n<br \/>\r\nThe result, <i>Breathe With Me<\/i>, is is a wearable t-shirt that leverages the expansion and compression of pneumatics to encourage the wearer to focus on and control their breathing during moments of panic and anxiety. The user squeezes a hand-pump to inflate two air pockets that hug their chest and back, providing comfort in the application of gentle pressure. The hand-pump itself is soft and tactile, shaped to match the form of a person’s hand, and absorbs muscle tension to provide stress relief. The repeated squeezing of the pump combined with the soft compression develops a pattern that simulates deep breathing, guiding the user to practice breathing together with their garment. Essential oils are also dispersed with each pump as an additional calming element.\r\n<br \/>\r\n<br \/>\r\nFurthermore, in creating <i>Breathe with Me<\/i>, I challenged myself to try to uphold environmental ethics when selecting materials, despite the lack of resources available for fast and affordable sustainable production. My final prototype is made with soft white cotton fabric by the way of vintage laundry bags, and silicone, which is non-toxic throughout its entire lifecycle when properly developed.","short_description":"<i>Breathe With Me<\/i> is a wearable t-shirt that leverages the expansion and compression of pneumatics to encourage the wearer to focus on and control their breathing during moments of panic and anxiety.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumb2-size-2.jpg","title":"","alt":"thumb","caption":""},"topics":[{"name":"Health","slug":"health"},{"name":"Tangiable","slug":"tangiable"}]},{"student_id":"33","student_name":"Scott Reitherman","student_slug":"scott-reitherman","advisor_id":"123","project_title":"Grand Central Immersion","project_question":"When you put someone in the center of a story they take more of an interest. And while sound is the most inherently immersive of our sensory experiences, overwhelmingly the emerging XR technology focuses on the visual display.\r\n<br \/>\r\n<br \/>\r\nBy exploring spatialized audio cues and 3D sound design as tools that are both narrative and which can modify behavior within public space, my Grand Central story leads users through an intimate exploration of the urban monument revealing historic anecdotes culled from the New York Times archive and prompts for imaginative wandering that peel back perceptual layers.\r\n<br \/>\r\n<br \/>\r\nIncreasing interest in AR represents an enormous opportunity for wonderful aural experiences, and a chance to evolve current immersive audio standards from static to interactive. Because while the fidelity of a VR headset experience is much higher than current AR hardware allows, it lacks the freedom of wide movement and is detached from physical reality.  This is why implementation of a bluetooth headtracker affixed to the headphones really improves the experience and brings to AR the audio capabilities that were previously only the affordances of a head-mounted display.  As the user rotates their head with six degrees of freedom around Grand Central station, my Unity iOS application renders a naturalistic aural soundfield comprised of base layer ambisonic recordings from the interior and exterior scenes of the station overlaid with monaural assets placed into the virtual geography. \r\n<br \/>\r\n<br \/>\r\nThere is a magic trick that already exists: hearing prerecorded ambisonic sound in headphones at the same space in which the audio was originally captured. It is at once naturalistic and surreal, delightfully obscuring the distinction between past and present and challenging our brains to encode\/decode the psychoacoustic aural cues that we hear with what our eyes perceive. In this moment of blended reality there is a rich storytelling opportunity that lies at the intersection of podcast-style narrative and guided historical walking tour.  And much of this convincing of our brain relies upon the recently possible reliable rotational head-tracking in wireless headphones so as to support an intimate, cinematic experience.","short_description":"An investigation of immersive acoustic storytelling that engages our current definitions of augmented reality, <i>Grand Central Immersion<\/i> is a psychogeographic walking guide that explores the relationship between sound and public space via creative interactions with wireless headtracking and 3D audio.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/GCI_thesisArchive1.jpg","title":"GCI_thesisArchive1","alt":"Grand Central Immersion, Scott Reitherman ITP Thesis","caption":"Grand Central Immersion, Scott Reitherman ITP Thesis"},"topics":[{"name":"Sound","slug":"sound"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"52","student_name":"Se Young Kim","student_slug":"se-young-kim","advisor_id":"119","project_title":"Memoria","project_question":"<i>Memoria<\/i> is a mobile augmented reality app that let users archive their memories in the digital world attached to space. More and more people digitalize their memories, but it’s often disconnected with the real world we’re living in. The memories are heaped up, and users never go back. Think of all those bookmarks we made in the web, countless photos in your phone, and all those things you thought you would come back again. \r\n<br \/>\r\n<br \/>\r\nMemory is a visual thing, and it is strongly connected with the concept of space. Spatial memory is well known for a method to efficiently recall information too(“The method of loci”) \r\n<br \/>\r\n<br \/>\r\nI wanted to explore the relationship between memory and space, and literally attach the memory to the actual place and even recall them. \r\n<br \/>\r\n<br \/>\r\n<i>Memoria<\/i> will use AR to connect the memory with the real world. AR uses the actual environment for the background, and the users will use device’s screen to see through the digital space of memory. Users will keep their moments in photo, text and sound format. They will not only anchor to the 3D digital space but also attached to GPS data. After the user leaves a mark, they will set a certain amount of time for how long you want to “bury” the memory in that place. After the time has passed, the memory will be visible again. Then the users will go find and recall the memory again like they open a time capsule they buried a long time ago. ","short_description":"Can we use augmented reality to store a memory in a physical place?","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/main.png","title":"memoria","alt":"memoria","caption":"memoria"},"topics":[{"name":"UX\\UI","slug":"uxui"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"88","student_name":"Sean Kim","student_slug":"sean-kim","advisor_id":"129","project_title":"Mindfulness Over Matter","project_question":"Meditation helps us achieve oneness with the world by removing our distracting desires. Breathing and time are all we need for meditation. After all, Shakyamuni Buddha founded Buddhism and popularized meditation without any high-tech tools. However, in the 21st century, people are increasingly dependent on technology. For most, meditation seems mysterious and irrelevant. <i>Mindfulness Over Matter<\/i> is a series of educational technologies that seek to make meditation accessible and entertaining, and inspire people to think about mindfulness. \r\n<br \/>\r\n<br \/>\r\nA brief overview of the technologies I have developed in my search to raise awareness about mindfulness:\r\n<br \/>\r\n<br \/>\r\n<b>Rat Race<\/b>\r\n<br \/>\r\n<br \/>\r\nA fun and engaging art installation\/ game that is a satire of our hyper-competitive society. The more you relax, the faster your robot moves. \r\n<br \/>\r\n<br \/>\r\n<b>WAVR<\/b>\r\n<br \/>\r\n<br \/>\r\nAn EEG + VR headset that uses brainwave states to determine the virtual environment. Depending on the state of the user’s mind, their sensory (visuals, sounds, smells, motions) experience changes.\r\n<br \/>\r\n<br \/>\r\n<b>Mindfulness Fountain<\/b>\r\n<br \/>\r\n<br \/>\r\nAn EEG + AR Headset experience that simulates human delusions, and how meditation can help reveal true reality. The Washington Sq. Park Fountain can be compared to our minds. At times, the fountain flows full of water. Sometimes, there are musicians or magicians performing in the center. Other times the fountain is the center for political protests. Despite the many different experiences and occurrences in the fountain, it is really only a fountain. Similarly, our minds continuously come up with various thoughts and desires. \r\n<br \/>\r\n<br \/>\r\nFor this experience, I fill the fountain with various scenarios: water, magma, earthquake, and blizzards (using virtual augmentations). The EEG sensor measures the user’s level of concentration. If the user focuses, the distracting scenery disappears, so that in the end only the fountain is left. The more the user relaxes, the faster he\/she can reach the true state of reality. ","short_description":"<i>Mindfulness Over Matter<\/i> is series of educational technologies that seek to generate interest about meditation and the importance of mindfulness. With art installations, unique gadgets, and interactive games that combine Mixed Reality and Brain-Computer Interfaces, this project aims to reach a broad audience and revolutionize how we approach mental well-being.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/s3.jpg","title":"sean_thumbnail","alt":".","caption":"Mindfuness Over Matter _"},"topics":[{"name":"Education","slug":"education"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"32","student_name":"Sebastian Morales","student_slug":"sebastian-morales","advisor_id":"123","project_title":"Bots, Cells, and Humans Watching","project_question":"The piece can be accessed through the estuary website [symbiosis.live](https:\/\/symbiosis.live). Here, the digital Internet meets the physical world, connecting servers to a bioreactor. This creates an environment that is subject to both physical and digital influences, transforming it into a peculiar habitat capable of supporting new forms of symbiotic relationships.\r\n<br \/>\r\n<br \/>\r\nAs inorganic living organism (crawlers, fetchers, scraper, spammers, hacking tools, etc.), bots for short, visit the server, their presence is recorded and their behavior studied. What were they looking for? What were they trying to do? Who are they? The information is then used to turn the server into a more alluring honeypot, designed to attract them, and if possible, keep them coming back. \r\n<br \/>\r\n<br \/>\r\nAs bots move through the estuary, going through links and filling out forms, their movement releases food into the paramecia bioreactor. Paramecia are single-cell eukaryotic organisms belonging to the kingdom of Protista. They are neither plants, nor animal, nor fungi. They flourish on bodies of water and were in fact among the first microorganisms seen through a microscope back in 1665 by Antoni van Leeuwenhoek. The paramecia living inside the estuary website were collected from distinct areas of New York City, including puddles, fish tanks and Central Park.\r\n<br \/>\r\n<br \/>\r\nLast come the Humans Watching. The website is designed to distinguish between Bots and Humans, in fact it looks very different to each. When a bot visits the website, a new page is generated to fulfill the bot’s request. When humans visit, they are presented with a live video stream of the paramecia through a microscope, they can telepresently control the microscope and explore different parts of the microscopic environment. Humans can also see a live log of recent bots roaming through the server, observe their behavior and intentions. Humans do not have direct agency or influence over the system.","short_description":"<i>Bots, Cells, and Humans Watching<\/i> is a speculative ecosystem where inorganic life forms from the internet and single-cell organisms come together in symbiosis. Humans are invited along, but only as observers.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnailCrop.jpg","title":"bots, cells and humans watching","alt":"internet connected microscope, bioreactor and internet bots","caption":"internet connected microscope, bioreactor and internet bots"},"topics":[{"name":"Installation","slug":"installation"},{"name":"Performance","slug":"performance"}]},{"student_id":"87","student_name":"Sharif Al-hadidi","student_slug":"sharif-al-hadidi","advisor_id":"129","project_title":"Odyssey","project_question":"<i>Odyssey<\/i> is a set of features of a proposed larger application suite meant to assist authors, writers, journalists, and students write and organize all their research in one location. This version of the application focuses solely on audio\/video transcription. <i>Odyssey<\/i> seeks to fill a gap within the market for writing tools, as well as improving the experience and helping users save time through automation. I developed a tool to accurately and quickly transcribe multimedia files using two APIs: IBM Watson and Google Speech. Users are provided time stamped and color coded transcripts in order to easy find and correct inevitable mistakes. A user can click on a word within the transcript to start playing the specific audio\/video file from that point. This serves two purposes: to retrieve correction recommendations for edits as well as allowing for users to resume a file from a specific location within the file. ","short_description":"<i>Odyssey<\/i> is an online tool that helps writers, podcasters, and interviewers upload and transcribe their audio or video files making it easy to search through files.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/Odyssey-Logo.png","title":"Odyssey Icon","alt":"Odyssey Icon","caption":""},"topics":[{"name":"Data","slug":"data"},{"name":"Tool\\Service","slug":"toolservice"}]},{"student_id":"35","student_name":"Shelley Hu","student_slug":"shelley-hu","advisor_id":"123","project_title":"The Act of Receiving","project_question":"The Act of Receiving is a series of performance art pieces and digital installations examining what it means to be a receiver of information.\r\n<br \/>\r\n<br \/>\r\nAct I is an experiment where I give my audience the power to control all my information input.\r\n<br \/>\r\n<br \/>\r\nThis is a performance piece where I sit in a virtual reality headset, but have no control of what I see. My audience can decide from online to show me any YouTube videos they want. They will be able to see what I am seeing in VR at the moment, and a live stream of my reaction to their content. Once the video is submitted, it's immediately mapped onto the four “walls” in my virtual environment, so I will not be able to look away from any point of view. The videos would keep on playing in loop, until another one is submitted.\r\n<br \/>\r\n<br \/>\r\nAct II is a broadcast of my real-time interaction with information.\r\n<br \/>\r\n<br \/>\r\nThis is a performance piece where I live stream my interaction with my phone for 12 hours. The screen of my phone is shared and streamed online, along with a streaming of myself. I interact with my phone the same way I would on any other day (reply messages, check emails, scroll instagram, etc.). \r\n<br \/>\r\n<br \/>\r\nAct III is an invitation for others to experience my history of receiving information.\r\n<br \/>\r\n<br \/>\r\nThis is a VR installation where viewers physically stand on a treadmill. As they walk forward, in the virtual environment, they are scrolling through a room-sized, simulated chat window with the entire WeChat conversation history between me and my mother for the past six years, experiencing voice messages, texts, images, videos, etc. fading in and out.","short_description":"<i>The Act of Receiving<\/i> is a series of art works examining what it means to be a receiver of information.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnail-6.jpg","title":"thumbnail","alt":"shelley_thumbnail_small","caption":""},"topics":[{"name":"Performance","slug":"performance"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"90","student_name":"Shivanku Kumar Fnu","student_slug":"shivanku-kumar-fnu","advisor_id":"129","project_title":"NewChat: All the News That&#8217;s Fit to Chat","project_question":"Social content curation is a great way to discover interesting content on common topics of interest among friends. When there are 40,000 articles getting published every week on one topic, as was recorded for Bitcoin in December 2017, we need some help from our friends to identify which ones are important. Social media platforms started off as great tools to do this. But content sharing on social media has declined by 50% over the last couple of years, with fewer people sharing most of the content. \r\n<br \/>\r\n<br \/>\r\nThis trend has increased the possibility of bias in content on these platforms, and eroded their utility as conduits for healthy media consumption. As content sharing on social media declines, private sharing on chat apps has increased. In fact, 65% of total content shared was on private chat applications in 2017. <i>NewChat<\/i> is an application that embraces the increasing tendency toward private sharing, by exploring the content curation opportunities this social shift presents.\r\n<br \/>\r\n<br \/>\r\nAnd it’s not just about the quantity of content. The quality of content shared on chat applications is much different than that on social media platforms. When you replace the functionality of broadcasting one’s message, a common feature among all social networking platforms, with peer to peer conversations, the motive of sharing changes which has a huge impact on the kind of people who share content.\r\n<br \/>\r\n<br \/>\r\nUnlike social media, chat applications do not have a concept of popularity which invites a diversity of people to share the content that interests them. Which is not to say that content on chat apps is always better, we have heard of the cases of fake news spreading through WhatsApp forwards. This makes testing chat apps as content curation platforms very interesting. <i>NewChat<\/i> explores this possibility by introducing the concept of public feed and system recommendations into a chat environment.","short_description":"This project looks at the current challenges in news consumption. Content overload combined with inefficient content curation is identified as the root cause of the problems. A new platform is proposed which aims to make social collaboration inclusive and effective, it is a mobile app called <i>NewChat<\/i>.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/Thumbnail-3.jpg","title":"new chat","alt":"This is a placeholder logo for the app","caption":""},"topics":[{"name":"Society","slug":"society"},{"name":"UX\\UI","slug":"uxui"}]},{"student_id":"51","student_name":"Siman Li","student_slug":"siman-li","advisor_id":"119","project_title":"The Crossings 渡","project_question":"<i>The Crossings<\/i> 渡 is a sculpture that in the shape of both mountain and artist's own body, with projection of seasons changes animation that represents the changes happen in life. While the animation changes, the sculpture itself seems to change in form, and provoking the audience's different emotions.  \r\n<br \/>\r\n<br \/>\r\nInspired by the ancient Chinese landscape painting style, this work is a visual, aural and olfactory interpretation of the Buddhist concept—relief. Using the technique of 3D scanning, the body of the artist was captured, broke down and deformed into the shape of landscape. The 3D model was used to generate physical simulation animation to represent four seasons, using different color, form and dynamic to stimulates the audience’s imagination that is abstract, ancient, futuristic and poetic.  \r\n<br \/>\r\n<br \/>\r\nThis work is a continuation of the artist’s exploration into the examination of traditional Chinese aesthetic and philosophy, by extracting, exploring and extending the core elements within a contemporary discourse without being bound by the formal restraints of tradition.","short_description":"<i>The Crossings<\/i> 渡 is a multidimensional installation that uses visual, aural and olfactory interpretation of the buddhist concept relief. Using projection, sound and human body to stimulates the audience’s imagination that is abstract, ancient, futuristic and poetic.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumb-2.jpg","title":"thumb","alt":"thumb","caption":"d"},"topics":[{"name":"Culture","slug":"culture"},{"name":"Installation","slug":"installation"}]},{"student_id":"89","student_name":"Stephanie Koltun","student_slug":"stephanie-koltun","advisor_id":"129","project_title":"How Thrilling","project_question":"As an installation, 'How Thrilling' explores these three themes by creating different relationships across contexts. A context is composed of bodies and technology, which together establish an expectation for people to behave and perform. Central in all scenes of the installation is the performance (and identification) of the body — whether that be as dancing, watching, or both. <br \/>\r\n<br \/>\r\nHow do contexts come together to give meaning to each other? How do we perform differently in different contexts? How is expectation for performance established and understood in a context?\r\n<br \/>\r\n<br \/>\r\nFrom the earliest artworks to the printed book to streaming video, technology has extended one’s capacity to represent oneself. But technology also extends one’s capacity to identify ourselves and others. Through computer vision and machine learning, this capacity to identify is extended to technology—independently of a contingent and changing psyche, or as an extension of the psyche who made it.\r\n<br \/>\r\n<br \/>\r\nContext as the situation of and relationships between, technology and bodies in space. Context establishes an expectation for performance, from which bodies are identified. A public restroom, a library, and a sports field are all examples of where a combination of signs, objects, uniforms, and spatial arrangements, are used to identify and enforce an expectation of a particular performance.\r\n<br \/>\r\n<br \/>\r\nContingency of the body-psyche can mean choosing to participate, where an example might be rejecting a gendered discourse through drag as discussed by Judith Butler. But there’s also contingency in the material condition of the body. Bodies come in all shapes, sizes, and capacities. Because of this contingency, our bodies may or may not be identified by the expected standards of a technology. ","short_description":"<i>How Thrilling<\/i> is an installation where people are expected to dance. Dancing, and seeing others dance, is used to explore how both context and technology shape our performance. Using elements from Michael Jackson's song \"Thriller\" — the icon, the choreography, the zombies — different expectations are established in different places.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnail-14.jpg","title":"thumbnail","alt":"a still from Michael Jackson's \"Thriller\"","caption":""},"topics":[{"name":"Performance","slug":"performance"},{"name":"Play","slug":"play"}]},{"student_id":"72","student_name":"Steven Simon","student_slug":"steven-simon","advisor_id":"124","project_title":"BrowseBetter","project_question":"The internet has become a constant presence in our daily lives. Whether we use it to pay our bills, book our next travel destination, or access our medical information, the internet serves as an important tool in completing everyday tasks. As technology has continued to advance, the internet’s ability to learn who we are has become a key element in crafting user experiences. Yet, these ever changing advancements raise the question of whether intelligent websites can positively enhance or negatively complicate a users belief and experience when using the internet. \r\n<br \/>\r\n<br \/>\r\nThus, users begin to wonder how much control they have over their own individual experience and how this can impact their satisfaction, confidence, and trust in the websites they use regularly. Is there a way for the internet to be equally accessible to all individuals possessing different capabilities and preferences while putting the user in control of their own experience? Research suggests that user beliefs and satisfaction, in regard to web design, are greatly impacted by ease of use and familiarity. Therefore, user preferences within a website design should be used to create a customized user experience because it will increase user satisfaction and productivity.","short_description":"<i>BrowseBetter<\/i> is a website where users can log into a personalized account and experience outside websites through their own customized filter settings. This allows users to quickly and efficiently browse online, enhancing their overall user experience.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/browseBetter_thumbnail.jpg","title":"BrowseBetter","alt":"BrowseBetter","caption":"BrowseBetter"},"topics":[{"name":"Tool\\Service","slug":"toolservice"},{"name":"UX\\UI","slug":"uxui"}]},{"student_id":"73","student_name":"Swapna Joshi","student_slug":"swapna-joshi","advisor_id":"124","project_title":"MoleculAR : interactive chemistry kit","project_question":"Given the rapid rate and growing complexity of scientific breakthroughs, it is increasingly important for children today to be exposed to the basics of science long before plunging into the rigors of high school level classes. I developed a particular interest in pre-high school level chemistry after my mother, who is a middle school chemistry teacher, told me about the difficulties her students were having visualizing basic chemistry concepts on a molecular level.\r\n<br \/>\r\n<br \/>\r\n<i>MoleculAR<\/i> is a middle school chemistry kit that consists of physical cards representing the elements in the periodic table, a paper playground and an augmented reality app. The augmented reality component works like a magic window that converts the paper printed periodic table into other wordly, playful interactions. When the students scan individual element cards with their phones, the AR animations they see introduce them to different chemistry concepts, such as the electronic configuration and reactivity of elements. When two element cards are placed side-by-side on the paper playground, then scanned together, the resulting AR videos explain the formation of compounds and bonds. \r\n<br \/>\r\n<br \/>\r\nAlthough designed for use in a classroom environment, <i>MoleculAR<\/i> can also be used as a stand-alone kit for parents to use to introduce chemistry concepts to their children at home.","short_description":"<i>MoleculAR<\/i> is an interactive visual-spatial kit that helps middle school students visualize chemistry concepts on a molecular level. The kit is comprised of periodic table element cards, a paper playground and an AR app. The aim is to evoke curiosity by progressive disclosure and playful learning.\r\n\r\n","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumb-1.jpg","title":"kid interacting with MoleculAR","alt":"kid interacting with MoleculAR","caption":"kid interacting with MoleculAR"},"topics":[{"name":"Education","slug":"education"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"53","student_name":"Tiriree Kananuruk","student_slug":"tiriree-kananuruk","advisor_id":"119","project_title":"DeepTalking","project_question":"We try to build machines to look as life-like as possible. Computers today can learn and be trained just like humans. What is a human? What determines if a being is human?\r\n<br \/>\r\n<br \/>\r\nHumans make mistakes, this translates to machines as well. As a user of technology, I have found that machines can glitch and run into errors often. Can these errors be a sign of humanity within machines?\r\n<br \/>\r\n<br \/>\r\nThe study of cybernetics—intelligent learning systems that study and learn from feedback and mistakes within their code. 'Feedback' is the communication between two things, it is a process of learning and evolving. How can I utilize this process within my own artistic creative process?\r\n<br \/>\r\n<br \/>\r\nAs a performer, things have gone wrong almost every time I have performed. I have even created a machine to perform predictably, yet things will still go wrong. Does this mean its a 'live performance'? Things that you can not feel in the pre-recording process when the machine or other outside factors go wrong, I have learned to embrace machine malfunctions as a new form of improvisation. To solve a problem onstage is a good exercise for performers and artists to practice improvisation. Improvisation creates an unpredictable, original, and unique new art form.\r\n<br \/>\r\n<br \/>\r\nFor my thesis, I created bots to be able to listen and respond to humans, using machine learning to generate new narrative techniques in unpredictable ways. The goal of my performance is to improvise on top of mis-informed and mis-trained programs using human vocals to add harmony. In doing so, performers will be required to listen carefully to the chaotic bots, then sing and respond along with bots.","short_description":"Can technology be trained to deliberately commit mistakes in order to help spark creative improvisation in performers and artists?","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/forthesisarchive.jpg","title":"forthesisarchive","alt":"DeepTalking- performance show. Tiri and Jann sing along with 10 bots","caption":"DeepTalking- performance show. Tiri and Jann sing along with 10 bots"},"topics":[{"name":"Machine Learning","slug":"machine-learning"},{"name":"Performance","slug":"performance"}]},{"student_id":"34","student_name":"Utsav Chadha","student_slug":"utsav-chadha","advisor_id":"123","project_title":"Philosophycal \/ Feel-oh-so-fickle","project_question":"<i>Philosophycal<\/i> is a web and voice-based experimental project that can be used to translate lengthy works of philosophy into conversational experiences. Conceptually, it creates a real-time dialogue between philosophical books and a participant. Technically, the project uses existing corpuses of philosophy to conduct text analysis in order to simulate an interactive context-driven conversation.","short_description":"Can we use art and technology to reinterpret the process of reading philosophy, and construct it into a conversational interactive experience?","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/logo.png","title":"logo","alt":"philosophycal-logo","caption":""},"topics":[{"name":"Machine Learning","slug":"machine-learning"},{"name":"Narrative","slug":"narrative"}]},{"student_id":"55","student_name":"Wenqi Li","student_slug":"wenqi-li","advisor_id":"119","project_title":"Metron Busker","project_question":"<i>\"It was in the streets that the demonstrations took place. It was in the streets that spontaneity expressed itself.\" — Harriet Hawkins<\/i>\r\n<br \/>\r\n<br \/>\r\nThe public arena of the street is where performers can insert new, dynamic, stirring, living experiences into a highly commercialized context. It is where moments of sociality and conviviality are created in everyday life.\r\n<br \/>\r\n<br \/>\r\nIn contrast to the absence of authorship that often defines graffiti or public art installations, street performance—especially busking—puts the spotlight directly on the author. A busker’s performance is shaped by their mood, their stories and their connection to the site of performance. Busking is a robust form of self-expression. \r\n<br \/>\r\n<br \/>\r\nStemming from my interest in this potential for self-expression and in acts of intervention to the public space, my thesis <i>Metron Busker<\/i> is an exploration of my creative approach toward busking. I use it to reposition myself as a busker delivering a performance as an escape from the burden of conflicting emotions.\r\n<br \/>\r\n<br \/>\r\nThe toolkit backpack equips me with a web application and networked electronics. The web application takes input parameters for algorithmic remixing, and the networked electronics boost the musical expression through street-ready speakers and screens. Together they broadcast the generative audio and video, live streaming straight to the audiences' smartphones.\r\n<br \/>\r\n<br \/>\r\nThe metal, black-framed backpack with its array of functional electronics serves as a metaphor of burden, connecting the stress of living in a tech-driven age with the physical feeling of carrying a heavy load. This toolkit can be used for all kinds of audio-visual performance seeking to utilize such a concrete expression of burden. It is the conflicting eagerness and fear, expectation and forbiddance from where my burden of anxiety arises. \r\n<br \/>\r\n<br \/>\r\nTo expose eagerness and fear to the public and harness them for listening pleasure is the busking way to overcome these feelings. The audiences will be subjected to an arc of intensity, experiencing the vulnerable, the overwhelming and the vital.","short_description":"<i>Metron Busker<\/i> is my strategy for intervening in the urban space as a street performer, using a networked toolkit. <i>Metron Busker<\/i> is a performance enabled by tools, and it is also the toolkit that enables the performance.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/final-banner.png","title":"metron busker","alt":"a man wears a high tech backpack","caption":""},"topics":[{"name":"Performance","slug":"performance"},{"name":"Tool\\Service","slug":"toolservice"}]},{"student_id":"74","student_name":"Woo Hyun Kim","student_slug":"woo-hyun-kim","advisor_id":"124","project_title":"Guidr","project_question":"Data reveals that my generation today is more inclined to share and crowd-source than to own. We’re in the “Uberization” period where open-source communities and peer-to-peer based sharing of goods and services are on the rise. People are sharing their personal belongings, cars, houses, and even experiences, which has lead to the shift in how Millennials travel.\r\n<br \/>\r\n<br \/>\r\nTraditional tour guides and travel books don’t appeal to Millennials anymore. We’re the type that crave the “hidden gems on the road less traveled.” And to achieve this kind of out-of-the-ordinary experience, Millennial travelers typically do an excessive amount of research, primarily through the Internet, and closely after, by word-of-mouth (WOM) referrals, which have been proven to be one of the most effective forms of persuasion.\r\n<br \/>\r\n<br \/>\r\n<i>Guidr<\/i> is a map-based website that consolidates travel experiences, in the form of personal recommendations. Travelers create and host interactive maps to share it amongst friends, family members, and like-minded travelers who can offer recommendations. Who better than the people who know you to advise on the most reliable recommendations? All invited contributors can search and add markers (places to visit) to the same map, accompanied by tips, notes, or media—a collection of trusted and valued input, under the basis of personalization.\r\n<br \/>\r\n<br \/>\r\nThrough personalized suggestions that are more than just a street address, Guidr aims to transform a mere space (a location with no substantial meaning, social ties, or value) to a memorable place (a location made meaningful by human intervention). Studies show that “travel experiences are more worthwhile when shared with somebody else.” <i>Guidr<\/i> acts as that platform where trusted communities come together to make experiences in unfamiliar locations more worthwhile. All along, enhancing the connection between like-minded explorers. Let Guidr <i>guide<\/i> you on your next expedition.","short_description":"How can sharing experiences of travel enhance connectedness? This travel recommendation tool is built for explorers who seek obscure yet meaningful discoveries in their expeditions through personal and connected stories of travel from their trusted network.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnail3.png","title":"Guidr Thumbnail","alt":"Guidr Thumbnail","caption":"Guidr Thumbnail"},"topics":[{"name":"Tool\\Service","slug":"toolservice"},{"name":"UX\\UI","slug":"uxui"}]},{"student_id":"54","student_name":"Woraya Boonyapanachoti","student_slug":"woraya-boonyapanachoti","advisor_id":"119","project_title":"(Dis)connect","project_question":"Today's communication environment is heavily reliant on smartphones. These devices provide otherwise impossible forms of communication, but the consequence of its usage is not always real closeness. When you went to a restaurant a few years ago, you would normally see people talking to one another – having direct, face-to-face interaction. Nowadays, it is common to see a family sitting a table in silence, eyes staring at screens, while they have conversations with people not present in the room itself.\r\n<br \/>\r\n<br \/>\r\n<i>(Dis)connect<\/i> provides a designed virtual playground in which two players can uncover these hidden repercussions and reflect on their relationship with each other and with their phones.The experience is meant for the HTC Vive platform but it excludes the native Vive controllers, substituting them with smartphones. Using Unreal Engine and Socket.IO, the player's tap and scroll gestures are registered and used to impact their digital environment. This way, it is through their instinctive actions on a touch-screen interface that users progress through the experience.","short_description":"<i>(Dis)connect<\/i> is a speculative multiplayer virtual reality experience that explores how we connect with ourselves and with each other through our smartphones.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/Thumbnail_2.jpg","title":"(Dis)connect","alt":"(Dis)connect","caption":""},"topics":[{"name":"Play","slug":"play"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"112","student_name":"Xitong Xu","student_slug":"xitong-xu","advisor_id":"131","project_title":"The Birth of the Self Portrait (1889)","project_question":"This project is a tribute to Vincent Van Gogh, and his famous self-portrait oil painting from  1889, by converting the post-impressionist static painting into a dynamic storytelling platform  through an AR platform.\r\n<br \/>\r\n<br \/>\r\nWhat's the story and creation process behind this legendary self-portrait? What happened to the artist and his life right before this painting was finished? What’s the environment? The static painting itself it's just the very last frame of this whole story. This platform aims to address this buried yet consequential information within the painting itself amplifying this contextual information through the colors and brush strokes on the final piece.\r\n<br \/>\r\n<br \/>\r\nVan Gogh went through a lot in 1889, and in his letters to his brother, he wrote about the influence of many things on himself and the continuous impact this had on his psyche and artistic sensibilities all of which greatly influenced his creations.The creation story and the painting are not mutually exclusive, they depend on each other and give each other adde depth, nuance, and impact.\r\n<br \/>\r\n<br \/>\r\nThis AR project is about expressing the mutually reinforcing relationship between the creation story and the artwork. The existing way for the audience to do that is reading the description labels in the museum next to the painting, the experience is not immersive enough. This platform can shift our perceptions of art, history, storytelling, context, and experience. When you run the AR application on the mobile device and focus the screen onto the Self-Portrait (1889) painting, the audience is going to see the animation of the birth story of this painting. It takes the painting and translates it into real-time virtual animations. Also, the visualization sends the paint daubs of the self-portrait into swirling patterns of motion, the brush strokes will be animated into dynamic flows.","short_description":"This project is a portrait of the portrait of Vincent Van Gogh that he completed in 1889. I am using AR technology to layer the history and emotional and lived experience of Van Gogh at that time. It aims to use new technologies to explore the multi-faceted layers of storytelling and history that are often absent in two-dimensional paintings hung in a gallery or museum.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/archivethumb.png","title":"The birth of the portrait","alt":"The birth of the portrait","caption":""},"topics":[{"name":"Narrative","slug":"narrative"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"75","student_name":"Yanlin Ma","student_slug":"yanlin-ma","advisor_id":"124","project_title":".5 Square Meter Land of My Hometown","project_question":"Can listening remotely to the sounds of the changing weather patterns in my hometown help me feel more emotionally connected? For people who live far away from their families and friends back home, a ten-minute phone call or a daily weather check isn’t always enough to help them feel connected. \r\n<br \/>\r\n<br \/>\r\nFor my thesis project, I’m trying to translate local weather data into sound effects and build a related set of installations designed to bring the experience of my hometown weather to me in-real-time. <i>.5 Square Meter Land of My Hometown<\/i> is an installation that simulates the sounds of my hometown in real time.","short_description":"An installation designed to translate local weather data into sound effects and bring the experience of my hometown weather to me in real-time.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnail-1.jpg","title":"thumbnail","alt":"thumbnail","caption":""},"topics":[{"name":"Data","slug":"data"},{"name":"Installation","slug":"installation"}]},{"student_id":"37","student_name":"Ye Lu","student_slug":"ye-lu","advisor_id":"123","project_title":"Lotus Baby","project_question":"<i>Lotus Babe<\/i> is an interactive video game based on Eko studio. The creator uses the very simple and cute animation to create the feeling of childhood. When playing the video game, players are going to make 12 choices, and the questions will include the child’s grow-up atmosphere, the child’s accomplishment, the child’s marriage… in a word, the player is making every important decisions and really build up a person!\r\n<br \/>\r\n<br \/>\r\nPart of the content are from a popular post in Chinese forum Zhihu: “What did your parents do that hurts you most?”\r\n<br \/>\r\n<br \/>\r\nDuring this game, the player will think about some tiny details which they never pay attention to, which can hurt a child badly; also they will be offered the power to change a person’s life. Will you also be an awful parent? What do you care most when you get along with a little child? (e.g. If you receive a phone call which ask you out for a really attractive party, while you've promised to spend time with your little child, what will you do?)","short_description":"An interactive animation game which let the players build a 'perfect' child from scratch, giving people a cultural context of China during the recent few decades, make them think about the severe generation gap in China.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/cover.png","title":"cover","alt":"123","caption":""},"topics":[{"name":"Culture","slug":"culture"},{"name":"Identity","slug":"identity"}]},{"student_id":"92","student_name":"Yeseul Song","student_slug":"yeseul-song","advisor_id":"129","project_title":"Invisible Sculptures","project_question":"In a gallery setting, there are five identical display plinths. Each holds an invisible sculpture.\r\n<br \/>\r\n<br \/>\r\n<i>Sculpture I<\/i> is a solid 3d form made of sound. To experience the work, move your hand over the plinth. Concentrate all of your senses to find the connection between what you touch and what you hear. You will soon find yourself in the land of synesthesia. Once you are aware of the shape, try to recreate the form using a handful of clay that will be handed to you.\r\n<br \/>\r\n<br \/>\r\n<i>Sculpture II<\/i> is an obscure pattern floating on top of the second plinth. Move your hand over the plinth to hear and experience the sculpture. Is it rough or soft? Is it dense or light? Is it spiky? \r\n<br \/>\r\n<br \/>\r\n<i>Sculpture III<\/i> is made of heat. \r\n<br \/>\r\n<br \/>\r\n<i>Sculpture IV<\/i> is made of cold air.\r\n<br \/>\r\n<br \/>\r\n<i>Sculpture V<\/i> is stinky… You might not want to get too close to this one! The sculpture accompanies a video piece of the artist trying to create a large invisible sculpture with the smell of a durian at Grand Central Station.\r\n","short_description":"<i>Invisible Sculptures<\/i> is an experiment that challenges human perception with sculptures that can only be “seen” by senses other than vision. The audience will incorporate different sensory abilities and activate their imagination to interact with the sculptures made of sound, temperature, and smell.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/invisible_thumbnail-1.jpg","title":"invisible_thumbnail","alt":"thumbnail","caption":""},"topics":[{"name":"Installation","slug":"installation"},{"name":"Tangiable","slug":"tangiable"}]},{"student_id":"36","student_name":"Yihan Chen","student_slug":"yihan-chen","advisor_id":"123","project_title":"Perfect Housewife","project_question":"If I were a housewife, what would I need in order to fill that role flawlessly? <i>Perfect Housewife<\/i> is a toolkit customized for a fictional role I assigned onto myself. It is designed as a series of machines for this imaginary character, accompanied by a manual(performance) that explains their ‘perfect usage.’\r\n<br \/>\r\n<br \/>\r\nThese kinetic installations include a chopping knife that helps me avoid the strong smell of onions, a lulling hand machine that assists to calm a baby to sleep and allows me to continue playing on my phone, an iron steak cooker, and a machine that encourages me and my other machines to finish my work.\r\n<br \/>\r\n<br \/>\r\nObjectively, these machines are useless, because of the nature that this perfect role does not exist. In the performance, I try to make everything perfect as a housewife and pretend that everything is under control. In this context, the role of ‘housewife’ is an over exaggerated symbol. Through the clumsy, repetitive, strange, and even violent mechanical movements of these imperfect machines, I aim to express resistance to prevalent attitudes relating to woman’s household labor. I consider this performance as an experiment of challenging the perceptions of women as housewives.","short_description":"A toolkit of mechanical machines designed for a fictional feminine role, <i>Perfect Housewife<\/i> is an installation that examines entrenched ideas about woman’s household labor. It offers resistance through humor and self-examination.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/Yihan_Thesis_01_320x240.jpg","title":"Yihan_Thesis_01_320x240","alt":"11","caption":""},"topics":[{"name":"Installation","slug":"installation"},{"name":"Performance","slug":"performance"}]},{"student_id":"18","student_name":"Younho Lee","student_slug":"younho-lee","advisor_id":"114","project_title":"The World of Reverie","project_question":"<i>The World of Reverie<\/i> is a mobile app that allows users to experience a poetic moment in their familiar places. Users can select a phrase from text corpus related to the places and juxtapose the phrase along with scenery with the capability of Augmented Reality.\r\n<br \/>\r\n<br \/>\r\nIt will invoke a different emotion about the places that you have never had. The first edition is for myself and those who live in New York City. 18,163 phrases parsed from 451 lyrics inspired by the city are ready for you as a source of inspiration. The whole city will be transformed into poetic space that makes you fall into a reverie. \r\n<br \/>\r\n<br \/>\r\nIt is also for experimenting with creating and collecting a dataset about places in a different way. Activities of associating a phrase with a particular place eventually become a process of analyzing and contextualizing the raw data (text corpus). While users take a journey with using the app, they can naturally transform the text corpus into reinterpreted, personalized data. Finally, users can have a collection of their own poetic experiences about places.","short_description":"What if we could experience a poetic moment with text corpus related to familiar places to invoke a different emotion about the places?","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnail1.jpg","title":"thumbnail","alt":"thumbnail","caption":""},"topics":[{"name":"Data","slug":"data"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"56","student_name":"Yuan Chen","student_slug":"yuan-chen","advisor_id":"119","project_title":"Google-Qt","project_question":"Voice assistant starts to become a daily thing at home today, and a new trend of human-computer interface in the future. But all of them basically remain as a virtual character behind a cold object with non-emotional response. Our user expectations related to sensing and responding with emotion are unfulfilled by now, and it mentally disconnect user and machine in some level.\r\n<br \/>\r\n<br \/>\r\nIn order to make voice assistant more delightful, attractive and engaging, my thesis project, <i>Google-Qt<\/i>, is an exploration of new voice assistant interface, that embody the assistant’s personality by animatronic eye expressions, react emotionally according to the contents of conversation. Eyes and eyebrows are the most important parts in facial expression system to effectively convey emotions. Different combinations between eye expressions and sentences even generate richer, funnier meaning of responses.\r\n<br \/>\r\n<br \/>\r\nAs a result, <i>Google-Qt<\/i> not only keeps the full function of google home, but also has additional expressive possibilities to expand user experiences. ","short_description":"<i>Google-Qt<\/i> is a new version of google home with animated eye expressions, that react emotionally to your voice input according to its own personality.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnail-3.jpg","title":"thumbnailaaa","alt":"thumbnail","caption":"thumbnail"},"topics":[{"name":"Tangiable","slug":"tangiable"},{"name":"UX\\UI","slug":"uxui"}]},{"student_id":"38","student_name":"Yueping Wang","student_slug":"yueping-wang","advisor_id":"123","project_title":"Speakspeare: Theater Speech Recognition","project_question":"While there are many creative software applications for audio and visual art, not so much are done when it comes to the theater. Indeed, theaters will lose their audience to other multimedia entertainments if they don’t effectively embrace and leverage the power of digital technology.\r\n<br \/>\r\n<br \/>\r\nBeginning in the early 1990s, videos have been used in theater performances - but not very often. Through my research and interview with theater designer, I found that there are two main difficulties when adding video projection in theater design: the high financial cost of equipments and technical support to professionally implement projection, the difficulty of timing the video content to ensure that they are injected at the 'right moment' (often by using human labor), and corresponding to the plot and actors’ expressions.\r\n<br \/>\r\n<br \/>\r\nBy building on top of Natural Language Processing technology, <i>Speakspeare<\/i> aims to solve the second problem by synchronizing live speech with digital media output, and hopefully by automating scenic control and reducing human labor, lower the cost of projection design.","short_description":"<i>Speakspeare<\/i> is an interface that allows stage projection mapping to change according to live speech—on stage, in real time. It connects stage design with live speech, and thus gives new creative options to projection designers, and empowers performers to act more freely on stage.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnail-5.jpg","title":"thumbnail","alt":".","caption":""},"topics":[{"name":"Performance","slug":"performance"},{"name":"Tool\\Service","slug":"toolservice"}]},{"student_id":"19","student_name":"Yuhan Zhang","student_slug":"yuhan-zhang","advisor_id":"114","project_title":"Gold Hunter","project_question":"<i>Gold Hunter<\/i> is an AR game app that allows user to play with their friends together in real-time. During the game, targets will pop up randomly in the space, the user need to hold the phone to move around discovering the target, and tapping on the screen to shoot the bullet to destroy the target. The user need to compete with their friend to shoot the targets to win more scores.\r\n<br \/>\r\n<br \/>\r\nI always believe connecting people is very important for every new technical tool. So for AR, I tried to build a sharable experience through a playful way, like a multi-user game, competing with your friend in real-time.\r\n<br \/>\r\n<br \/>\r\nDoing multi user AR in real time is still vary challenging. For this real-time experience to happen, the devices need to constantly do accurate and robust relocalization in order to synchronize other device’s location and content display, which is still one of the outstanding hard problems for AR.\r\n<br \/>\r\n<br \/>\r\nI used Swift, which is a native IOS programming language to develop this app. And as well as ARKit, which is a library that Apple built for doing Augmented Reality function on IOS devices.","short_description":"How can I create an AR game that involves 2-3 people of any age, that is fun, brings them joy and surprises?","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/coin@1x.jpg","title":"coin@1x","alt":"AR Thumbnail","caption":"AR Thumbnail"},"topics":[{"name":"Play","slug":"play"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"113","student_name":"Yunho Choi","student_slug":"yunho-choi","advisor_id":"131","project_title":"Let Me Give Light","project_question":"How can light and emerging technology create a more empathetic society? According to Ian Ashdown, the Chief Scientist of Lighting Analysts Inc., the thought “giving light” is clearly an abstraction, it shifts the focus from designing for the illuminated environment to designing for people[1]. \r\n<br \/>\r\n<br \/>\r\nLighting technology has been developed over the past two centuries, bringing not only countless paradigm shifts in its hardware but also how we think about light and lighting. While we naturally think of light as something which illuminates the space around us, fire occupied a pivotal role in the religious beliefs of in ancient days and now candlelight is still widely used from meditation to social movements like tribute ceremonies or protests.\r\n<br \/>\r\n<br \/>\r\nSo I started to imagine—what if the most recent lighting technologies can mimic the restorative properties of ancient light? How can I design them as a new mean of interaction between human and physical environment by giving light, not only for the purpose of illumination? \r\n<br \/>\r\n<br \/>\r\nIn my thesis, I used augmented reality and smart light networks in order to create virtual lights and make a connection between them. In the first section of <i>Let me give light, <\/i> audiences can create and send the virtual light to the physical light by blowing into their smartphones. In the second section <i>Let us give light,<\/i> multiple audiences can create a collaborative audiovisual sculpture by recognizing a light installation which has an AR marker.","short_description":"<i>Let Me Give Light<\/i> is a series of mixed-reality environments that repurposes ancient lighting technology in a modern context, inviting audiences to a meaningful and connected experience from their everyday life.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/test_thumnail2.jpg","title":"thumnail","alt":"thumnail","caption":"thumnail"},"topics":[{"name":"Installation","slug":"installation"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"91","student_name":"Yuqiao Qin","student_slug":"yuqiao-qin","advisor_id":"129","project_title":"Vuja De","project_question":"When was the last time you paid attention to your breath, the magic gift we all receive when we first arrive in this world? Breathing is a deep connection between our interior bodies and the outside world and it records every step we live as human beings. We breathe differently when we are curious, when we feel appreciated, and when we are close to danger. \r\n<br \/>\r\n<br \/>\r\n<i>Vuja De<\/i> is an immersive virtual experience that welcomes users to a journey that responds to their breathing. By generating a unique experience in virtual space, it is meant to help users re-sensitize themselves as humans, and reaffirm physical and spiritual inter-connections. \r\n<br \/>\r\n<br \/>\r\nThe experience is built around three moments that are central to any human life—the moment of birth, a moment of wandering, and the embrace of a dream. The user’s breath is captured by a microphone embedded in the headset, which sends output into the digital environment that the user inhabits.","short_description":"<i>Vuja De<\/i> is a virtual reality experience that explores the connection between virtual and physical space. It is a 3-minute-long interactive voyage through the cycle of life, which creates an embodied experience by creating an emotionally compelling world that responds to the user’s breathing.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/vujade.jpg","title":"vujade","alt":"breathe deeply","caption":""},"topics":[{"name":"Narrative","slug":"narrative"},{"name":"VR\\AR","slug":"vr-ar"}]},{"student_id":"57","student_name":"Yutong Zhang","student_slug":"yutong-zhang","advisor_id":"119","project_title":"Self Pool","project_question":"<i>Self Pool<\/i> is an interactive collection of sculptures that invites the audiences to make a choice from two fishes in the same pool under the confusion of identifying the real ego.\r\n<br \/>\r\n<br \/>\r\nIn this surviving game, a fishing rod is standing in the middle of the two fish sculptures and each fish only owns part of the self. One is speaking with the absence of a face, asking viewers to come in help and not look at the other side, while a face shown on a screen is embedded in another’s head, silently moving its mouth. The power is open to the audiences. They need to reflect on which side them believe more in representing ego, the face or the voice.  \r\n<br \/>\r\n<br \/>\r\nIn order to save one side, audiences have to put their head into the fish head and lend a part of their own body. For the face-side, audiences need to accurately read the English scripts on the hidden screen in fish head and be judged by speech recognition. For the voice-side, audiences’ faces are asked to be put at the right position and fill the hole. Fishes get power based on how fast people finish the line or how long they keep their face still. This power is shown by the spinning fishing rod which will fish the less powerful side.\r\n<br \/>\r\n<br \/>\r\n<i>Self Pool<\/i> explores the complexity of self and the eternal confusion of it with misexpression and misunderstanding, where languages, faces, tones are just different mediums. Here self is demonstrated as a pool and moreover as a container of both the mobile “others” and the immobile anima. Shown as two fishes, different personae contained in one self are completed by the presence of “others.” At the same time, audiences become performers and a part of a collective body alongside  the fish sculptures.","short_description":"Which one is the real self? Body? Voice? Face? Or others’ judgements? How can audience’s body be used as a readymade material for the art piece and perform the role of “others”?","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnail2.jpg","title":"thumbnail2","alt":"Self_pool_thumbnail","caption":""},"topics":[{"name":"Identity","slug":"identity"},{"name":"Installation","slug":"installation"}]},{"student_id":"93","student_name":"Zachary Coble","student_slug":"zachary-coble","advisor_id":"129","project_title":"Wikibabel","project_question":"<i>Wikibabel<\/i> examines contemporary epistemology through an alternate version of Wikipedia. The site, a searchable database that is aesthetically and functionally similar to Wikipedia, is created with a process that uses machine learning to analyze the entirety of the online encyclopedia for its linguistic and structural style and then creates new articles based on those patterns. The project employs parody and satirical critique to explore how the conflict between the encyclopedia’s quest for \"neutral point of view\" and shifts in credibility brought about by the social web struggle to convey complex and controversial topics within the rigid article template’s Harvard Outline format.\r\n<br \/>\r\n<br \/>\r\nWhile close reading of <i>Wikibabel<\/i> reveals that the pages are grammatically correct, although it rarely produces a coherent article that would find a home in most encyclopedias. However, as Aristotle noted, nature abhors a vacuum, and when reading a <i>Wikibabel<\/i> article, the reader takes cues from its appearance as an encyclopedia to fill in the missing meaning. As a digital sculpture that strips down the encyclopedia to its bare essentials - the aesthetic cues, the article template, and the linguistic style—<i>Wikibabel<\/i> introduces a new system of knowledge with results that are amusing, confusing, and if you are not paying close attention, entirely believable.","short_description":"Can an algorithmically generated encyclopedia create a believable system of knowledge?","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/putin-320x240-fish.jpg","title":"Wikibabel","alt":"Wikibabel","caption":"Wikibabel"},"topics":[{"name":"Culture","slug":"culture"},{"name":"Machine Learning","slug":"machine-learning"}]},{"student_id":"94","student_name":"Ziyu He","student_slug":"ziyu-he","advisor_id":"129","project_title":"It will be perfect from now on","project_question":"<i>it will be perfect from now on<\/i> is built with custom made mechanic arms, alabaster, aluminum, dc motor, micro-controller.\r\n<br \/>\r\n<br \/>\r\n<i>it will be perfect from now on<\/i> is a process of the artificial erosion of four stones by four identical steel files. Four alabaster stones are placed on one station, each occupying one corner. Over each stone, there is a steel file that glides back and forth on the surface of the stone. Four stations move in the same rhythm, the motion is slow yet constant, creating an identical imprint on the stones. The sculpture uses formation both as a physical process and as a metaphorical device to represent the effect of governmental policies on individuals. Is it reformation, is it laceration? Is there profit, is there loss?\r\n<br \/>\r\n<br \/>\r\n<i>it will be perfect from now on<\/i> is an abstract response from an only child to the one child policy in China. It is a reflection on being the subject of a policy that was implemented for the welfare of an overpopulated society. To paraphrase Michel Foucault, governments arrogate and justify their negligence and the right to pass off human unhappiness as mere abstract profit or loss, just because the decisions they exercise claim to be concerned with the welfare of whole societies. A policy as such is portrayed in the sculpture as a force, an act that remorselessly erodes and shapes anything underneath in a slow-motion whirlpool of time, that one can not simply say the beautiful totality of the individual is amputated or repressed. The irreversible effect of the policy becomes a new complex form of individuality that has yet to be understood. ","short_description":"A kinetic sculpture that visually portrays the intricate relations between the individual and the power structure they live under. Individuals, with their identities and characteristics, are the product of that power that is exercised over their bodies, their multiplicities, their movements and desires. It is an abstract response from an only child to the one child policy in China.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/Untitled-2.002.jpeg","title":"it will be perfect from now on","alt":"it will be perfect from now on - thumbnail","caption":"it will be perfect from now on - thumbnail"},"topics":[{"name":"Installation","slug":"installation"},{"name":"Society","slug":"society"}]},{"student_id":"82","student_name":"sejo vega-cebrián","student_slug":"sejo-vega-cebrián","advisor_id":"129","project_title":"everything must go ( … )","project_question":"<i>everything must go ( … )<\/i> is an immersive experience that happens in a dark room and lasts around one hour. the panel members - silence, pre-recorded laughter, and cyborg in existential anxiety - have their spots indicated onstage by dim lights. only the third participant has a human shape. during the discussion, the moderator performs chance operations live to decide how the interventions should develop. in the first part the conversation is reserved for the three participants and the moderator's random remarks; for the second part the audience is repeatedly invited to contribute with questions.\r\n<br \/>\r\n<br \/>\r\na companion booklet is provided for consultation as a logocentric aid, for those who prefer words as a source of meaning. this booklet contains a comprehensive collection of the scripts, ideas, attempted descriptions of the work, and other fragments of text surrounding the genesis of the experience.\r\n\r\nthe creation process started with me being overwhelmed by the climate breakdown and other contemporary crises verging on total collapse(s). it took its short title, <i>everything must go<\/i>, from a <a href=\"http:\/\/www.monbiot.com\/2017\/11\/24\/everything-must-go\/\">column of the journalist and environmentalist george monbiot<\/a>.\r\n<br \/>\r\n<br \/>\r\nin my research i tried to trace back in ideologies and worldviews the origins of \"the problem\", also exploring the difficulties of letting go of the life i take for granted. the process became an acknowledgement of the complexities and contradictions that exist when trying to confront these deep issues. this situation led me to a renewed way of looking at the world, and it also made me decide to extend the title of the work. \r\n<br \/>\r\n<br \/>\r\nimportant references during the process were the works of john cage, the theater of the absurd, existentialism, and posthuman philosophy. the research also included dipping into readings about zen buddhism, the tao, and the limitations of western thought.\r\n<br \/>\r\n<br \/>\r\nthe project is a free cultural work, and it was entirely built with free (libre) software.","short_description":"<i>everything must go, or a journey to obtain an all-access pass to existential anxiety and attain some kind of enlightenment<\/i>, is a performance in the form of a panel discussion about radical change (?). the participants are silence, pre-recorded laughter, cyborg in existential anxiety, and a chance-based computerized moderator.","portfolio_icon":{"src":"https:\/\/itp.nyu.edu\/thesis2018\/wp-content\/uploads\/2018\/04\/thumbnail.png","title":"thumbnail","alt":"image of a dimly lit dark table in a dark room. it contains the following elements: a laptop with a small lamp over it, a microphone, a small booklet, and three glass cups","caption":""},"topics":[{"name":"Performance","slug":"performance"},{"name":"Society","slug":"society"}]}]