{"student_id":"100","student_name":"Hafiyyandi","student_slug":"hafiyyandi","advisor_name":"Nancy Hechinger","title":"MOHAMMAD","thesis_statement":"A series of artistic experiments on ways to express the complexities of personal identity across cultural and geographical boundaries.","abstract":"Identity is not only self-produced but also negotiated with one’s community and governing institutions. Having lived as an immigrant since I was a teenager, my concept of self and the way I express it have to be continuously adjusted depending on where I am; especially when part of that self is subject to social, economic or political persecution. This identitarian inconsistency also persists even when my well-being is not at stake. I have become unable to sufficiently articulate who I am.\r\n\r\nThrough MOHAMMAD, I explored ways to forge an identity that works for me: a form of identity that fluidly expresses the different ways I construct myself. There are three artistic experiments, each culminating in a mini-installation.\r\n\r\nThe first stage is building an inventory of self. I collected my genetic-ancestry data (biological self), chat logs (performed self), and wrote down the different ‘selves’(authored self) I have. Using this inventory, I made an installation of two video self-portraits that ‘talk’ to and slowly merge into each other.\r\n\r\nThe second stage is denying an imposed identity. For the purpose of this project, I chose to sarcastically portray my experience at immigration counters in country borders. I created an installation where a viewer got to classify a photo as ‘MOHAMMAD’ or ‘NOT MOHAMMAD’. After each classification, it printed out different visa pages depending on the choice made.\r\n\r\nFinally, the third stage is creating a new identity by repurposing conventional identity expressions. I created custom patterns that were interpolated from the Islamic geometric pattern and my own hand drawings. Depending on the parameters fed into the generator, the patterns can dynamically change while retaining some of the original features. They can hide as well as reveal embedded icons and meanings.","context_research":"Erik Erikson (1968) characterized identity as having three unique components: the ego, personal identity, and social identity. This framework of seeing identity as both internally conceived and externally negotiated has persisted and been echoed, although differing in detail, by other identity theorists.\r\n\r\nIn a 1993 paper, Radhakrishnan introduced the idea of “postcolonial hybridity”. Due to historical forcing of national-identity and geographical dislocation, postcolonial hybrids find themselves without a stable regime or an authentic root to anchor their in-between identities. Radhakrishnan proposed that to claim authenticity, a hybrid can produce an “original past” in defiance of a grand narrative.\r\n\r\nMany artists have explored this defiance in their works. In Wafaa Bilal’s Domestic Tension (2007), he granted the public permission to harm his body. Here, Bilal challenged the US-imposed narrative of “all Iraqis are terrorists”.\r\n\r\nOther artists turned defiance into creating new identitarian narratives. In Salman Rushdie’s Satanic Verses (1988), the sacred tale of the Prophet Mohammad was reinvented through a story of two Indian men in Britain. A sacrilege, Satanic Verses developed a protagonist that truly embraces his in-between-ness without bowing down to either Islamic or colonialist English narrative of an Indian man. Similarly, through brutalizing his older works and incorporating elements of queerness and pop culture, Jeffrey Gibson’s latest works (2011-present) fabricates a new Native American art history and visual vocabularies.","technical_details":"The first self-portraits talk to each other using a Markov chain of my chat logs and detect the presence of a viewer using posenet. The text generated by the Markov chain is used to mix and mask the portraits.\r\n\r\nThe second installation runs on a local server. Using a p5.js interface, it generates visa pages using canvas and prints them using node-printer.\r\n\r\nIn the third experiment, I wrote my own pattern generator function using p5.js. To interpolate the patterns with my hand drawings, I used flubber.js and save these using p5js-svg.","further_reading":"","tags":[{"name":"Art","slug":"art"},{"name":"Identity","slug":"identity"},{"name":"Installation","slug":"installation"}],"video_presentation_url":"","video_documentation_url":"","project_url":"https://hafiyyandi.com/mohammad","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/portrait2-768x432-1.jpg","title":"portrait2-768x432","alt":"Hafiyyandi headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thumbnail-2-1-1024x576.jpg","title":"thumbnail-2","alt":"Two self-portraits with a backdrop of colorful fabric","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/images-1-1024x576.jpg","title":"images-1","alt":"An installation of a self-portrait","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/images-2-1024x576.jpg","title":"images-2","alt":"Two people looking at blank screens","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/images-4-1024x576.jpg","title":"images-4","alt":"A person looking at a visa page","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/images-7-1024x576.jpg","title":"images-7","alt":"Colorful praying mat made of abstract patterns","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/images-6-1024x576.jpg","title":"","alt":"Close up of colorful prayer mat","caption":""}]}