{"student_id":"102","student_name":"Max Horwich","student_slug":"max-horwich","advisor_name":"Gregory Shakar","title":"Audance","thesis_statement":"Audance is a networked interactive music web app that allows users to play together over the internet in real time, using their computer keyboard, mouse and webcam as instruments, regardless of musical training or experience.","abstract":"I came to ITP with a very specific goal: to use interactive media technology to make musical expression available to the widest possible audience. I’ve explored this in past work, creating web-based musical interfaces that lean away from traditional forms — like written notation and piano keys — to create something more inviting to users with no formal musical training. These projects now serve as prototypes and early experiments toward the development of Audance. <br><br>\r\n\r\nWhile my previous works have empowered users to make music on their own, this is my first web-based project explicitly designed for musical collaboration, and as such, my most fully-realized work to date. Musical expression is a fundamentally collaborative endeavor, relying on a shared language -- both among performers and between performers and listeners -- for the form to be fully realized, and for the benefits of engaging with that form to be fully felt. To that end, I set out to build an environment where that shared language can be explored in a format that is intuitive and inviting to the widest audience possible.  ","context_research":"Research for this project was varied and widespread, but essentially sought to answer one of two questions: what am I making and why am I making it? <br><br>\r\n\r\nThe question of “why?” led me to the field of music therapy, where the benefits of playing music, and the ways to achieve those benefits, have been most thoroughly formalized. Music therapist Kenneth Bruscia writes extensively on improvisational musical therapy (essentially, “jamming” in a clinical setting) as a tool for strengthening group skills and feelings of interpersonal intimacy. Musician-turned-neuroscientist Daniel Levitin builds on this line of thinking, arguing that music, a form of communication older than language, evolved in parallel with the psychological development of early humans, helping to facilitate the cognitive payload that made society possible at the interpersonal level.<br><br>\r\n\r\nThe “what?” part of my research explored existing tools to realize these benefits in the most approachable way possible. I drew inspiration from the networked creative capabilities of cloud-based DAW Indaba; the social music experience of DJ chat room plug.DJ; the accessibility of camera-controlled iOS instrument AUMI; the playfulness of browser-based instruments like Patatap and Groove Pizza; and the rich immersion of interactive music games like Panoramical. These features came together to inform the core of Audance, the first platform for real-time musical collaboration over the internet designed specifically with the non-musician as the target user. ","technical_details":"The graphic user interface for Audance was designed and programmed using p5.js. The sound generation was implemented using Tone.js, a wrapper for the Web Audio API. The backend networking is handled through WebSockets. ","further_reading":"<p>With the proliferation of streaming media, music consumption has become nearly frictionless for anyone with an internet connection; however, the result is more people treat music primarily as a disposable product (and one with functionally no value, as supply outweighs demand exponentially). A recent boom in home-recording and digital distribution have opened the door to an untold number of bedroom musicians finding (or at least seeking) an audience on the internet, blurring the line between between professional musicians and amateurs (or “prosumers”). While in most ways I believe this is a step in the right direction, my long-term goal is to erase the line between “musician” and “non-musician” altogether.</p>\n<p>Being a musician comes with many frustrations, for me the worst is when someone tells me they’ve always wanted to be a musician but they have no talent for it. I used to shrug and look at my feet when people told me this. Now, I usually mention a study I read that “natural talent” (or lack thereof) is essentially a myth, and that every human is more-or-less equally adept at musical expression. It’s just a matter of finding the context in which they are properly encouraged. One method computer music pioneer Max Matthews recommends is establishing a system in which there are no mistakes — it’s much easier to play your heart out on an instrument that doesn’t play wrong notes.</p>\n<p>Audance takes its name from an unpublished science fiction short story Matthews wrote in the 1970s. In this story, the Audance is a supercomputer that facilitates participatory musical improvisations, connecting players in a collaborative musical environment with no audience, in which it is impossible to play a wrong note. This story is a cautionary tale of what happens when humanity loses touch with our innate drive for musical expression; but I see the technology envisioned by Matthews not as the cause of this problem, but as a possible antidote.</p>\n<div>\n<p>Today, as an evermore fractious internet occupies evermore of our daily lives, Audance creates a safe, welcoming, and healing space on the internet, an antacid against the creeping toxicity that characterizes so much of our digital lives. Sharing a language of collaborative musical expression has the potential to remind us that we are all more alike than different.</p>\n</div>\n","tags":[{"name":"Design","slug":"design"},{"name":"Music","slug":"music"},{"name":"Networks","slug":"networks"}],"video_presentation_url":"https://vimeo.com/336826879","video_documentation_url":"https://vimeo.com/331470497","project_url":"https://maxhorwich.com/audance","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/methesisportrait-768x432-1.jpg","title":"methesisportrait-768x432","alt":"max portrait","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/audanceMain-1024x576.jpg","title":"Audance","alt":"Screenshot of the web app in use with colored bars and circles","caption":"Audance screenshot"},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/audanceSlide-1024x576.jpg","title":"audance in action","alt":"Screenshot of the web app in use with colored bars and circles","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/audanceOren-1024x576.jpg","title":"audance Oren","alt":"man in headphones standing and looking at screen with web app displayed","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/audanceLouise-1024x576.jpg","title":"audance Louise","alt":"woman in headphones standing and looking at screen with web app displayed","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/audanceScreen-1024x576.jpg","title":"audanceScreen","alt":"screen hanging on brick wall with web app displayed","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/audanceScreenshot2-1024x576.jpg","title":"audance Screenshot","alt":"Screenshot of the web app in use with colored bars and circles","caption":""}]}