{"student_id":"108","student_name":"Namsoo Kim","student_slug":"namsoo-kim","advisor_name":"Adaora Udoji","title":"GALLARY","thesis_statement":"GALLARY is an augmented mobile gallery for young artists by connecting their artworks on their Instagram. ","abstract":"Young artists usually upload their art pieces on their Instagram to showcase their works globally because they really struggle with looking for a place where they are able to exhibit their works. This problem also includes not only limited physical restriction but also a high cost of renting the place.<br><br>\r\n\r\nMy thesis projects initiated to address this social phenomenon and issues for young artists in order to offer better accessibility and more dynamic interactions by using mobile augmented reality.\r\n","context_research":"The museum is generally physically based, and most of the traditional museums are socially exclusive. I believe this issue makes artists and art-lovers to access to only a small percentage of the world art.<br><br>\r\n\r\nUnlike the traditional venue, Nowadays, young artists use Social Media as their own virtual art gallery to showcase their artworks globally. Although this is a small screen, it has infinite space and accessibility all around the world. I would say that this virtual space is a new type of museum where we can appreciate their works.\r\n<br><br>\r\n“…today artists use Instagram as their own virtual art gallery, playing both dealer and curator while their fans become critics and collectors…”  - Vogue Magazine","technical_details":"To engineer my idea, I’m trying to use AR portal function by using AR Foundation in Unity. Moreover, I successfully connected my Instagram API by the access token. Furthermore, luckily, I received permission for using artworks from Loribelle Spirovski(www.loribellespirovski.com/2019)","further_reading":"","tags":[{"name":"Art","slug":"art"},{"name":"Design","slug":"design"},{"name":"Mobile","slug":"mobile"},{"name":"VR/AR/Immersive","slug":"vr-ar-immersive"}],"video_presentation_url":"https://vimeo.com/336821895","video_documentation_url":"https://vimeo.com/vinskim","project_url":"www.vincentnskim.com","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Vince_Rec-768x781-1.jpg","title":"Vince_Rec-768x781","alt":"vince portrait","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/GallARy-768x415-1.jpg","title":"GallARy-768x415","alt":"image 1","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/GallARy-768x415-1-2.jpg","title":"GallARy-768x415-1","alt":"gallery","caption":""}]}