{"student_id":"110","student_name":"Nick Wallace","student_slug":"nick-wallace","advisor_name":"Kathleen M Sullivan","title":"Climb.It Weather System","thesis_statement":"How can we improve the safety of outdoor activities in remote areas? If outdoorspeople had access to accurate, hyper-local weather data, they could make more informed decisions about weather risks and their safety. Existing satellite-based weather forecasts do not take into account the variety of micro-climates that exist in expansive remote areas.","abstract":"For people who live or spend time in extremely remote areas, unreliable weather data is a major safety concern which can lead to unnecessary risk and misinformed decision-making. Climb.It Weather System (CWS) aims to solve this problem. \r\n<br><br>\r\nCWS is a system of transmitters and receivers collecting on-the-ground data from remote areas and publishing it online via radio transmission. These transmitters live in the field, running on a combination of solar panel and battery power, in order to broadcast sensor data over high frequency packet radio (APRS). CWS receivers live areas with WiFi or 3G infrastructure, receive sensor data directly from a transmitter (or APRS repeater), and publish this data to a database server. \r\n<br><br>\r\nOutside the scope of this proof of concept, this project will expand to include a system for serving this data, as well as forecasts based on this data, to the public.","context_research":"In its early stages, I envisioned Climb.It to be an answer to the gaps in aggregate weather data networks like Weather Underground. These systems do an excellent job of providing localized weather forecasts for urban and suburban areas where it is possible to collect weather data over WiFi or 3G. However, these networks do not provide coverage of remote areas outside the range of these technologies.\r\n<br><br>\r\nMy early technical research involved researching and testing potential longer range communication technologies, such as LTE and LoRa. After determining that nothing off the shelf offered the type of range I needed, I decided to build my own radio frequency (RF) transmitter. In order to stay legal, I studied for and passed the FCC amateur radio technician license exam.\r\nI was inspired by low frequency radio and amplifiers from the 80s and early 90s that were designed to operate on unlicensed frequency bands (lowFER / 160-190KHz). Low frequency radio waves are larger than high frequency ones, and, generally speaking, travel further--this why AM radio can be heard further away from the transmitter than FM radio can be. Furthermore, unlicensed bands do no require an operator's license to transmit or receive on, and are the basis for many of the technologies we use today, including WiFi and Bluetooth. \r\n<br><br>\r\nI spent many, many hours developing prototypes based on the lowFER designs, through which I produced low cost and low power transmitters, but they ultimately turned out to be unreliable, and I was unable to reproduce the claimed ranges in the real world. \r\n<br><br>\r\nFinally, I redesigned the entire system to use very high frequency radio (2 meter / 144.14MHz), transmitting data packets over FM (APRS). Initial research and development for this was done by reverse engineering handheld 2 meter radios and piping in my data stream, before moving to building my own transmitting circuits.","technical_details":"","further_reading":"","tags":[{"name":"Data","slug":"data"},{"name":"Electrical Engineering","slug":"electrical-engineering"},{"name":"Experiment","slug":"experiment"},{"name":"IOT","slug":"iot"},{"name":"Networks","slug":"networks"},{"name":"Product Design","slug":"product-design"}],"video_presentation_url":"https://vimeo.com/336826975","video_documentation_url":"","project_url":"https://www.nickwallace.us/#/climbit","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Thesis-profile-169x300-1.png","title":"Thesis-profile-169x300","alt":"headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/climbit-987x1024.jpg","title":"climbit","alt":"Climb it field install thumbnail","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-05-09-at-4.10.23-PM-1024x582.png","title":"Screen Shot 2019-05-09 at 4.10.23 PM","alt":"Climb.It Control Box Description","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Thesis-RMNP-1024x576.png","title":"Thesis - RMNP","alt":"Off the shelf wireless map","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/8W0B6371-1024x683.jpg","title":"8W0B6371","alt":"Field test install","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Climb-It-v2-Render-1024x576.png","title":"Climb It v2 Render","alt":"climb it modem circuit render","caption":""}]}