{"student_id":"116","student_name":"Ridwan Madon","student_slug":"ridwan-madon","advisor_name":"Adaora Udoji","title":"Rakan","thesis_statement":"How can I combat toxic masculinity by creating a safe space for men to exercise their emotions? \r\n","abstract":"Toxic masculinity stems from stereotypical masculine gender roles that prevent men from expressing their emotions. The research shows men are thought to be the dominant 'alpha male' and to limit their emotional range primarily to expressions of anger.\r\n<br><br>\r\nWhile there are men who can express their emotion, many are taught to suppress it. I was brought up in a household where I could not express my emotions. It was always a constant battle between what I felt and what I was taught to feel. \r\n<br><br>\r\nI was also a part of a deeply misogynistic, male-dominated space where my male friends behaved in a sexist way, verbal abuse was common.  I witnessed how they  internalized the societal message that  sexual objectification is innocuous. They lack empathy toward women and feel entitled to objectify women. They disturbingly see issues like harassment, verbal and physical abuse, and violence as normal. Their ignorance is an affirmation of their masculinity.\r\n<br><br>\r\nBut there are men who want to speak out against misogyny. However, because they feel isolated and alone in their discomfort, they do not say anything. Their silence, in turn, reinforces the false perception that only a few men want to engage in conversations around gender politics.\r\n<br><br>\r\nRakan, which means ‘companion’ in the Malay Language, is an experiment that explores the relationship of a human conversation and the programmed chatbot. Rakan allows men to express their emotions. Users navigate open-ended questions designed to help them exercise their emotional intelligence. Because Rakan is a mobile wearable, users can also interact with it at their own time. \r\n<br><br>\r\nIn conclusion, Rakan is the first step for men to exercise their emotions without social pressure. By giving them an intimate space to navigate through conversations, men can build their empathy, emotional intelligence, and interpersonal skills. \r\n","context_research":"Toxic masculinity is a colossal challenge that will take time and extensive effort to overturn since it’s based on thousands of years of culture building. Men have been told to conform to a preconceived ideal that hurts women. From harassment to assault, misogyny is understood to men as ordinary [Drury, B J: Allies against Sexism].<br><br>\r\n\r\nFurther perpetuating this issue is the male gaze. Women are always portrayed as objects to sate men, leaving negative influences for boys and men [Middleton, Peter : The inward gaze : masculinity and subjectivity in modern culture. Studies have shown that in the U.S alone, 1 in 3 women has experienced harassment in their lifetime [National Domestic Violence Statistics,2017].\r\n<br><br>\r\nThere is a need for men to find allies in other men [Jackson Katz: Tough Guise]. There have been studies showing a significant number of men uncomfortable with the way their male peers talk about and treat women [Jackson Katz : The Macho Paradox]. However, only a few men in our society have dared to speak out publicly against toxic masculinity.\r\n<br><br>\r\nInclusion and visibility of advocacy are important. Campaigns like #metoo and #heforshe provide a public platform for individuals to be heard and speak up. Others like EVRYMAN, create spaces for men to exercise their emotion, coaching them to express their emotional vulnerability.\r\n<br><br>\r\nFeminist artist Zoe Buckman uses written words in her works. It made me realize that words can be a strong factor to push my work further. Annouk Wipperecht, a Hi-Tech Fashion Designer and Innovator, her works show an emotional function of wearables.\r\n","technical_details":"Rakan is built on Actions on Google, It uses Dialogflow to handle understanding what the user says, Firebase Cloud Functions for backend code and Firebase Database to save data of the user. The conversation responses use SSML (Speech Synthesis Markup Language) to adapt the nuances of a human conversation. AutoML, Natural Language Processing Sentiment Analysis was used to provide insights and relationships in the text. The project is written in JavaScript, using Actions on Google’s Node.js client library. A bone conduction transducer is used to integrate with the wearable.\r\n","further_reading":"","tags":[{"name":"Design","slug":"design"},{"name":"Experiment","slug":"experiment"},{"name":"Identity","slug":"identity"},{"name":"Machine Learning","slug":"machine-learning"},{"name":"Mobile","slug":"mobile"},{"name":"Product Design","slug":"product-design"},{"name":"Python","slug":"python"},{"name":"Self-care","slug":"self-care"},{"name":"Social Good/Activism","slug":"social-good-activism"},{"name":"Speech","slug":"speech"},{"name":"Wearables","slug":"wearables"}],"video_presentation_url":"https://vimeo.com/336821935","video_documentation_url":"https://vimeo.com/339777060","project_url":"https://www.ridwanmadon.com","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/profile-pic1-768x432-1.jpg","title":"profile-pic1-768x432","alt":"ridwan headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/fazdlyimage-1.jpg","title":"fazdlyimage","alt":"fazdlyimage","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/website-1024x576.png","title":"Rakan chatbot","alt":"Two iphone, one with a home screen of rakan.","caption":"Rakan chatbot"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/redwan_phone-1024x576.jpg","title":"Rakan Chatbot","alt":"A guy holding on to a phone with rakan application chatbot open","caption":"Rakan Chatbot"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/khalid2-1024x576.jpg","title":"Rakan Wearable Chatbot","alt":"Guy wearing wearable chatbot using Rakan","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/2withlogo-1024x576.jpg","title":"Wearable Chatbot","alt":"Mannequin wearing a wearable cap with bone conduction headphones","caption":""}]}