{"student_id":"119","student_name":"Rebecca Skurnik","student_slug":"rebecca-skurnik","advisor_name":"Gabriel Barcia-Colombo","title":"Absurd Algorithms","thesis_statement":"Can we the trust systems and algorithms that we are currently relying on? What would the world look like if I make my own systems and algorithms?","abstract":"We’re relying on more and more systems or algorithms that we do not fully understand how they work. For example, we use apps to get us what we want, but do we know exactly what these apps are doing to deliver our desired output? Allegations have been made that algorithms are biased, written by white males only. But who knows for sure? For all we know, these algorithms may as well be absurd. \r\nWe rely on these apps to help us and we trust in them yet we do not understand how they operate. My thesis is a series of artistic demonstrations that challenges the neutrality and reliability of the algorithms we rely on. I created my own algorithms and made them absurd. The algorithms are to be used in tandem with the apps in order to get my desired output. After creating my absurd algorithms, I relied on them, and had my friends and family rely on them as well. \r\n<br><br>\r\nAlgorithm 1: Finding a partner<br>\r\nUsing PoseNet (machine learning) to get the placement of your facial features, as well as the placement of the facial features of someone’s picture on Tinder (or another dating app). If the facial feature placements on your picture match the facial feature placements on the other person’s picture, you are a match. The algorithm will tell you to swipe right. Otherwise, you are not a match, and the algorithm will tell you to swipe left. <br>\r\nhttps://vimeo.com/331451712\r\n <br><br>\r\nAlgorithm 2: Finding an apartment<br><br>\r\nUsing (scraping) your past orders on Seamless via a chrome extension to determine what apartment you should get on StreetEasy. <br>\r\nhttps://vimeo.com/331449686\r\n<br><br>\r\nAlgorithm 3: Finding what to watch<br>\r\nUsing your birthday (zodiac sign) to determine which shows/movies you should watch on Netflix.<br>\r\nhttps://vimeo.com/331451135\r\n","context_research":"Research and Reading\r\nBefore finalizing my topic, I was researching the relationship between humans and AI- how we treat AI devices, and how AI devices have impacted our daily lives. I took a step back and started researching the relationship between humans and technology in general. I looked at Lauren McCarthy’s work for inspiration and found her piece Lauren particularly interesting. I also looked at Sam Lavigne’s work and spoke to him for advice. I read a few books, and the one that inspired me most was Your Happiness Was Hacked: Why Tech Is Winning the Battle to Control Your Brain--and How to Fight Back by Vivek Wadhwa and Alex Salkever. In this book, the authors speak about a study that was conducted where participants wanted to lose weight. The participants were split into two groups- one received Fitbits, and the other did not. At the end of the study, the group that did not receive Fitbits lost more weight than the group that had the Fitbits. This was because the group that received the Fitbits relied too much on the technology to tell them what to do, rather than focusing on their bodies to tell them what to do. \r\nThis brought me to think about the topic of reliance and trust. We trust in Fitbits, yet do we really know what they are measuring and how it is all calculated? As a result, I decided to make my own systems for my thesis. I decided to focus on apps in particular. Below is a picture of my thought process- we rely on apps to get us what we want- to watch shows, order food, etc. yet we have no idea how they do this. Therefore, using apps, I decided to make my own fun and absurd algorithms that I will rely on and that will get me what I want. \r\n","technical_details":"#Art, #Machine learning, #Algorithms","further_reading":"","tags":[{"name":"Experiment","slug":"experiment"},{"name":"Identity","slug":"identity"}],"video_presentation_url":"https://vimeo.com/337309077","video_documentation_url":"","project_url":"","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/headshot-2-169x300-1.jpg","title":"headshot-2-169x300","alt":"rebecca headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/aa-logo-01-01-1024x1024.png","title":"aa-logo-01-01","alt":"Absurd Algorithms","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/rebecca_2-1024x576.png","title":"rebecca_2","alt":"algorithms","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/rebecca_1-1024x576.png","title":"rebecca_1","alt":"experiment 1","caption":""}]}