{"student_id":"12","student_name":"Alexandra Lopez","student_slug":"alexandra-lopez","advisor_name":"Nancy Hechinger","title":"\"Widow\"","thesis_statement":"Widowhood is an invisible state in today’s society. \"Widow\" is an interactive textile sculpture that exposes the wounds, pain, and emotions that embody my experience as a widow. With this installation, I aim to inspire others in the hopes that they become aware of all the devastating losses that come after the tremendous passing of a spouse. ","abstract":"Historically, we widowed women have been portrayed wearing long black dresses, a distinctive image that summons the iconographic fashion from the Victorian era in which mourning rites were strict and remarkably complex, following the example of Queen Victoria after the death of her husband, Prince Albert. Victorian widows endured this burden for four years. This fashion comprised heavy black clothes with thick veils of crepe, and hats equally black and dense that lacked any kind of decoration.  This mourning clothing, known as \"widow's weeds \", distinguished the grieving widows from the rest of society. It was a visible indication of the pain for the death of their spouses, with black signifying the absence of light, represented the spiritual seclusion of the mourning woman.\r\nThis textile sculpture references the “widow’s weeds” and the social implications they represent. In a close examination of this costume, the structure underneath those dresses or “cage skirts” is the tangible metaphor I used to recreate and inhabit my own twisted cage skirt. It is a meditative space where I invite the public to take part in and to reflect on the journey and the humiliation I experienced as a young widow. This installation represents my fight against the stigma that is deeply rooted in widow’s fashion and the other social roles that women were expected to follow when they lost their husbands.\r\n","context_research":"In the search for materials that would help me to express, tangibly and viscerally, the rhetoric of my work, I began with mediums already familiar to me. Before ITP I had decades of professional experience as a textile designer with an architectural background. This motivated my approach to my project, which includes the use of fabric, thread, wool, cables, embroidery, weaving, and a wooden structure. Recognizing the need to incorporate an invitation for the spectators to explore the work in an interactive way, I also conducted research on wearable technology. As a textile artist, I frequently use the sense of touch in the exploration of my surroundings. I like to magnify the property that textile fibers have to communicate the sublime through colors and textures. I envisioned a textile sculpture that would respond to the user's tactile stimuli through the use of capacitive sensors that activate lights and sounds, and the result of these interactions direct the narrative experience of the installation. All of these materials help me to capture and invite others to see, hear, and feel the raw emotions of widowhood. ","technical_details":"It is a sculpture made with fabric, wool, embroideries, cables, MP3 Shield, capacitive touch sensor, NeoPixels, an audio file, speakers, and a wooden structure.<br><br>\r\nEmbroidered words are capacitive sensors that activate the NeoPixels. The transition between white light and the absence of light is arranged by the users as the user touches each word, each one of the NeoPixels lights goes off until everything settles in the darkness, then, an audio response is activated.\r\n","further_reading":"<p>The juxtaposition and ambiguity of the emotions of widowhood generate an atmosphere of tension that denotes the sadness provoked by the loss of that beloved one, a deep rupture that crackles my heart. I wanted to symbolize this kind of tension through the creation of my own widow’s weeds. As a starting point in my analysis of the widow’s weeds and the structured ‘cage skirt’ that supports all those layers of black, heavy fabric, I found that the symmetrical lines of this fashion have the purpose not only of signifying the existence of a mourning woman but also paradoxically of making her invisible, vulnerable, untouchable, and unavailable in the eyes of society. For my artistic representation, I reveal myself against those symmetrical and constricting lines as a way to escape the oppression I feel in that restricted space. The production process of this installation began with a tactile exploration of various black textiles which I began to cut, scrap, and rip apart to visually mimic the feeling of being torn and broken apart. I used a sharp blade to tear and fragment those fabrics in long strips, and then stitched them back together. No longer would there be symmetrical lines to keep my emotions in the shadows.<br />\nThis piece also examines the secondary losses that I experienced after losing my husband German: the feeling of non-belonging and vulnerability; of being suddenly ripped out from the seams of the fabric of society. Following German's death I was no longer a functional part of my familiar social network. I felt like a stranger in my own neighborhood. I experienced a loss of income, financial security, social status, my support system, job, housing, identity, confidence, intimacy, health, faith, dreams for the future, a parenting partner and a best friend. The uneasiness embedded in the traumatic disruption of a wife and a mother is the force that breaks down the geometry of the \"cage skirt.\" It represents my own experience of being forced to fit the cultural norms that surround the title of “widow”.</p>\n<p>Though I wore a black dress to my husband’s funeral, and I did follow some of the rituals of mourning established by my religious practices, I refused to wear any of my black clothing during my first years of widowhood. I did not want this part of my identity, this mere label, to separate me from my social circle. This push against societal norms seemed to stem from my own personal search to understand and accept the parameters that defined my new civil status. It was a relentless exploration to understand and endure the constraints of this title. I realized quickly, however, that wearing colors other than black was not enough to erase the ascribed social status of widowhood. I was caged inside my own widow’s weed— one that could not be seen, touched, or held but could be felt.<br />\nThe reality is that widows continue to be stigmatized and separated from society in our world, in some countries more severely than others. You can feel the tension of this invisible fabric pulling at you in all directions and often holding you back. Every pitied half-smile at the mention of his name. The decrease of invites to social events from married friends. The lack of understanding from prospective employers when you have to explain a 12-year gap in your professional life because you spent it raising your daughters and you never expected that your husband would die and leave you to support your college-bound teenagers on your own. These are a few of the moments where I felt othered by society.<br />\nThe deconstructed frock is suspended and entwined in a vertical loom, which is formulated as an orthogonal structure with a binary system embodying the interwoven social and cultural fabric of society. This vertical loom is not only responsible for holding the dress together but also provides support for the tulle strips that contain the secondary losses that widowhood entails: loss of income, financial security, social status, etc. These words have been embroidered using a computerized embroidery machine. A textured pattern has been superimposed over the embroidered letters with conductive thread that evokes the breaks, or cracks, of my heart and invites the spectators to feel each one of these textures. Each word becomes a capacitive sensor which when touched by the users activates the light of the sculpture. The transition between white light and the absence of light is orchestrated by the users, each secondary loss is connected to a NeoPixel of white light and as the user touches each word, each one of the lights goes off until everything settles in the darkness, and in that instant, an audio response is activated.<br />\nIn addition to the touch of the fabric and the feel of the lights, the presence of sound further deepens the sensory experience. To describe the sublime realization of the instant in which my best friend no longer existed in this physical world, I wrote a poem, Absences. As the viewer steps into my sculpture— into my own experience of widowhood— they are able to hear three audio versions of this poem. In the first, I recite the poem in Spanish. The second is an English version recorded by my daughter, Juliana. The final one is recited through a song composed by my daughter, Mariana. This offers three different but uniquely powerful ways to connect to the raw emotions that encompass such a great loss.</p>\n<p>AUSENCIAS</p>\n<p>Ausencias,</p>\n<p>no palabras,</p>\n<p>un minuto,</p>\n<p>un silencio,</p>\n<p>P</p>\n<p>R</p>\n<p>O</p>\n<p>F</p>\n<p>U</p>\n<p>N</p>\n<p>D</p>\n<p>O</p>\n<p>Ausencia,</p>\n<p>de tu voz,</p>\n<p>de tu aire,</p>\n<p>de tu esencia.</p>\n<p>Ausencia,</p>\n<p>de tu risa,</p>\n<p>de tu ira,</p>\n<p>de tu vida.</p>\n<p>Ausencia,</p>\n<p>no palpita,</p>\n<p>un segundo,</p>\n<p>un vacío,</p>\n<p>E</p>\n<p>T</p>\n<p>E</p>\n<p>R</p>\n<p>N</p>\n<p>O</p>\n<p>Ausencia,</p>\n<p>de tu cuerpo,</p>\n<p>de tu piel,</p>\n<p>de tu aroma.</p>\n<p>Ausencia</p>\n<p>de tu amor,</p>\n<p>de tu amor,</p>\n<p>de tu amor.</p>\n<p>................ Ausencia</p>\n<p>This poem constitutes the acceptance of my title as a widow––a realization that allowed me to rediscover the beauty in each of my ruptures and scars. This poem helps me to present myself before my community as more than just a widow. My identities are extensive— I am a woman, a Latina, an immigrant, a designer, a mother, and a widow. I do not need to be othered by society but rather acknowledged, understood, and treated with the same respect and inclusiveness I was treated with before my husband’s passing.</p>\n<p>The music continues to play in the background of my sculpture, and the light changes to gold to fill the space with a symbol of my desire to be seen as a person who, despite the fractures, is whole once more. This influx of golden light was inspired by the Japanese <a href=\"https://www.artsy.net/article/artsy-editorial-centuries-old-japanese-tradition-mending-broken-ceramics-gold\">kintsugi</a> art, a method of applying gold-laced lacquer resin to the cracks in broken pottery. The gold which mends the flaws of the pottery, signify the beauty of the process of being broken and repaired. Like these ceramics, the scars of my experience have made me more beautiful, more whole, and most importantly more ready to continue guiding my daughters and to support other women like me.</p>\n","tags":[{"name":"Art","slug":"art"},{"name":"Identity","slug":"identity"},{"name":"Installation","slug":"installation"},{"name":"Narrative/Storytelling","slug":"narrative-storytelling"},{"name":"Sculpture","slug":"sculpture"},{"name":"Wearables","slug":"wearables"}],"video_presentation_url":"https://vimeo.com/337313875","video_documentation_url":"https://vimeo.com/331475837","project_url":"https://www.alexandra-lopez.com/itp-thesis","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Alexandra-Lopez-768x432-1.jpg","title":"Alexandra-Lopez-768x432","alt":"alexandra headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/05/Thumbnail-Widow-Alexandra-Lopez-1024x576.jpg","title":"Thumbnail - Widow - Alexandra Lopez","alt":"front view of the sculpture","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Slide2-Widow-Alexandra-Lopez-1-1024x576.jpg","title":"Slide2-Widow -Alexandra Lopez","alt":"detail of the white light and the yellow light inside the sculpture","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Slide5-Widow-Alexandra-Lopez-1024x576.jpg","title":"Slide5-Widow -Alexandra Lopez","alt":"detail of the cage skirt from the bottom","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Slide3-Widow-Alexandra-Lopez-1024x576.jpg","title":"Slide3-Widow -Alexandra Lopez","alt":"detail of the embroidery process, and the computerize embroidery machine","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Slide4-Widow-Alexandra-Lopez-1-1024x576.jpg","title":"Slide4-Widow -Alexandra Lopez","alt":"images of sewing the touch pads","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Slide6-Widow-Alexandra-Lopez-1-1024x576.jpg","title":"Slide6-Widow -Alexandra Lopez","alt":"images of the construction process assembling the dress into the loom","caption":""}]}