{"student_id":"121","student_name":"Shreiya Chowdhary","student_slug":"shreiya-chowdhary","advisor_name":"Kathleen Stevens Wilson","title":"Itivrit: Travel through time","thesis_statement":"Can recently possible technologies be used to enhance current methods of cultural preservation and exhibit design for visitors to heritage sites around the world?","abstract":"Itivrit is an Augmented Reality museum application that enhances a visit to an ancient palace in India by allowing visitors to experience oral histories about the creators and history of the palace, its rooms, and the objects on display there in an audio-visual format.<br><br>\r\nForgotten narratives are brought back to life through audio narration and the superimposition of explanatory images. Virtual, 3D representations of human figures and objects belonging to different eras of the palace’s history guide the user through the site. Hence, a deeper understanding of the culture and history of the palace is achieved by the end of the tour.","context_research":"Itivrit, like all great endeavours, is an amalgamation of some of the finest technological discoveries made for historical preservation. It finds its inspiration from:\r\nRoi Lev’s Inventing America - An Augmented Reality experience based on Governor’s Island where you can experience the land as a 17th century colonist.\r\n<br><br>\r\nItivrit here gains from the concept of an experience taking place at a physical location where the user is made to feel like they have traveled back in time. It educates and enlightens them about the history of New York City using Augmented Reality.\r\n<br><br>\r\nThe Tenement Museum - A National Historical Landmark in New York City that is a Museum which lives to retell forgotten and shared narratives of the settlers of the tenement.\r\n<br><br>\r\nItivrit was born after my multiple visits to the Tenement. The Tenement Museum is a historical location which has been preserved just the way it was when it was being lived in. Additionally, the administration takes visitors through narratives about the daily lives of the residents. Similarly, Itivrit is based on India’s Forts and Palaces which have been preserved and educate visitors about the reasons for their existence and how they were lived in by the royal families.<br><br>\r\nThe Giza Project - A 19 year long project where the Pyramids and Tombs of Giza have been 3D modelled to perfection so as to educate children across the world who cannot physically travel to Egypt.\r\n<br><br>\r\nUsing new media and technologies, the Giza Project is educating the public on the intricacies of the Pyramids and Tombs of Egypt. Similarly, Itivrit is also using recently possible technologies to illuminate a rich and vibrant culture and its history.\r\n<br><br>\r\nAll in all, Itivrit combines the learnings from all these projects to retell narratives and allow a visitor to experience a history that no longer exists.","technical_details":"Itivrit is an Augmented Reality application that has been created with Unity and the Apple ARKit SDK, which displays the history of Takhat Vilas (a period room which was Maharaja Takhat Singh’s bed chamber) at Mehrangarh Fort, Jodhpur, Rajasthan, India.\r\n<br><br>\r\nIt uses Indian Miniature Art, centuries old Raagas (Indian Classical Music), and 3D modeled architectures of rooms and structures that have been recreated using photogrammetry.<br><br>\r\n\r\nThe narratives developed for the application have been discovered from archives that were accessible through the Mehrangarh Museum Trust. They allow us to receive a more personal introduction to the resident Kings of the Palace, by understanding their day to day lives and interests - making them more relatable and human rather than glorified and similarly mundane.\r\n<br><br>\r\nItivrit is a collaborative project created by Shreiya Chowdhary, Viplov Singh, and Anubhav Syal. Shreiya has worked on the concept, development, and coordination with the Mehrangarh Museum Trust and Jodhpur Royal Family. Viplov, with Shreiya has created all the visual assets that are available in the application, and Anubhav has seamlessly procured all audio assets and supported the team in all coordinative efforts and documentation.\r\n<br><br>\r\nDuring the second on-site excursion at Jodhpur(India), Shreiya worked with the Trust in identifying the King, his room, and the story that should be communicated to the visitors using Augmented Reality. After in depth conversations and visits, it was decided in the month of March that Takhat Vilas - Maharaja Takhat Singh’s bed chamber would be the first room in the palace to be augmented. This room has restricted access wherein it can only be viewed from the windows outside and so, there is much to be told and experienced considering the vibrancy of the King’s life and the art that exists inside the room.\r\n <br><br>\r\n728 detailed images of the room were taken and stitched together using photogrammetry to create a 3D model.\r\n <br><br>\r\nIt hosts:\r\nAn ancient Indian game - Chaupar, that was only played by upper class or Royal families - ideally individuals who could afford to lose assets.\r\n <br><br>\r\nAn enormous cloth fan that hangs above the King’s bed and would be controlled by an attendant in the Kingdom using a rope, while the King would sleep at night.\r\n <br><br>\r\nArt that displays Maharaja Takhat Singh’s interests and influences from British colonialism\r\n <br><br>\r\nGiant Christmas ornaments that were gifts from his British allies and hang from the ceiling.\r\n<br><br>\r\nThis application exists as an interactive native experience at the physical site of the Fort using iPads, as well as a downloadable application that will display a 3D model of the room anywhere in the world.\r\n<br><br>\r\nThe downloadable application is called “Dwaar” and allows a user who is not present in India to also experience Mehrangarh Fort and Takhat Vilas, using the medium of Augmented Reality from the lens of storytelling. They exist as 3D representations in interdimensional portals, all in the compactness of your smartphone. \r\nAn easier way to understand Dwaar, is to think of it as an experience that whets your appetite enough to travel to India to experience Itivrit.\r\n","further_reading":"<p>Itivrit is an Augmented Reality application that has been created with Unity and the Apple ARKit SDK, which recreates the history of a 14th Century Indian Fort and its 35th King Maharaja Takhat Singh.</p>\n<p>However, the real technicality of Itivrit belongs in the realms of developing its concept.</p>\n<p>This project allowed me to take a deep dive into Rajasthan’s (Indian state) Royal history, architecture, and artwork. The learning that I received is far beyond what I can display with an application.</p>\n<p>For the last 10 months, I’ve been making multiple trips to India and visiting different historical landmarks to understand the history of the Royal families that live there. I’ve encountered Indian Miniature Artwork adorning walls, Manganiyar Music (storytelling through music from a depleting tribe of bards) being heard through the halls, and architecture that stems from a strong Mughal influence. Clearly, Rajasthan is steeped in a rich and vibrant living history - with the families still residing in the palaces of their ancestors. Unfortunately, these histories are, for the most part, unknown to the World. They find themselves lost in oral narratives belonging to Historians whose ancestors lived with the Royals. Hence, using Audio, Video, and Augmented Reality as a medium to bring these histories to life, ancient objects and their possessors (Kings and Queens) have been re-created in the style of Indian Miniature Art using 3D modeling software. Through these re-creations, stories about the lives and interests of the Kings and Queens that have long been buried in the archives of the palace are brought back to life.</p>\n<p>During the last development trip in March ‘19, after extensive research through archived documents and multiple site visitations - Takhat Vilas, the bed chamber of the 22nd King of Jodhpur was chosen to establish Itivrit as a concept.</p>\n<p>After multiple rounds of methodical and comprehensive documentation of the Fort and Takhat Vilas, the project found itself in steadfast execution mode. All the pieces were now to be put together to complete the puzzle around Maharaja Takhat Singh and his life.</p>\n<p>Apart from learning about my own cultural heritage in a whole new light, I advanced exponentially with reference to any technical development. It began with Unity Development and Augmented Reality integration (a skill I learned at classes at ITP), and went itself to merge with a completely different and unexpected software and skill - Photogrammetry. Itivrit has been 10 months of enlightenment in my opinion, and I will always be grateful for that.</p>\n","tags":[{"name":"Culture","slug":"culture"},{"name":"History","slug":"history"},{"name":"Installation","slug":"installation"},{"name":"Narrative/Storytelling","slug":"narrative-storytelling"},{"name":"VR/AR/Immersive","slug":"vr-ar-immersive"}],"video_presentation_url":"https://vimeo.com/336836771","video_documentation_url":"https://vimeo.com/328028372","project_url":"https://itivrit.com","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Shreiya-copy-768x576-1.jpg","title":"Shreiya-copy-768x576","alt":"shreiya profile","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thumbnail-16-1024x576.jpg","title":"Itivrit","alt":"This is the Itivrit logo.","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/theFort-1-1024x576.jpg","title":"Mehrangarh Fort","alt":"This is an image of the exterior of Mehrangarh Fort.","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Fort-1024x576.jpg","title":"Fort","alt":"This is an image of the interiors of the Mehrangarh Fort.","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/king-1024x446.gif","title":"Maharaja Takhat Singh","alt":"This is a gif of a 3D model of Maharaja Takhat Singh walking.","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/TakhatOtherGif-1.gif","title":"TakhatOtherGif","alt":"This is a gif of Takhat Vilas's 3D model moving in orbit.","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/IMG_2434-1024x576.jpg","title":"IMG_2434","alt":"Itivrit: Travel through time","caption":""}]}