{"student_id":"122","student_name":"Sam Chasan","student_slug":"sam-chasan","advisor_name":"Kathleen Stevens Wilson","title":"Chaff Map","thesis_statement":"Chaff Map is a web platform to share and find by-products, and projects made from by-products. It aims to help tackle the issue of climate change through proactive collaborative innovation.\r\n","abstract":"Chaff Map aims to reduce the amount of solid waste heading to landfills through a few methods:<br>\r\n1) Inspiring individuals to create interesting things from free materials<br>\r\n2) Helping people save money by producing less garbage<br>\r\n3) Informing people about the benefits of sharing by-products, and tutorials for interesting projects<br>\r\n(4) Informing people about the climate consequences of a lackadaisical approach to waste. If Chaff Map can reduce the amount of solid waste heading to landfills by even 1%, that would reduce methane emissions from landfills by approximately 2 million cubic feet each day.\r\n","context_research":"Every year, the United States generates over two hundred and fifty million tons of municipal solid waste. Much of this is useful material that has only been discarded because its immediate use has been exhausted, and it is cheaper for the owner of the material to discard it than to maintain, fix, or clean it. \r\n<br><br>\r\nI discovered this first-hand in two primary ways: First, I learned that discarded coffee husks - “Chaff” - is a perfect substrate for growing oyster mushrooms, so I took some that would have otherwise been trashed from my local coffee roaster, and grew mushrooms in my backyard. Second I took discarded plastic from an experience room I worked at and used it as a drop-cloth to protect my floors when I paint. In both circumstances the owners of the trash I used were more than happy for me to take their waste off their hands. Their only agenda was to bag it up, and put it on the curb for removal, despite the many potential uses of the material.\r\n<br><br>\r\nThe consequences of this lax approach are dire, and numerous (https://19january2017snapshot.epa.gov/climate-impacts_.html). Therefore, it is  incumbent upon us as a species and society to develop proactive preventative solutions. Chaff Map aims to be one of these solutions. There are many services for sharing free items, such as Craigslist or Freecycle, and there are also many tutorial sharing sites, such as Pinterest and Youtube. However, there is no centralized platform for repetitively generated waste such as by-products. This incredible amount of waste being generated daily by businesses world wide needs to be addressed. As over 85% of people have the internet in their pocket, I chose to develop this software tool to connect to, and be used, by the world. ","technical_details":"Chaff Map is built using Node.js for the back-end, and React.jsx for the front-end. Routing is managed by Express, hosting by Heroku, databasing by MongoDB, and photo storage by Amazon S3. ","further_reading":"","tags":[{"name":"Product Design","slug":"product-design"},{"name":"Social Good/Activism","slug":"social-good-activism"},{"name":"Sustainability","slug":"sustainability"},{"name":"Tool","slug":"tool"}],"video_presentation_url":"https://vimeo.com/336836823","video_documentation_url":"https://vimeo.com/331481388","project_url":"https://www.ChaffMap.com","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/headshot-sexy-221x300-1.jpg","title":"headshot-sexy-221x300","alt":"sam headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/logo-1024x576.png","title":"logo","alt":"chaffmap logo, trash can with a map pin above it, inside the map pin is a cycle icon","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-05-09-at-9.19.00-PM-1024x562.png","title":"Screen Shot 2019-05-09 at 9.19.00 PM","alt":"chaffmap.com home page","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-05-07-at-2.11.33-PM-1-1024x536.png","title":"Screen Shot 2019-05-07 at 2.11.33 PM","alt":"chaffmap.com about page","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide-photo-1024x576.jpg","title":"slide-photo","alt":"Chaffmap icon above chaff, bricks of mycelium, and oyster mushrooms","caption":""}]}