{"student_id":"123","student_name":"Sam Hains","student_slug":"sam-hains","advisor_name":"Gabriel Barcia-Colombo","title":"Jack and Sam's eDream Portal","thesis_statement":"\"Jack and Sam’s eDream Portal\" is a real-time video simulation, about the search for the human and the authentic within a simulated world. ","abstract":"“While most tools produce effects on a wider world of which they are only a part, the computer contains its own worlds in miniature.” - Wendy Hui Kyong Chun.\r\n<br><br>\r\nAs reality is drafted into digital environments, the computer simulation offers the opportunity to create worlds and bodies without unwanted complexity. It allows us to devise private games and internally consistent worlds in the face of absurdity and paradox. Advances in computer imaging technology towards “photorealism” further seduce us into believing that we are looking at concrete realities rather than ideological assemblages of math and code. As reality is increasingly reflected through the small mirrors of digital simulation, we risk losing sight of the mysterious nature of our lived experience.\r\n<br><br>\r\nBy creating automated worlds that make no gesture towards fetishized “graphic realism” or instrumental modes of seduction, we begin to see the simulation for what it is: A world we can’t escape from. A future predetermined by various corporate, political and ideological entities. A prison where an emancipatory politic is a fleeting and distant reality.\r\n<br><br>\r\nFor my final work, I created a triptych of simulations based on an ironic reading of Bosch’s Christian creation triptych - \"The Garden of Earthly Delights\".  The appropriation of this material, provided a way of engaging directly with the world making capabilities of computer systems through falsified mythology.  The result is a 6 channel video installation that explores the way in which computers create worlds and realities in their own image. \r\n","context_research":"Some notable influences:\r\n<br><br>\r\nThe concept of \"video games that play themselves\" as an art practice, has been pioneered by artist, Ian Cheng. His work exploring the relationship between worlds and simulations is foundational to my practice.\r\nHis and my work are both developed using the kind of multi-agent simulation technology associated with video game bots, military planning systems and corporate \"crash tests\". They are the \"Type A\" personality type of the artificially intelligent world.  Although, artificially stupid would be more accurate. I am fascinated by their absurd simplification of the human form into a series of loop-based instructions\r\n<br><br>\r\nI also spent a lot of time as a tourist inside existing simulations; drawn into the inhuman choreography of their inhabitants and other interstitial weirdness.  I have tried to bring into the feeling of my video works. Grand Theft Auto 5’s simulation of Los Angeles, and FlexSims corporate logistics software are notable references.  The main characters of \"Jack and Sam's eDream portal\" are appropriated from corporate simulation software FlexSim.\r\n<br><br>\r\nThe writings of Philip K Dick and his redeploying of the struggle for authenticity and freedom within a simulated universe, was another very important reference for bringing my ideas together. \r\n","technical_details":"Created using Unity engine, a popular software tool for developing 3-D video games and AI models. ","further_reading":"<p>My thesis journey began in 2018,  when I created a real-time simulation called “<a href=\"https://vimeo.com/306306643\">Island of Task Executors</a>” about Jack, a computer-generated “human surrogate,” and his dystopic, homogenous existence. The assets from for this project were appropriated from corporate simulation software called FlexSim. Through this work, I sought to interrogate the meaning of an agent who had been intentionally programmed without human feeling.Through simulated body language, musical accompaniment, and narrative framing, I discovered that Jack could be choreographed to evoke a sense of his own trauma: Jack is troubled. Jack is disturbed. Jack is stuck. Jack has a void within. Jack is aware of the simulation. Wait a second — am I Jack?</p>\n<p>By the end of the project, I realized that Jack was an allegory for my own precarious sense of reality. We are both agents in an absurd world programmed by larger, more powerful reality constructs.  I wanted to return to this space more intentionally, authoring virtual worlds that celebrate and critique the human condition. I continued to develop work with Jack, building a narrative around the original citizen of the corporate simulation.</p>\n<p>As part of my research process I also wrote an article for ITP's student run journal, <a href=\"https://itp.nyu.edu/adjacent/issue-5\">Adjacent</a> called <a href=\"https://itp.nyu.edu/adjacent/issue-5/small-mirrors-of-the-real/\">Small mirrors of the real</a>.</p>\n","tags":[{"name":"3D","slug":"3d"},{"name":"Art","slug":"art"},{"name":"Critical Theory Art","slug":"critical-theory-art"},{"name":"Narrative/Storytelling","slug":"narrative-storytelling"},{"name":"Simulation","slug":"simulation"}],"video_presentation_url":"https://vimeo.com/337309112","video_documentation_url":"https://vimeo.com/samhains/edream","project_url":"http://samhains.com/thesis","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/self-portrait-2-1024x576.png","title":"self portrait","alt":"self portrait","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/6-channel-1024x576.png","title":"Jack and Sam's eDream Portal","alt":"6 images. top left image shows a man dressed as jesus and a zebra walking through reflective water. the bottom left image shows eden, a garden paradise. the middle top image shows a deconstructed office environment on the verge of destruction. smoke and fires burning, money flying everywhere. the bottom middle image shows a first person perspective view of the office. a hand reaches forward and presses a device. the top right image shows large stalactites protruding from a reflective ground. fires are burning and strange video game characters populate the scene. the bottom right image shows a first person perspective of someone shooting a gun at another person.","caption":"Screenshot of 6 channel video simulation."},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/EDEN-1024x576.png","title":"Garden of eden","alt":"2 images of simulated garden of eden. one from first person perspective. other from 'gods eye' perspective. lephant moves through water. birds in the sky. green trees.","caption":"Screenshot of 'Eden' simulation"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/OFFICE-1024x576.png","title":"Office","alt":"Image of an office environment, abstract. reflective, water-like floors. Fires are burning. Another image from first person perspective inside the office. burning fires and a stack of televisions. The workers sit around on couches, as their world burns.","caption":"Humanity at the brink of madness and destruction."},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/HELL-1024x576.png","title":"Hell","alt":"The world of corporate agents, Jack and Jill has been invaded by creatures from other simulations. The distinction between who belongs in the simulation and who is an invader is blurred as Jack and Jill become locked in an eternal DeathMatch against eachother.","caption":"Jack and Jill's world descends into dark chaos."},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/6-channel-1024x576.png","title":"Jack and Sam's eDream Portal","alt":"6 images. top left image shows a man dressed as jesus and a zebra walking through reflective water. the bottom left image shows eden, a garden paradise. the middle top image shows a deconstructed office environment on the verge of destruction. smoke and fires burning, money flying everywhere. the bottom middle image shows a first person perspective view of the office. a hand reaches forward and presses a device. the top right image shows large stalactites protruding from a reflective ground. fires are burning and strange video game characters populate the scene. the bottom right image shows a first person perspective of someone shooting a gun at another person.","caption":"Screenshot of 6 channel video simulation."},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/JackAndGods-1024x576.png","title":"Gods and Worlds","alt":"a man sits at a chair in front of a computer, facing the wrong direction. the world is in flames","caption":"A screen capture from Hell, one of the three simulations of 'Jack and Sam's eDream Portal'"}]}