{"student_id":"124","student_name":"Keerthana Pareddy","student_slug":"keerthana-pareddy","advisor_name":"Nancy Hechinger","title":"Ensemble","thesis_statement":"‘Ensemble’ is a multi-sensory collaborative game for children ages 6-9, on the concept of springs in physics. It explores interaction models that foster both learning through play and nurturing mutual care among the group of children. These models can be integrated into various learning applications that I hope to introduce in low resource schools in India. ","abstract":"'Ensemble' is a multi-sensory collaborative game on the concept of springs in physics. It invites four 6-9 year old children to play together to understand the concepts of force and motion displacement in springs. Using a tangible controller that mimics the physics of spring, children work together to reveal pictures on a projected tabletop board. Adding sound to the game further enriches the play. \r\n <br><br>\r\nThey pass the controller around for multiple rounds until the entire image is revealed on the game board. Interpersonal interactions are designed to invoke patience and collaboration among children. Initial user tests show that the interaction works as predicted.\r\n","context_research":"Government schools in India have low resources with respect to the budget, equipment, infrastructure, and staff(teachers, lab staff, etc). During my exploratory research, I visited 3 such schools in India and was appalled to see a lack of practical learning in these schools. Thus placing the students at a disadvantage for the current world. I learned that the schools have televisions, projectors, and computers - but for the most part they don’t work or are not used. So how can I use technology to turn these non-working labs into playgrounds of Physics and Chemistry, using the existing resources?\r\n\r\nJulia Atkin in Chapter 3 of \"Designing for Education, Transforming Spaces for Learning\" summarizes learning in five points that guide my approach to designing for learning. My research has revealed the importance of promoting and nurturing social relationships at a young age, especially for children from low-income communities and troubled families. When students notice the value of their input and effort, a more internal locus of control and belief in one's ability is fostered, thus embedding social and work skills. This further strengthened my desire to design a collaborative environment for learning through play.\r\n\r\nTraditional board games are so much fun and benefit children's mental development. They strengthen executive functions such as working memory, inhibitory control, cognitive flexibility and also foster social skills through collaboration and negotiation. However, traditional board games lack the interactivity of a screen device that kids love and have endless options for content. 'Ensemble' is an amalgamation of the two mediums that encourages learning through collaborative play.\r\n","technical_details":"'Ensemble' has two parts- a digital interface and a tangible controller. The digital interface is coded in processing and is projected onto the game board via a projector that is mounted on the roof. The controller runs on MKR1000 with a distance sensor that senses how far the spring has been pulled and a Neopixel ring that indicates whose turn it is. It controls the visuals through a TCP connection. Case of the controller is 3D printed and designed so that the child has a firm grip to pull the handle. Group dynamics of passing the controller after your turn is designed with the intention that the child patiently waits for their turn.\r\n","further_reading":"","tags":[{"name":"Design","slug":"design"},{"name":"Education","slug":"education"},{"name":"IOT","slug":"iot"},{"name":"Play/Games","slug":"play-games"},{"name":"UX","slug":"ux"}],"video_presentation_url":"https://vimeo.com/337314277","video_documentation_url":"","project_url":"https://www.keerthanapareddy.com/ensemble","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/picture-768x432-1.jpg","title":"picture-768x432","alt":"keerthana","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thumbnail-18-1024x576.jpg","title":"thumbnail","alt":"Project image of 'ensemble'. A picture projected on the game board with a controller on the side.","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/gameboard_collage-1024x576.jpg","title":"gameboard_collage","alt":"A collage of 4 pictures. In picture 1 the controller is green, picture 2 it is yellow, picture 3 blue and picture 4 red.","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/controller_archive-1024x576.jpg","title":"controller_archive","alt":"hand holding the controller","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/controlleR_pull_archive-1024x576.jpg","title":"controlleR_pull_archive","alt":"Hand pulling the handle of the controller","caption":""}]}