{"student_id":"125","student_name":"Sofia Luisa Suazo Monsalve","student_slug":"sofia-luisa-suazo-monsalve","advisor_name":"Gabriel Barcia-Colombo","title":"Post-photographic Topographies","thesis_statement":"An exploration of the contemporary state of photography and its effects on contemporary image-making, viewing practices and world-view imagery.","abstract":"Post-photographic Topographies is a series of artistic experimentations focused on different aspects of the photographic nonhuman gaze of the physical and digital world. Collectively, the three pieces of the project enable the emergence of an allegorical topography that serves as a documentation and delineation of the world-making power of nonhuman photography.","context_research":"The project is framed as an artistic representation of various media archeology concepts and ideas on contemporary photography (and other related light-based mediums), but the project specifically focuses in the post-humanist concept of “nonhuman photography” proposed by the writer and artist, Joanna Zylinska. \r\n<br><br>\r\nAs the author explains, the concept can be understood as “the execution of technical and cultural algorithms that shape our image-making devices as well as viewing practices”. It is the photo making practice powered by the symbiosis between human vision and security cameras, mobile photography, satellite images, and other platforms and technologies that enable the unfolding of a post-photography that is continuously decoupling from human vision but at the same time inevitably shaping it. \r\n<br><br>\r\nConsidering that the authenticity of the “real” world has historically been optically and visually validated, nonhuman photography (as also traditional photography does) not only transforms human vision and perception, it also actively constructs and deconstructs the setting from where it emerges  and sustains itself from, namely, our world.  \r\n<br><br>\r\nThrough the implementation of three artistic experimentations, Post-photographic Topographies explores and questions the world-making power of nonhuman photography, by addressing the following inquiries: \r\n1) How is the environment being seen and experienced by automated vision systems and how is this specific way of world seeing affecting the way humans interact, navigate and position themselves on Earth?; \r\n2) Can nonhuman photography, as an artistic practice, delineate, document and explore a post-human representation of the contemporary world?; \r\n3) Is nonhuman photography enabling the emergence of a post-human topography of the world?\r\n\r\n\r\n \r\n","technical_details":"The project was developed using a range of different platforms and technologies.\r\n <br><br>\r\nX. Post-photographic Geology: instagram, web scraping, image processing, projection mapping. \r\nY. Post-photographic Cartography: Google Street View, screenrecording recording and screenshooting, photoshop and 3D scale modeling. \r\nZ. Post-photographic Landscape: simulation games “The Sims 4”, machine learning (pix2pix), photographic printing.  \r\n","further_reading":"<p>The three projects that composed Post-photographic topographies are listed along the X, Y, and Z axis, as each one of them approaches the non-human visual representation of space from a specific dimension.</p>\n<p>X. Post-photographic Geology:</p>\n<p>As J. Zylinska states in her book Nonhuman Photography: “ … photography is a form of stabilized perception and impression that occurs across various mediums, like rocks, paper, skins.” If photography is thought of as a fossil, as the material encapsulation of time, then the photo making practice  becomes a time making practice. But in the age of the dematerialization of photography, how can this photographic measure of time take a material form? Specially considering that for the most part, contemporary photography takes the ungraspable form of a never ending flow of pixels. This project tries to bond two seemingly opposed conditions of contemporary photography:  the dematerialization of the photo taking process, and the massive amount of photographs posted on social media each day.</p>\n<p>Every second, roughly 1000 images are posted on instagram. If these thousand images, or in other words, this one second of time passing were to be fossilized, a photographic measure of time would take form: a photographic fossil of one second of instagram photography. To materialize this idea, I scrapped 1000 images (one second worth of photo posting) from the hashtags “right here right now”, “being here” and “this moment”. I chose this hashtag as an eloquent and somewhat poetic way of declaring one’s existence in space and time –an action that is intrinsically attached to the photographic act (whether consciously or not).</p>\n<p>Using an image processing software I shrunk the photographs to 1 pixel in height and piled all of them on top of the other to create a sedimentary layering of photographs. Secondly, I collected rocks from downtown Manhattan, near where the first photography studios of the world were established. This organic element of the analog world anchors the ethereal streaming of instagram photo posting to reality, and simultaneously draws a historical parallel to what was then –in terms of having your photo taken– and what is now. Lastly, I combined these two components through projection mapping. The photographic sediments are mapped to the rock, so the final piece stands as a material and visual representation of one second of instagram photography.</p>\n<p>Y. Post-photographic Cartography:</p>\n<p>This experiment is based on  on Rexer’s notion of photography, described his book The Edge of Vision:  photographs are “not a quotation at all but a visual reconstruction of reality, a simulacrum with a difference. Insofar as they reconstruct reality, photographs withhold a measure of it\".</p>\n<p>The earliest known surviving photograph taken by Niepce between 1836 and 1837 already exposes this “simulacrum with a difference” that Rexer refers to, as it shows lights and shadows from both sides of the picture since it needed 8 hours of exposure. The human eye could not have seen this lighting setting if it weren’t for the photographic apparatus. Photography thus has to be understood not as an extension of the human eye, but as a non-human augmentation of the human eye capacity.</p>\n<p>The non-human vision in the form of a glitch of light in Niepce’s photograph, inaugurates the history of photography and also serves us as a premonition of the automated vision systems that were to come.  Google Street View (GSV) stands as the ultimate realization of automated vision in the contemporary age, as it is an all-seeing, always present eye, that liquifies photographic referentiality into an omnipresent stream of pixels and bytes within cyberspace.</p>\n<p>For this project I use GSV to visit historically relevant places for the history of photography (Lacock, UK; LeGras, France; Campinas, Brasil) and made screen recordings of these cyber travels. By exploring the footage carefully, I found  glitches that usually happen while moving from point A to B or while zooming in and out, enabling forms to emerge from that space in between a 2D and a 3D representation of space. I screen-captured these glitches and made 3D projections of space from  the glitched 2D representation of the physical world. The scale models enabled the emergence of the world that forms in this liminal space of translation of information, that can be understood as a sort of 2.5D glitch world. These models attempt to portray the mutable state of contemporary photography, which gets unfixed from statism –or death, as it has historically been argued– to constantly re-create or re-enact reality, thus having a productive representational role in contemporary world making. Also, the glitches point out that even though GSV might appear to be an extension of reality, it is still nevertheless, a representation of it.</p>\n<p>Z. Post-photographic Landscapes:</p>\n<p>In his article “Art in the Age of Machine Intelligence”, Blaise Aguera y Arcas comments: “when a photographer is at work nowadays, she does so as a hybrid artist, thinking, manipulating and encoding information with neurons in both the brain and the retina, working with muscles, motors, transistors, and millions of lines of code. Photographers are cyborgs.” If photographers are indeed cyborgs, then the photographic practice must also be considered as a hybrid act that involves as many natural and organic elements as it does artificial and inorganic. Image making can then be set free and emerge within the margins  of artificial and virtual worlds too.</p>\n<p>In the games “The Sims 4”, the characters within the simulation (the “sims”) are able to take photographs with a range of different cameras, which they can also upload to their own version of instagram, “Simstagram”. I played the game and took photographs with my sims avatar. I used the captured images to run a machine learning model (pix2pix) that works by training on pairs of images and then generates a corresponding output image from an input image you give to it. I prepare a training set to run this model composed by the images I captured inside the game and a real life photographic version of those images. After training the model, I was able to use it to give it an input of a simulation image, and then I would get as an output an image synthesized by the model by attempting to make the simulation image look like a real life photographs. The outputs have a very low resolution so I printed a selection, scanned them at a high resolution and made photographic prints of those images.</p>\n<p>This project plays with the possibility of a disembodied photographic practice that sets the traditional photographic act free from its traditional means of existence, and also from the romantic figure of the photographer with his camera nostalgically wandering and confronting the world. Additionally, the resulting imagery attempts to portray the inevitable symbiosis between the digital/artificial and the analog/real world, how both informed each other and by doing so, influence and shape one another.  Even thought the idea was to de-romanticize the photographic act, the final images bear a considerable resemblance to romantic painting of the 19th century, which I think reflects how we have not only romanticize the world, but also, it’s simulation.</p>\n","tags":[{"name":"3D","slug":"3d"},{"name":"Art Theory","slug":"art-theory"},{"name":"Machine Learning","slug":"machine-learning"},{"name":"Photography","slug":"photography"},{"name":"Projection Mapping","slug":"projection-mapping"}],"video_presentation_url":"https://vimeo.com/337309191","video_documentation_url":"https://vimeo.com/335213670","project_url":"https://www.sofialuisa.xyz/post-photographic-topographies","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/sofia.jpg","title":"sofia","alt":"sofia portrait","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thesis-main-1.jpg","title":"post-photographic topographies","alt":"processed imaged of a map","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/1-6-1024x576.jpg","title":"post-photographic geology","alt":"projection mapping on rock","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/2-3-1024x576.jpg","title":"post-photographic cartography","alt":"3D model of a google street view glitch","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/3-3-1024x576.jpg","title":"post-photographic landscapes","alt":"framed photographic print of a machine learning synthesized image","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/4-1-1024x576.jpg","title":"post-photographic topograghies","alt":"exhibition of post-photographic topographies","caption":""}]}