{"student_id":"127","student_name":"Simon Jensen","student_slug":"simon-jensen","advisor_name":"Nancy Hechinger","title":"Safety Last","thesis_statement":"Would more creative applications in software be unleashed if we didn’t start by saddling designers and developers with privacy and security concerns? I propose a “Safety Last” approach to software development. ","abstract":"Despite our supposed concerns that private data is collected and used by third parties, we willingly agree to provide personal information in exchange for online utilities: email, calendars, social media and e-commerce. “Safety Last” is a series of software applications exploring the possibilities that might emerge if we intentionally sacrifice computer privacy and safety. <br><br>\r\n\tThe project explores what software might look like if we removed a current main principle in software development: that is, the assumption that software should be safe. The applications derived from this project are built-out thought experiments that suggest a different approach to exploring digital interactions and privacy. “Safety Last” consists of a file sharing application called “Open Desktop” and two remote control projects “Participate” and “Notify”. All the projects are intended to have a useful functionality to them which plays out against the control the user must sacrifice in order to use them. ","context_research":"\"We don't have a physical response or intuition for what it feels like to have all your data looked at by an algorithm. We do have a really clear understanding of what it means to be looked at by another person.\" - Lauren McCarthy\r\n<br><br>\r\nInspired by this idea, “Open Desktop” is intended to challenge the perception of the desktop as a personal space. This application allows users to see and manipulate files located on other connected devices. By authorizing them to move, share and delete files with one another, it reimagines the desktop as a communal environment. “Open Desktop” is a comment on our willful sharing of information with online platforms.    \r\n<br><br>\r\nThe idea for “Participate” was inspired by readings in Zuboff’s “The Age of Surveillance Capitalism”. Do we trust random users enough to let them into our private system? Do we trust people creating the software we download? “Passage” is a remote Desktop Control Application to test those questions. It serves your screen, mouse and keyboard to any online user visiting a specified webpage, giving them absolute control. <br><br>\r\nWe trust the companies and the unknown designers who produce software but we are appalled by the idea of letting even a friend take over our computer. Why do we think of a person as malware and trust the companies that make money from us?  \r\n<br><br>\r\n“Notify” is a tool to change our behavior on a computer. This app is seen as an alternative to page-blockers, timers and self-control. Simply, the application allows other users to go to a webpage and see if you are online. From the webpage they can give you a notification, screen lock or turn off your computer.       \r\n","technical_details":"The projects in “Safety Last” are a combination of desktop applications built using Electron.js and web pages built with HTML, CSS, JavaScript. Communication happens through custom built node.js web servers, peer servers and/or socket connections that allow for data transfer between the applications. Electron allows me to access native components in the computer and provide them in the browser. Learning about online built-in safety protocols and maneuvering around them has been a great challenge for structure and architecture of the applications.  \r\n","further_reading":"","tags":[{"name":"Data","slug":"data"},{"name":"Design","slug":"design"},{"name":"Networks","slug":"networks"},{"name":"Privacy/Security","slug":"privacy-security"},{"name":"Software","slug":"software"}],"video_presentation_url":"https://vimeo.com/337314328","video_documentation_url":"https://vimeo.com/331502620","project_url":"http://marqvard.com/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thesisImage-768x512-1.jpg","title":"thesisImage-768x512","alt":"simon headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/exp3photo-1024x723.png","title":"exp3photo","alt":"participte","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/simon2.png","title":"simon2","alt":"open desktop","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/theOne.gif","title":"theOne","alt":"the one","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/exp3photo-768x542-1.png","title":"exp3photo-768x542","alt":"participate","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/longone.gif","title":"longone","alt":"longvid","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/better-1.gif","title":"better","alt":"bestone","caption":""}]}