{"student_id":"128","student_name":"Stephanie Paige Chambers","student_slug":"stephanie-paige-chambers","advisor_name":"Nancy Hechinger","title":"The HOTSpot","thesis_statement":"The HOTSpot is a curriculum and newly-founded organization whose mission is to increase levels of access, awareness, and active participation in STEAM programming amongst underserved and underrepresented community members of the Greater Newark Area of New Jersey.","abstract":"A history of personal interest and involvement, and a network of mentorship and support lit the fire under my mission to connect motivated individuals who may be interested in Science, Technology, Engineering, Art, and Mathematics (STEAM) with STEAM Professionals (and semi-pros) who have a relationship or general affinity with the underserved community. My goal of nurturing and mentoring the former into developing paths to collegiate-level STEAM education and the STEAM workforce gave rhyme and reason to my plan. I would pull from my experiences and skills acquired at ITP and pour them into the design of a fun and culturally relevant STEAM program curriculum for my community members.\r\n<br><br>\r\nIn alignment with my mission and in light of my past experiences and new discoveries, I have posed the question: “How can I help to increase the levels of awareness, access, and active participation in STEAM-related programs amongst residents (aged 11-17) of underserved communities, specifically the Greater Newark Area?”\r\n<br><br>\r\nOver the course of the semester, I have researched and spoken with several educators and parents regarding what has been available to students in Newark, NJ and surrounding neighborhoods, as far as STEAM programming goes. I found that while science is appreciated and art beloved within the Greater Newark community, extracurricular STEAM-related programming geared toward its core residents is, at best, inaccessible to the masses.\r\n<br><br>\r\nIn an effort to reach those black and brown teens within Greater Newark who will be going to college fairly soon, I attempted to conduct outreach for workshop participants on social media, through family and friends, at two high schools that I had  attended, a public library, and the Newark Housing Authority via the Training Recreation Education Center (TREC) where I now hold a partnership and will be hosting The HOTSpot’s STEAM workshops on a weekly basis.","context_research":"While underserved minority students may not be graduating from STEAM programs at the same rate as their peers - despite their potential interest in STEAM comparing in rate to their White and Asian counterparts - we must acknowledge the differences in what has been accessible to each population. I would argue that there are a number of reasons for the gap, including but not limited to:\r\nmany minority students attending public schools whose circumstances don’t allow for the best quality of education;\r\navailable STEAM-related programs cost money and students lack financial assistance; and\r\nlimited mentorship and extracurricular STEAM opportunities within these communities altogether.\r\n<br><br>\r\nAfrican American, Native American, and Hispanic college students who are interested in STEAM career paths tend to: enroll in these majors but switch before completion; earn STEAM degrees but not pursue careers in the field upon graduation; avoid enrolling in STEAM-related majors at all. As a result, these underrepresented people make up only about 10% of those working in science and engineering occupations. This number pales tremendously in comparison to the 73% of White and 17% of Asian people who fill these same roles.\r\n<br><br>\r\nInspired by programs like Girls Who Code, Black Girls Code and Made in Brownsville, and events like Afrotectopia, my expectation had been to expose STEAM-enthusiastic and STEAM-weary high school students to a day full of workshops. “Wowing” them just enough could allow me to promote their eagerness to learn more and eventually increase their probability of following a STEAM path through the professional career level.","technical_details":"After deciding on “The HOTSpot” as the name of my program/organization and thus my thesis, I made sure there were no evident copyright or trademark issues with the name. I secured the domain for the website and the handle for social media, then worked on developing more content - particularly marketing materials.\r\n<br><br>\r\nThe only other things I needed in a hurry were the materials for Pilot Day workshop activities and food to serve for Pilot Day lunch. I developed a budget and applied for the Calisha Myers Community Impact Fund, from which I received nearly $200 of support.","further_reading":"<p>I grew up in Newark, NJ and had the luck of having had both ordinary and extraordinary experiences afforded to me. A major reason for this was the relentless determination of my mother and family. I could see that my experience was unusual, and these opportunities were not as accessible to my peers. That opened my eyes pretty early on to some of the things that were missing in my community. Collectively, these experiences molded my mind and shaped my sympathies so that I could aspire to be a person to promote the type of positive change I would like to see in this world.</p>\n<p>My childhood was filled with fun, indoors and outdoors. I read a lot, took dance classes 3 or more days a week, and participated in science fairs every year (placing a number times) from elementary all the way through middle school. I went on nature walks and asked a million questions every time I stepped foot into the Liberty Science Center (and everywhere else for that matter). I built forts or drew illustrations for stories I made up with my younger sister. I watched HBO Family’s “Crashbox” for the math and riddles, and “Happily Ever After” for the culture. And I willingly did these things as often and for as long as I could because I truly enjoyed them. From 7th to 12th grade, I actively participated in the Upward Bound (Consortium for Pre-College Education in Greater Newark) program, which was geared towards exposing underserved students to math and science and the benefits of higher education. In many ways, the Consortium has had a major, almost automatic influence on the vision that has become The HOTSpot. All things considered, I feel the need to acknowledge my privilege in regards to these experiences. I was afforded these opportunities, big and small, because my family believed they were important for me to experience, <b>and</b> they had the time and resources to make them available to me.</p>\n<p>My grandmother, who was a Registered Nurse for nearly 40 years, always valued education and well-roundedness - ensuring that her daughter possessed these qualities and in turn passed them onto her grandchildren. My mom, always eager to feed and cater to my educational endeavors, was very hands-on in science projects and kept me happily involved in advanced, extracurricular study. She was also very supportive of my love and passion for dance and enabled the enhancement of what talent I had by ushering me towards dance programs that we could access at different points of my life. I think that it may have always been clear that I would find my purpose in STEAM - even before “STEAM” was coined as a concept. For years, I thought that becoming a pediatrician would be the best way to work with children and help those around me. I was fascinated with the idea.</p>\n<p>On the flip side, there came a time where my family’s resources were more limited, and so I could no longer engage in my favorite activites at the levels of expertise and professionalism that I had known before. Growing into a woman who would instead find purpose in granting access to STEAM for those who are growing up (or have grown up) in underrepresented and underserved communities as I did, has proven to be the perfect equivalent to being the neighborhood doctor, and hence the best thing I could be doing right now.</p>\n<p>My thesis gave way to an organization called The HOTSpot. (HOTS is an acronym for Higher Order Thinking Skills.) I believe I can close gaps through a network of mentorship by:</p>\n<ul>\n<li>creating a connection between underrepresented community members and others who can serve as resources,</li>\n<li>the development and implementation of a curriculum, and</li>\n<li>the dependability of a centralized location.</li>\n</ul>\n<p>After deciding to target high school students for a Pilot Day event, I began to build out a curriculum that featured examples of the types of workshops I would consider running in this program. Among them were a science/technology workshop on making a lightbulb, and “How To B-Boy,” a hip hop dance class. In the light bulb session, there was a discussion about the black inventor Lewis Howard Latimer, who is responsible for making monumental improvements on the light bulb in 1881, replacing Edison’s original paper filament with carbon filaments. This discussion is a relevant component to the workshop as it helps validate a cultural connection to science, thus identifying the student as worthy and capable of achievement in the field.</p>\n<p>I proceeded to search for a venue to host my workshops. The Training Recreation Education Center (TREC) is a state-of-the-art community space with meeting rooms, classrooms, a large gym, a computer-filled study room, a dance studio and a workout room. I spoke to the facility manager at the TREC, who, once I told her of my plans simply said “Yes!” I had a place to invite participants to come and engage where they would not have to travel very far, could access a beautiful, safe, and comfortable venue within their neighborhood -- and which they may not have visited otherwise. The TREC hosts programs like Girl Scouts troops, an SAT Prep program called Teen Titans, and Chess and Zumba classes. The HOTSpot will conduct further upcoming workshops at the TREC through June.</p>\n<p>I also conducted outreach for volunteers to lead workshops. The HOTSpot seeks STEAM professionals, STEAM students and neighborhood creatives who are available and interested in sharing their time and expertise with program participants, giving them 30-60 minutes of some STEAM-related skill-building and/or mind stimulating content. Within 3 days, I had four potential workshop leaders registered for consideration. This was an indication that the network of people I wanted to nurture could blossom if I tended (or nudged!) it properly.</p>\n<p>Despite my efforts, the first workshops held at Pilot Day on April 13th attracted few registrants. However, parents who were stopping by the TREC to see about other programs for children were introduced to The HOTSpot during their tours. 4 people - younger children than I’d targeted for - and their parents stayed and participated. Additionally, adults who came across my flyer on Facebook or heard about the program through word of mouth decided to stop by and check it out. Thanks to my family’s continued support (as they assisted with marketing online and to friends, and also showed up to participate) and the convenience of the TREC’s location and purpose, there were 11 participants in all at Pilot Day for a total of 3 workshops:</p>\n<ul>\n<li>Light it Up - we made personal flashlights with 5 materials, including an LED, AA batteries, and construction paper;</li>\n<li>AR Escape Room - Movers &amp; Shakers NYC introduced their AR Escape Room project;</li>\n<li>Podcasting 101 - we spoke about what a podcast is and the basic things to know about making them.</li>\n</ul>\n<p>In order to track data regarding individual interest and participation levels of each participant, I created surveys - one for before the workshops began and another for once Pilot Day was over - to gauge changes in those respective areas. What I found was that all those who were initially uninterested in participating in extracurricular STEAM activities left the event feeling more interested and comfortable. I also confirmed that 100% of Pilot Day participants who surveyed in the end would come back and recommend to others for future STEAM workshops at The HOTSpot.</p>\n<p>In conclusion, Pilot Day was not 100% what I had planned, but it was a wonderful, eye-opening, eventful first day and proved to me in unexpected ways that this program is needed and desired, and that I can be the driving force behind the positive changes that would be made through the successful implementation of The HOTSpot curriculum and overall program.</p>\n<p>The HOTSpot will continue to “Bring STEAM to the Hood,” serving the    underrepresented population of the Greater Newark community with both age-specific and “open-to-all” workshops. The next full day session will take place on May 4, 2019.</p>\n","tags":[{"name":"Accessibility","slug":"accessibility"},{"name":"Culture","slug":"culture"},{"name":"Education","slug":"education"},{"name":"Networks","slug":"networks"},{"name":"Social Good/Activism","slug":"social-good-activism"}],"video_presentation_url":"https://vimeo.com/337314376","video_documentation_url":"","project_url":"https://thehotspotnj.org","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/headshot169-768x432-1.jpg","title":"headshot169-768x432","alt":"stephanie headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thsminilogo169-1024x576.jpg","title":"theHOTSpotMiniLogo169","alt":"The Hotspot Mini Logo","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/THSPilotDay5-1024x683.jpg","title":"Stephanie_THSPilotDay","alt":"Stephanie Paige with Pilot Day Flyer, Founder of The Hotspot at The Training Recreation Education Center","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/THSPilotDay2-1024x683.jpg","title":"THSPilotDay","alt":"Teen Participant @ THS Pilot Day","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/StarWarsDay1-1024x683.jpg","title":"StarWarsDay1","alt":"Child Participants at the Hotspot's Star Wars Day Event","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/StarWarsDay2-1024x683.jpg","title":"TheHOTSpotPresents...","alt":"Left displays The HOTSpot's Star Wars Day Event Flyer; Right displays Stephanie Paige Chambers, Founder of The HOTSpot, with Mini Lightsaber Cards created at the Star Wars Day event.","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/CraftYoda-1024x683.jpg","title":"CraftYoda","alt":"Fortune Telling Yoda Figures created at Star Wars Day","caption":""}]}