{"student_id":"131","student_name":"Terrick Gutierrez","student_slug":"terrick-gutierrez","advisor_name":"Adaora Udoji","title":"Ride Home","thesis_statement":" Ride Home places users at the center of a virtual reality narrative which shines light on police violence through the lens of a vehicle passenger. The intent behind Ride Home is to explore how immersive technology can be used to inform, educate, and potentially change the minds of those who do not live these experiences in their daily lives.","abstract":"Police brutality is a racial issue that plagues our nation, one that is largely rooted in racial discrimination, social control, and surveillance. It’s one that has affected me directly. My personal and indirect experience of police harassment and violence have influenced me to create Ride Home, a virtual reality narrative that shines light on police violence through the lens of a vehicle passenger. The objective of Ride Home is to explore how immersive technology, namely virtual reality, can be used to inform, educate and potentially alter the minds of people who do not live these particular experiences. Research shows that the more immersive an experience is, the greater potential impact it has on attitudes and behaviors. ","context_research":"Police brutality is a racial issue that plagues our nation, one that is largely rooted in, racial discrimination, social control, and surveillance. Its origin dates back to slavery and took the form of slave patrolling, a system that enabled groups of Southern White men to discipline and surveil enslaved Africans. Police brutality disproportionately targets black and brown people. I have experienced this injustice first hand when I was thirteen-years-old. On my way home from the store, I was stopped and frisked by a White police officer. My personal and indirect experience of police injustice have influenced the creation of Ride Home, a virtual reality narrative that sheds light on police violence through the lens of a vehicle passenger. In this story, a virtual driver gets pulled over by a police officer who is then asked to get out of the car. Shortly after, an incident unfolds between the two. This experience incorporates actual footage of police traffic stops and images of victims of police shootings. Ride Home explores how immersive technology, namely virtual reality can be used to inform, educate and potentially alter the minds of people who not live these particular experiences. Studies have revealed that 3D immersive technologies such as VR can give users the opportunity to emotionally engage with content or narratives. Additionally, research shows that the more immersive an experience is, the greater potential impact it has on attitudes and behaviors which is precisely why my approach to discussing police harassment, violence, and shootings takes place in VR.\r\n","technical_details":"Ride Home was created through Unity 3D and was developed for the Oculus Rift. \r\n \r\n","further_reading":"","tags":[{"name":"Narrative/Storytelling","slug":"narrative-storytelling"},{"name":"Social Good/Activism","slug":"social-good-activism"},{"name":"VR/AR/Immersive","slug":"vr-ar-immersive"}],"video_presentation_url":"https://vimeo.com/336821978","video_documentation_url":"https://docs.google.com/document/d/1W26xd12u2QMDzxh9hnqvqxWpaOeDkUsv31_jwk-ZeoE/edit?usp=sharing","project_url":"","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Gutierrez-768x515-1-1.jpg","title":"Gutierrez-768x515-1","alt":"Terrick portrait","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Gutierrez_MainImages_1-768x513-1.jpg","title":"Gutierrez_MainImages_1-768x513","alt":"Gutierrez_MainImages_1","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Gutierrez_MainImages_1-1-1024x684.jpg","title":"Gutierrez_MainImages_1","alt":"Gutierrez_MainImages_1","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Gutierrez_MainImages_3-1024x680.jpg","title":"Gutierrez_MainImages_3","alt":"Gutierrez_MainImages_3","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Gutierrez_MainImages_6-1024x682.jpg","title":"Gutierrez_MainImages_6","alt":"Gutierrez_MainImages_6","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Gutierrez_MainImages_2-1024x679.jpg","title":"Gutierrez_MainImages_2","alt":"Gutierrez_MainImages_2","caption":""}]}