{"student_id":"134","student_name":"Tong Wu","student_slug":"tong-wu","advisor_name":"Nancy Hechinger","title":"Daily Dividuals","thesis_statement":"This is a series of avatar-based, Augmented Reality body sculptures of surreal scenes from everyday life in an imaginary future where the roles of human and machine are reversed. Combining social commentary and satire, this project reflects alienation of and between individuals and their surrounding environments due to increasing complexity and capability of technology in the age of algorithm. ","abstract":"“Daily Dividuals” includes a series of Augmented Reality (AR) sculptures presented in short movie clips to provide context. To reflect on the core concept, human alienation in the digital age, the project layers the theme and presents, through an AR lens, the imaginary transformation of the human body merging with and functioning as everyday objects. \r\n\r\nThe project contains two experiments with three examples in each. The student scanned her body to create a hyper-flexible avatar model, and used the model as the key material to construct scenes in the project. The first experiment creatively associates body avatars with everyday objects in shape and function, and explores the possibility and flexibility to duplicate and modify avatar models in an AR environment. \r\n\r\nThe second experiment is a continuation of the first. It purposely reverses the conventional ways a human interacts with common devices, thus presenting an unorthodox perspective in which to reexamine the alienation of humans. The second experiment has more interactivity involved. The audience can explore layers of the AR sculptures through various actions. Therefore, the “seeing” and the “being seen” together fulfill the concept of this experience. \r\n\r\nPlaying with dystopian connotations through the jarring and surreal images, the project prompts viewers to pause and consider the phenomena of estrangement observed in our evolving relationship to and dependence on machines. \r\n\r\nWhen the public becomes insensitive to being treated as measurable data and samples; when people are used to only see highly abstract representation of the complex digital world; when intensive, repetitive human labor is constantly fed into the artificial intelligence industry, are we still dominating the machines, or are we being dominated? We strive to make machines more like us, but it may be that we are becoming more like machines. In a way, we are meeting machines in the middle. ","context_research":"The core concept of this project, human alienation, is a famous philosophical concept used by Karl Marx and Michel Foucault to describe the failure to realize oneself in one’s bodily activities under the capitalist mode of production. Laborers were forced to engage in specialized, fragmented, monotonous one-sided labor, they were estranged from their own potentialities as creative, self-realized many-sided beings. <br><br>\r\n\r\nIt might sound cliché  to bring up this century-old theory, but we are actually undergoing another wave of alienation in this dazzling century. As an artist working in and thinking within the intersection between technology and art, my experiences interacting with the digital world constantly brings me the feeling of being alienated and objectified. In many cases, the interaction between human and machines is becoming so unequal and superficial that it only requires such simple triggers from us as sound, movement or even just the existence of a body with warmth. <br><br>\r\n\r\nIn Gilles Deleuze’s Postscript of Modern Society, he coined the term “dividual”, as “individual” can no longer represents the smallest unit that society could be reduced to. The evolving modern technologies of control makes humans to lose their whole self, and “become ‘dividuals,’ and masses, samples, data, markets, or ‘banks.’ (Deleuze, 1992)” With a social system constantly turning each person into trackable, measurable and virtually marketable components, would those unmeasurable feelings and thoughts be transformed or be trashed? The way we engage with the social systems has been fundamentally reshaped. ","technical_details":"The creation process of \"Daily Dividuals\" includes two parts: The making of human body avatar model, and the making of Augmented Reality (AR) visuals. <br><br>\r\nThe human body avatar model was created by using structure sensor for real person scanning, and processed with Maya for UV mapping and Mixamo for animations sourcing. The AR visuals are realized by using AR SDK including ARKit and Vuforia on Unity Engine.","further_reading":"","tags":[{"name":"Art","slug":"art"},{"name":"Speculation","slug":"speculation"}],"video_presentation_url":"https://vimeo.com/337314410","video_documentation_url":"https://vimeo.com/331155335","project_url":"http://tongwumedia.com/blog/daily-dividuals","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/YourPhoto-768x432-1.jpg","title":"YourPhoto-768x432","alt":"tong headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Main-Image-1024x576.jpg","title":"Main Image","alt":"A line of rendered avatar models waiting in line with one being curiously leaning her body and looking out.","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/HumanSampleBanner-1-1024x576.jpg","title":"HumanSampleBanner","alt":"A human figure is rendered on the top of an usb drive","caption":"A human figure is rendered on the top of an usb drive"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Fan_v6-1024x576.jpg","title":"Fan_Banner","alt":"Several human figure avatars are rendered into a fan-shape object and standing on the floor","caption":"Several human figure avatars are rendered into a fan-shape object and standing on the floor"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/HoldOnBanner-1024x576.jpg","title":"HoldOnBanner","alt":"A line of miniature human figures are binding a book in place of a plastic book binder","caption":"A line of miniature human figures are binding a book in place of a plastic book binder"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/FanningBanner-1024x576.jpg","title":"FanningBanner","alt":"A woman is reading a book on a sofa with a human-shape fan fanning her and a cat observing at the corner in a living room environment.","caption":"A woman is reading a book on a sofa with a human-shape fan fanning her and a cat observing at the corner in a living room environment."},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/HumanSampleBanner-1024x576.jpg","title":"HumanSampleBanner","alt":"A USB drive is placed right next to a laptop, with multiple animated human figures flying over it.","caption":"A USB drive is placed right next to a laptop, with multiple animated human figures flying over it."}]}