{"student_id":"135","student_name":"Vidia Anindhita","student_slug":"vidia-anindhita","advisor_name":"Kathleen M Sullivan","title":"Solus","thesis_statement":"Solus is a series of smart devices that highlights our sense of smell so that people who feel alone can find a state of solitude and joy. How can we transform the experience of this feeling of loneliness into solitude, a state of being alone without being lonely, by exploring our senses and mental states?","abstract":"Solus explores how to regulate our physiological and emotional equilibrium through sensory experiences. The project chooses scent as a method to shift the brain from feeling lonely to embracing solitude and a strong sense of joy.\r\n\r\nThe aim is for three different smart devices to disrupt this perspective of aloneness by using the most pervasive but often forgotten human sense of smell.\r\n\r\nThe three devices are Scent Notification, Scent Clock, and Scent Speaker. Each device was designed to create a multi-sensory experience that impacts mood and memory to transform space in meaningful ways. The scents were designed through the research process to help us feel at peace in our own company and achieve the state of solitude.","context_research":"Aloneness can be perceived differently by our brain: we can feel loneliness or solitude. <br><br>\r\n\r\nLoneliness makes us feel “out in the cold”, marked by a sense of estrangement and, an awareness of excess aloneness. It becomes a mental health issue when we can’t break off of the negative thoughts, sensations, and behaviors. \r\n<br><br>\r\nTo transform the feeling of loneliness to solitude, one needs to know the importance of being able to feel at peace in one own company. <br><br>\r\n\r\nHuman senses play a big role in how we perceive and experience the world. Of all our senses, our sense of smell can be one of the strongest senses. The smell instantly triggers such strong memories and emotions. Smell is also better than images at inducing the feeling of “being brought back in time”.\r\n<br><br>\r\nBy integrating the sense of smell into Solus devices, human perception is taken to a higher level and enhances the way we interact with the world. Solus aims to open a new exploration into how people use underused senses to control perception by using everyday technology.","technical_details":"These smart devices can be controlled through a mobile app. The network framework is developed using Node.js and designed in RESTful API protocol that allows the server and client sides to communicate with Spotify’s API to gather song data and send back to the devices.<br><br>\r\n\r\nThe devices were built with Arduino MKR1000 which was designed for Wi-Fi connectivity. The structure was designed to integrate the release of scents with light interactivity using atomizer, a device module for emitting water, and NeoPixel module. The mobile app was developed using Apache Cordova to enable a web framework for software development.","further_reading":"<p>The name Solus is the origin of solitude in Latin. It was given with the hope that one could enjoy aloneness and reach the state of solitude.</p>\n<p>Solus designs space with scents to elicit joy and change the perception of aloneness.</p>\n<p>The Scent Notification is a physical notification device that releases a certain scent when a person receives a digital message from someone that s/he cares about. This notification creates a parasocial interaction, an illusionary experience of face-to-face interaction but it is actually mediated, to enhance the physicality of digital communications.</p>\n<p>The Scent Clock is an olfactory device that represents time in the form of scents. The clock transforms people moods to be calm and relax based on time perception.</p>\n<p>The Scent Speaker is a scented personal music player that releases scents based on the type of song playing at the moment. The speaker creates a multi-sensory experience while listening to music. The integration of auditory and sense of smell elevates the invisible frequency of music to influence how people experience physical space.</p>\n<p>The scent of lilac and cucumber from Scent Notification brings us immediately across the countryside to reconcile the memory of a precious person. A whiff of geranium in the morning, citrus at daylight, and rose at night from Scent Clock enlighten our moods over time during the day. The Scent Speaker mixes auditory and smells to combine the warm smell of lavender with calming songs and peppermint with energetic songs.</p>\n<p>Designing smart olfactory devices need to consider how they meet the need from the public. Achieving the state of solitude by relying on the human sense of smell is subjective and personal. However, the communication of scents can be universal and thus have impacts on the human condition. The language of scents can shape the way humans experience the world. Every scent, from floral, to fruity, spice, and earthy, can drive powerful experience that gives us an opportunity to explore all of our senses.</p>\n","tags":[{"name":"Design","slug":"design"},{"name":"IOT","slug":"iot"},{"name":"Memory","slug":"memory"},{"name":"Product Design","slug":"product-design"},{"name":"UX","slug":"ux"}],"video_presentation_url":"https://vimeo.com/336827139","video_documentation_url":"https://vimeo.com/331408715","project_url":"https://www.vidia.site/solus","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Vidia-768x432-1.jpg","title":"Vidia-768x432","alt":"vidia headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Thumbnail-1-1024x576.jpg","title":"Solus Thumbnail","alt":"Solus Thumbnail","caption":"Solus Thumbnail"},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Solus-1024x683.jpg","title":"Solus","alt":"Solus","caption":"Solus"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Scent-Clock-1024x683.jpg","title":"Scent Clock","alt":"Scent Clock","caption":"Scent Clock"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Scent-Notification-1024x683.jpg","title":"Scent Notification","alt":"Scent Notification","caption":"Scent Notification"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Scent-Speaker-1024x683.jpg","title":"Scent Speaker","alt":"Scent Speaker","caption":"Scent Speaker"}]}