{"student_id":"136","student_name":"William F Hallett","student_slug":"william-f-hallett","advisor_name":"Adaora Udoji","title":"Axolotl: designing social blur","thesis_statement":"Axolotl: Designing Social Blur is a virtual reality installation and software design project that explores what a brutalist aesthetic for immersive social media might look like and sound like. By exploring the weird aesthetic space that floats just prior to where information is rendered totally illegible and chaotic, Axolotl seeks to push social media data towards non-human and utopian environments that have the capacity to reshape how we think about social connection.","abstract":"The principal focus of this thesis is the social. The concept of the social has risen in importance not only through the rise of corporatized social media and its rhetorical image of a worldwide social-graph, but also in scholarly criticism. Critical discussions about the post-human, the non-human, transnational flow, and even matter itself, all take up and question what it might mean for a thing to be social at all. Following a methodology that incorporates scholarly research, new media design, and artistic practice, I’ve tried to think about the social from a bit of a different perspective. <br><br>\r\n\tThe humanities have in many ways split into two meta-methods of critical scholarship: critique following the Marxist theory of historical progress and problematization following Gilles Deleuze’s theories of historical fluidity and chaos. Considering how we might use new media design to create a different image of what it means to be social, I’m interested in computational workflows that problematize social relations through chaos-inspired audiovisual aesthetics but that also retain the coherence and accessibility of a public, or commons, that resists elitism and exclusion. <br><br>\r\n\t To this end, anticipating the mass-adoption of immersive media devices such as AR and VR amongst existing social media platforms, I’ve used VR headsets and media objects scraped from participants’ real newsfeeds in order to overlay a different image of the social on top of the existing networked infrastructure. I’ve designed Axolotl to express the data from this network in a chaotic way, taking aesthetic inspiration from contemporary sculpture through artists such as Isamu Noguchi, Arakawa and Gins, and Olafur Eliasson.<br><br>\r\n\tComputationally, I’ve loosely adapted an approach engineered by Dr. Sha Xin Wei’s Media Choreography Framework (2000-) towards a workflow that drives the aesthetic modulations of 3D shapes and sounds in Unity 3d with a state-engine written in Max/MSP. The two are coordinated over CNMAT's open sound protocol (OSC). ","context_research":"","technical_details":"","further_reading":"<p> In close communication with contemporary theorists such as Luciana Parisi, Alexander Galloway, Thomas LaMarre, Antoinette Rouvroy, Beatrice Fazi, Jasbir Puar, Orit Halpern, Marina Hassapopoulou, Sha Xin Wei, and Anne Pellegrini, the project works to extrude the social graph into a new brutalist structure that has the potential to shape a new image of the social. Through this effort, the project engages a research project towards an ethical aesthetics for what Gray Crawford calls the hyper-physical affordances of spatial computing. As such, the project functions along theoretical and practical axes towards an aesthetic and philosophical object under the rubric of what Sha Xin Wei refers to as speculative engineering. At this moment, Axolotl can and has been deployed as a functional VR installation. It is scheduled to be open-sourced via Github in November of 2019.</p>\n<p>               Axolotl is speculatively intended to be scaled indiscriminately, as an immersive layer or plugin than can be draped over our current social media infrastructures. As a VR installation, the project uses two or more PC’s connected to two or more headsets. Each headset displays a 3D version of a Facebook newsfeed belonging to the consenting participant. As the participants walk, in any direction, they interpolate or blur between their own 3D newsfeed and those belonging to their fellow participants. Keeping the interaction intensely minimal, Axolotl is designed to nuance the upright human walk or gait and imbue it with different meaning.</p>\n<p>               Using a stack of free software, Axolotl is designed and programmed to balance automation and scale with abstraction and aesthetics. One embodiment of the implementation functions as follows: Participant’s first grant Axolotl access to their newsfeed. Their images and sounds are then saved onto the PC. The images are extruded into 3d sculptures using Blender (a 3d modeling program) and the sounds are warped into soundscapes using a loop station coded in Max/MSP (among other things, a sound and music design program). Additionally, and this is where the more technical research is focused, Axolotl analyzes the changing order of posts on a particular newsfeed as it is refreshed a given number of times in order to construct a topological representation of the how the newsfeed algorithm is ranking that particular participant’s media content. The sculptures and soundscapes are then uploaded to the Unity game engine and their scale, position, and sounds are choreographed using what is commonly called a state engine.</p>\n<p>               The state engine, written in max by Arizona State University researchers Sha Xin Wei and Brandon Mecthley and connected to unity over the open sound control (OSC) protocol, uses numerical values from the topological representation as input in order to output dynamic and changing sets of parameters that choreograph the sculptures and soundscapes in Unity. So, in short, Axolotl interprets how the newsfeed is ranking its content for a given participant and then uses that interpretation to choreograph, or steer, the transformation of soundscapes and sculptures in the VR headset, continuously. The claim is thus that Axolotl is getting the newsfeed ranking algorithms to abstractly and chaotically express themselves in a 3D environment. And moreover, that this can be automated in an aesthetically meaningful way and programmed according to an open-world gaming model; where participants can break the wall between feeds and openly traverse the social graph through an action as simple as walking.</p>\n<p>               Adjacent to the technical and aesthetic iteration process, I conducted a large amount of research into how designers, theorists, and artists have been thinking about immersive media, focusing most particularly on how VR interactions don’t necessarily have to strictly follow our normal laws of physics. As I.E. Sutherlund put it in 1965, “There is no reason why the objects displayed by a computer have to follow the ordinary rules of physical reality with which we are familiar” (Sutherland, 1965). Quoting spatial interface designer, Gray Crawford, in 2018, “With the advent of computer-rendered dynamic media, phenomena could be represented that diverged from the physical laws classically confining designed artifacts. This larger space of possible physical dynamics of which the physics of our universe is but a subset, I refer to as hyperphysics (Gray Crawford, 2018).” Crawford is thinking of a hyperphysics here in regards to spatial interfaces’ (such as VR) capacity to connect users and their bodies to physical laws other than those that we are used to. To put it simply: in VR, gravity can be up instead of down.</p>\n<p>               Axolotl’s central philosophical claim is that the aesthetics that we imbue hyperphysical interfaces with have extreme ethical consequences and contours that can be expressed through biopolitical and necropolitical frameworks. While I don’t have space to define the unethical approach, Axolotl is intended to demonstrate an ethical aesthetics of the hyperphysical affordances of VR within the context of social media and the techno-social utopianism of mid-twentieth century brutalist architecture. However, rather than miming the geometric or textural forms of the brutalists and new brutalists, I reference their tradition insofar as the notion of “raw concrete” can be reinstated in a “raw data” approach to immersive social media design that entangles functionality and aesthetics into single form. To quote Luciana Parisi, “The architecture of New Brutalism turns instruments of thinking into concrete, mass-modular, interconnected blocks of self-contained individual cells, elevated above the local territory, united by streets in the sky or networks of corridors across discrete parts of buildings . . . [proposing] modes of instrumental reasoning that work through entropy, randomness, or noise to reprogram codes and values, passages and bridges, contents and expressions of a united image of the social (Luciana Parisi, 2017).” I hope, with caution, that Axolotl is a step forward in advancing theory and practice towards direct, albeit abstract, political action.</p>\n","tags":[{"name":"3D","slug":"3d"},{"name":"social practice","slug":"social-practice"},{"name":"VR/AR/Immersive","slug":"vr-ar-immersive"}],"video_presentation_url":"https://vimeo.com/336822002","video_documentation_url":"https://vimeo.com/329936360","project_url":"https://williamfhallett.wordpress.com/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Headshot-2-768x917-1.jpg","title":"Headshot-2-768x917","alt":"william headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/brianna_whiteBox_render-768x460-1.jpg","title":"brianna_whiteBox_render-768x460","alt":"brianna whitebox render","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/TechDiagram-1024x576.png","title":"TechDiagram","alt":"tech diagram","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Interaction_Diagram_02-1024x576.png","title":"Interaction_Diagram_02","alt":"interaction diagram","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Interaction_Diagram_-1024x576.png","title":"Interaction_Diagram_","alt":"interaction diagram","caption":""},{"src":null,"title":"parisiQuote","alt":"WCAG violation: this image will not be displayed due to lack of alternative text.","caption":""},{"src":null,"title":"24","alt":"WCAG violation: this image will not be displayed due to lack of alternative text.","caption":""}]}