{"student_id":"138","student_name":"Alan Peng","student_slug":"alan-peng","advisor_name":"Nancy Hechinger","title":"The Tangram Blanket","thesis_statement":"The Tangram Blanket turns a seemingly basic and everyday object into a toy that helps children to develop skills in sensory and cognitive domains. It not only provides warmth and comfort but also lets children play while learning the world through an imaginative and creative way.","abstract":"For my thesis, I hope to turn an everyday object in children's life into a toy that fires the imagination through the simple interaction. Children play with whatever they can find around them, and they are often emotionally attached to the blankets they sleep with every night. What if we had a chance to reimagine the blankets, make them even more versatile, and embed them into the play activities? Inspired by the ancient Chinese Tangram puzzle, the colorful and comfortable Tangram Blanket will greatly enrich children's play experience.\r\n<br><br>\r\nThe Tangram Blanket aims to foster children’s imagination and creativity through play. It starts as a product design idea that leverages my parents’ business, which is a fleece manufacturer. The Tangram Blanket is mostly made of fleece, a soft and comfortable material. The blanket consists of 7 pieces of fabrics in different geometry shapes, colors and textures. By taking a cue from Tangram, one of the most popular and timeless dissection puzzles, each piece of fabrics can be easily attached and detached with each other using magnets to form various shapes. Through the activity, children will be able to develop their language skills, mathematical thinking, and spatial sense. The Tangram Blanket is not only a blanket that keeps children warm and cuddly but also encourages them to play, build and bring their imaginations to life.","context_research":"Toys serve many different purposes, and there are countless toys for accompanying children to understand the world around them. Some would stimulate creativity, while others would aid in the development of problem-solving skills. In addition to the personal development, toys are also essential to building emotional and social skills. Today, there are many new digital technologies that have not existed before to help to build toys; however, the results of the present study suggest that an abundance of digital worlds don't encourage children to use their imagination, especially for young children ages 2 to 5 years.\r\n<br><br>\r\nIn the process of child development, cognitive skills are vital to a child's ability to comprehend ideas and concepts, to think and learn. Children start to develop and refine cognitive skills through play from birth. Same for the sensory skills, children are born exploring the world through their senses. They touch things around them, put things in their mouths, make funny noises and experiment how the world sounds with fingers stuck in their ears. While absorbing those experiences and make sense of the world, imaginative play is needed for children to reach full potential. It gives children practice in independent and gradually develop decision-making skills.","technical_details":"","further_reading":"","tags":[{"name":"Design","slug":"design"},{"name":"Education","slug":"education"},{"name":"Play/Games","slug":"play-games"},{"name":"Product Design","slug":"product-design"}],"video_presentation_url":"https://vimeo.com/337314460","video_documentation_url":"","project_url":"","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/default.png","title":"default","alt":"default","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Thumbnail-Image-1-1024x576.jpg","title":"The Tangram Blanket","alt":"The Tangram Blanket","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Main-1-1024x683.jpg","title":"The Tangram Blanket","alt":"The Tangram Blanket","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Main-2-1024x683.jpg","title":"Interact with the Tangram Blanket","alt":"Interact with the Tangram Blanket","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Main-3-1024x683.jpg","title":"A boy picking up a piece of the Tangram Blanket","alt":"A boy picking up a piece of the Tangram Blanket","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Main-4-1024x576.png","title":"Main-4","alt":"tangram image","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Main-5-1024x683.jpg","title":"A girl sleeping on the Tangram Blanket","alt":"A girl sleeping on the Tangram Blanket","caption":""}]}