{"student_id":"14","student_name":"Arnav Wagh","student_slug":"arnav-wagh","advisor_name":"Kathleen Stevens Wilson","title":"FLXO","thesis_statement":"Flxo is a thinking tool for soft-robotics exploration. It's a kit consisting of modular interlocking pneumatic muscles which easily integrate with other robotics kits on the market.","abstract":"Contrary to conventional robotics which employ rigid materials and motors, pneumatically or hydraulically actuated soft-robots are squishy and highly adaptive to their surroundings. This makes them safe and ideal for collaborative work with humans and other organic life.\r\n<br><br>\r\nSoft-robotics is an exciting and emerging field with a radically different approach to robotics, combining biomimetics and unconventional materials. This field is still in its infancy and there is still a lot to be discovered and invented. There isn't enough accessible literature and documentation on the subject and a large part of the exploration takes place in well-funded research labs. At present anyone who wants to tinker with soft robotics needs to go through the tedious process of design, fabrication and material sourcing.\r\n<br><br>\r\nFlxo is an effort to fill this gap by democratizing key concepts in soft robotics. Flxo consists of prefabricated modular components, entirely 3D printed on a conventional 3D printer, which interlock to create different mechanisms. Additionally, Flxo is also designed to be integrated with other robotics kits on the market for encouraging open exploration of soft robotics as part of STEM curriculum.","context_research":"I was inspired by modular kits like LEGO, K’nex or LittleBits which encourage thinking and creativity through a hands-on, build it yourself approach. I wanted to model a similar platform for encouraging soft robotics exploration. \r\n<br><br>\r\nA modular approach to soft robotics is not new and has been demonstrated effectively by the reconfigurable robotics lab (RRL) and a few other well-funded research labs. FESTO, a German pneumatic automation company manufactures modular soft grippers at industrial and commercial scale. A lot of the research level initiatives demonstrate a proof of concept of new ways of soft robotics fabrication or novel actuation methods using unconventional materials. Most of these demonstrations are very impressive but are primarily designed for either medical applications, or scientific research and search &amp; rescue operations, hence far from finding meaningful, affordable, readily accessible consumer friendly applications.\r\n<br><br>\r\nMy research is an exploration into making the concepts and principles of soft robotics more democratic, more available at the consumer level, by opening it up to play and creative exploration through an affordable, modular platform called Flxo. Central to Flxo are soft actuators or muscles which work as an engine for a given mechanism. Through rigorous trial and error, initially working with silicone and foam and a messy fabrication process, I eventually arrived at an optimized design which can be entirely 3D printed on even a basic desktop 3D printer available to the general public. The kit is also designed to integrate with the VEX robotics platform to make use of their existing array of structural and motion components.","technical_details":"The kit consists of two main parts, (1) Pneumatic muscles or 'soft actuators' and (2) adapters and connectors. The soft muscle parts are 3D printed on the Ultimaker 3 FDM printer with a dual extrusion head. They are largely printed in TPU 95A flexible filament with embedded rigid PLA components. The adapters and connectors are printed on a Polyjet printer in Acrylic.\r\n<br><br>\r\nThe soft muscles are pneumatically powered by Programmable air, an open source air control unit engineered by Amitabh Srivastav.","further_reading":"","tags":[{"name":"Design","slug":"design"},{"name":"Education","slug":"education"},{"name":"Experiment","slug":"experiment"},{"name":"Play/Games","slug":"play-games"},{"name":"Product Design","slug":"product-design"},{"name":"Robotics","slug":"robotics"},{"name":"Tool","slug":"tool"}],"video_presentation_url":"https://vimeo.com/336836071","video_documentation_url":"","project_url":"https://arnavwagh.work/flxo","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/default.png","title":"default","alt":"default","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thumbnail-14.jpg","title":"Actuators","alt":"The image shows a top view of the complete set of soft actuators","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Snap-1-1024x576.jpg","title":"Snap-1","alt":"This image shows hows easily existing pieces from Vex robotics snap into the soft actuator","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Snap-4-1024x576.jpg","title":"Snap-4","alt":"This image shows a robotic hand being assembled with the 4 soft actuators for four fingers and some pieces from the vex kit","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Hand-1024x576.jpg","title":"Hand","alt":"This image shows the robotic hand in action with one of the finger/actuator shown bent","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Walker-1024x576.jpg","title":"Walker","alt":"This is an image of a walking robot assembled from the same kit","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/00030-1024x576.jpg","title":"00030","alt":"This image shows a gripper assembled from the same kit. The gripper is shown lifting a small toy","caption":""}]}