{"student_id":"140","student_name":"Xiran Yang","student_slug":"xiran-yang","advisor_name":"Nancy Hechinger","title":"Blind Date","thesis_statement":"\tMy thesis project “Blind Date” is an interactive story with game elements in the format of a phone-based website. It features a 28-year-old single Chinese woman’s struggles with enormous pressure to get married early. It is a reflection and critique of the conventions surrounding marriage in contemporary Chinese society.","abstract":"\t “Blind Date” is a storytelling project that talks about marriage in the format of a web-based interactive story. A user plays the role of a 28-year old Chinese single woman who is being pressured by her friends and family to get married. <br><br>\r\n    There are three chapters in this game. The first chapter features the protagonist’s conversation with her best friend, Lorna, about the wedding of her younger friend, Cici. Along with the conversation, Lorna encourages the protagonist to date someone and warns her about the danger of becoming a leftover woman. In chapter two, the protagonist has a WeChat talk with her mother. Marriage is brought up in this conversation. And the resistance from the protagonist to get married angers her mother and leads to a fight between them. The protagonist compromises in the end and agrees to go on blind dates with several different men. That introduces the third chapter of the game. <br><br>\r\n    In the first two chapters of the game, the user will be clicking through different buttons and graphics to follow the story. In the third chapter, the user will make some decisions before she goes on blind dates and the choices she makes will effectively change the ending of the whole story.<br><br>\r\n    The user will be able to feel the increasing level of pressure the protagonist feels as the story goes on and hopefully he or she can take some insights away after experiencing this story.","context_research":"\tI used to consider “feminism” a sophisticated term that one is able to discuss only using heavy academic quotes. It was not until I played a Chinese game called “A Gay’s Life” that I changed my mind.  “A Gay’s life” is a narrative game about homosexuality. It communicates a seemingly difficult concept well by telling a story. I realized that I can also deliver ideas on feminism by creating an engaging experience. <br><br>\r\n\tAs I am about to turn 24, I started to hear the word “marriage” much more often. My family and friends started to ask me more about whether I have a boyfriend, and what were my plans about marriage. Interestingly, I found that mine was not a unique experience but a common story shared by many Chinese women. The marriage pressure that I and my friends face have therefore made “marriage” my chosen topic. <br><br>\r\n\tTo elaborate on this topic, I did my interviews from three approaches. The first one was academic research. My major reference was Sandy To’s book China’s Leftover Women*, whose studies are mainly based on about 50 interviews with urban educated Chinese women. My second research approach was in-depth interviews with 7 urban educated women around me, who are around my age. I also did an online survey with 85 people (25 males and 60 females). Based on gender and age differences, I asked them what are the most important qualities they look for from in a spouse. <br><br>\r\n\r\n* Note: Leftover Women refer to \"Urban professional women who are over 27 years old who have high educational level, high salary, high intelligence, and attractive appearance, but also overly high expectations for marriage partners, and hence are ‘left behind’ in the marriage market\"","technical_details":"    I built the game using JavaScript, Jquery, p5.js, node.js, HTML, and CSS. I also used Adobe Illustration, Photoshop and sketch to create visual assets that will appear in the game. ","further_reading":"<p>While marriage should be a choice based on free will, Chinese traditions and social conventions can make it obligatory. It's not a problem for women for whom marriage is their main goal in life, their first choice. They marry, and naturally follow the dominant social rules. But those who do not find marriage their ultimate life goal will become outsiders and targets of criticism. In addition, though marriage itself may be beautiful and romantic, the social expectations and pressures that accompany it make the 20's an extremely stressful time for Chinese women.</p>\n<p>Through my research, I found that Chinese women receive marriage pressures mainly from two places: people closest to them, and society. Chinese traditional culture values the importance of family and women bear more responsibilities in the family than men. With this cultural basis, getting married has become compulsory for women. At the same time, the aging crisis and lack of newborns have also led to social policies including the “two-children policy” that encourage females to get married early and have children earlier.</p>\n<p>Under the impacts of  “getting our females married quickly” and the fast-paced modern lifestyle, blind dates (dates between two people who have not met each other whose purpose is for finding marriage candidates) have become popular. In ancient time, parents arranged their children’s marriage without their consent. Blind dates are like a contemporary adaption of the traditional convention. Parents want to be involved in their offspring’s marriage issue, even though they can no longer make the final decisions.  They encourage their children to go on blind dates,  thinking that will help make the whole progress much more efficient. The popularity of blind dates somehow serves as evidence to show how impatient and anxious people are on the topic of marriage.</p>\n<p>I also did seven interviews in the very early stage of my project, at that time, I was just curious about Chinese women’s personal opinions on marriage and how their experience has been around it.</p>\n<p>My interviewees were between 24 to 27 years old, all single. By using the word “single” I am specifically referring to women who have never been married before. Some of the interviewees did have boyfriends. They were top university graduate students, a bank clerk, a designer and a professional working in the insurance industry. They were well-educated urban Chinese women who had the potential to be labeled as the “leftover women”.</p>\n<p>In these interviews, I was most interested in understanding their own opinions of marriage. I also asked about their expectations about marriage and their future mates. I was curious if they have personally experience any type of pressure on the topic of marriage.</p>\n<p>When I asked them what do they think about marriage in general, surprisingly, all but two said that they never really thought about marriage that much until people around them started to frequently ask them about it.  Michelle, a girl pursuing her career in Shanghai from a foreign city admitted that thought she would love to get married, she was also anxious and afraid about it. “To support a family in big cities like Shanghai can be pretty stressful. Besides the living expenses, you also need to think about housing, the education cost for your kids. And marriage is also not only a personal issue but a big thing for two families. It is not easy at all. (There are)so many things to worry about. Thus just thinking about it (marriage) sometimes drives me crazy.”</p>\n<p>Family/Peer Pressures - a result of the Chinese Confucian tradition</p>\n<p><i>    “I feel like I am not against (marriage), but I do feel peer-pressured sometimes. Many of my friends are dating, and some of them keep encouraging me to date someone. They set a timeline for what they should do at a certain age. They have plans to date someone when they are 23 or 24 and marry someone when they turn 27.” </i></p>\n<p>-Yiren, Graduate Student</p>\n<p><i>“Once I got my college degree and found a good job, my parents started to talk to me about my marriage issue. They always say ‘now that you have a degree and a job, you have finished most things you should do in your twentieth, the only thing left to worry about is your marriage. They make me feel that I have an incomplete life if I do not get married.”</i></p>\n<p>- Catherine, former Sports Brand marketing specialist</p>\n<p><i>“I feel like the public believes that women’s value will decrease along with the growth of their ages, which is the same case for men. I think it is unfair but unfortunately, that’s the truth.”</i></p>\n<p>- Yang, Bank Clerk</p>\n<p>“China is known for its centuries-old Confucian culture which promoted the centrality and stability of the family and the importance of observing one’s propriety within the social hierarchy.” (To, 25) Though the opening of China in the 70s has encouraged individualism, the importance of family is still deeply rooted in Chinese culture. As the old saying goes “Men are breadwinners; women are homemakers.”(男主外女主内), women have been traditionally expected to put more responsibility in their families than men. Marriage, as the ultimate end to form new family structures, is thus considered very important as well, especially for women. This can explain why some Chinese parents and young people believe that the life of their daughters or female friends are incomplete if they do not get married.  However, their kind “it’s for your sake that you should get married” can turn into great pressure.</p>\n<p>Not only that, the idea that “women’s value decreases as they age” has also made it urgent for women to marry themselves before they are 30. The age restriction, which seems to only apply to women is one more stress for Chinese women.</p>\n<p>Social Pressures - a result of political and economic reasons</p>\n<p><i>    “Yes, I think I want to get married before I turn 30 because I do not want to be labeled as a leftover woman.” - Catherine, Interviewee.</i></p>\n<p>Politically and economically, marriage has also become something even more important to the contemporary Chinese society as a result of the aging population and the increasing lack of labor force - “Marriage is a matter of political interest for the Chinese government, as it fights to raise birth rates and revive ‘family values’ in the face of an aging crisis...The message from the state is clear: Young people should get married and have children to save the nation’s future from economic collapse. (Qian Jinghua and Fan Yiying)  And within this context, the phrase “leftover women”, which is frequently used by major media platforms, seems to become a “stigma”  that compels women to get married (To).</p>\n<p>In addition, the results from my online survey with 85 people (25 males, 60 females) show that females care most about (in order of importance) personality, family background/status, education, appearance and income from the male marriage partners. While males care most about (in order of importance) the personality, appearance, family, age, and education of their partners.</p>\n","tags":[{"name":"Culture","slug":"culture"},{"name":"Design","slug":"design"},{"name":"Mobile","slug":"mobile"},{"name":"Narrative/Storytelling","slug":"narrative-storytelling"},{"name":"Play/Games","slug":"play-games"}],"video_presentation_url":"https://vimeo.com/337314523","video_documentation_url":"https://youtu.be/hs0QwcYG-dk","project_url":"https://xiranisabear.com/blind-date","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/IMG_8054-768x576-1.jpg","title":"IMG_8054-768x576","alt":"headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/人物卡片-19-1-1024x576.png","title":"Blind Date-Thumbnail","alt":"thumbnail for blind date","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/new-1024x576.png","title":"blind date","alt":"blind date phone screens","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/IMG_8221-1024x576.jpg","title":"user playing my game","alt":"an image of a user using her phone to experience my app","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/friend-19-1024x576.png","title":"mom, protagonist and lorna","alt":"images of mom, protagonist and lorna","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/dates-19-1024x576.png","title":"dates","alt":"dates characters in the story","caption":""}]}