{"student_id":"141","student_name":"Eva Yipeng Chen","student_slug":"eva-yipeng-chen","advisor_name":"Adaora Udoji","title":"The Code of the Cloisters","thesis_statement":"Imagine you are Dr. Robert Langdon from the Da Vinci Code, and having a new adventure in an epic medieval museum in New York City —— Not in VR, but the real world.\r\n","abstract":"The Code of the Cloisters is a physical immersive experience that allows you to explore the MET Cloisters museum in a brand new way. This project will allow visitors to act as detectives to collect clues and solve puzzles in the museum along with the help of an antique book and an AR app. <br><br>\r\n\r\nThe book is originally from the 18th century, it includes several stories and puzzles. All of them seem relative to the well- known exhibit —— the Unicorn Tapestries. Visitors will have to go to the Met Cloisters Museum where the tapestries are showed and try to figure out the puzzles with the help of a modern tool, an AR app, in this medieval style building. \r\n<br><br>\r\nThrough this process, a real connection between visitors and the exhibits will be built. People won’t feel the exhibits from thousands of years ago are too far to be reached out anymore. Visitors will be able to learn and to enjoy in this AR game.\r\n","context_research":"This idea comes from tons of my sorrowful museum visiting experience. <br><br>\r\n\r\nWhen I was in the Louvre, the Vatican Museum, the Palace Museum or the Metropolitan Museum, the magnificence of human civilization always attracted me. But when I wanted to learn more about their background history, it was not that easy. The audio guide always introduced every interesting exhibit in a boring way, and unfortunately, I got bored pretty easily. <br><br>\r\n\r\nI know all of us had at least once been hit by that sorrowfulness. \r\n<br><br>\r\nAfter that, I read Dan Brown’s novel. Dr. Robert Langdon, the main character in his novels, is a professor of art history and symbolism. He took adventures in many famous museums and tells a lot of background stories of the museum and exhibits in a very exciting way. I think I learned more about Vatican City from the fiction Angels and Demons than from the City itself even though I have personally been there. I realize the magic of storytelling from this experience. People are eager to learn, exhibits are marvelous —— we just need a story and technology to bridge the gap between human and exhibits. \r\n","technical_details":"Technically this project contains an AR app and a puzzle book. Geolocation detection, object detection, image target detection, ARKit, Maya modeling are the keywords for the digital part and the whole game is organized in Unity 3D. For the book, it contains the puzzles written in a medieval way and the book is decorated and scripted hand-crafted.","further_reading":"","tags":[{"name":"History","slug":"history"},{"name":"Mobile","slug":"mobile"},{"name":"Play/Games","slug":"play-games"},{"name":"UX","slug":"ux"},{"name":"VR/AR/Immersive","slug":"vr-ar-immersive"}],"video_presentation_url":"https://vimeo.com/336822070","video_documentation_url":"https://youtu.be/JekvUzLytgE","project_url":"","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/IMG_3163-768x512-1.jpg","title":"IMG_3163-768x512","alt":"headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thumbnailImage-1024x576.png","title":"thumbnailImage","alt":"thumbnailImage","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/UI1-1024x576.jpg","title":"UI1","alt":"ui1","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/visualGuide-1024x576.jpg","title":"visualGuide","alt":"visualGuide","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/prototype2-1024x576.png","title":"prototype2","alt":"ui2","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/userflow-1024x522.jpg","title":"userflow","alt":"userflow","caption":""}]}