{"student_id":"143","student_name":"Sandy Hsieh","student_slug":"sandy-hsieh","advisor_name":"Adaora Udoji","title":"Modular Patternmaking","thesis_statement":"Modular Patternmaking is my approach to systems thinking for the design and manufacture of wearable technology. To achieve seamless integration between hardware and soft wear, it is essential to leverage patternmaking at the intersection of fashion design and technology.","abstract":"Unlike fast fashion or PCBs, wearables are not easy to design or mass produce. The problem resides in the lack of communication and collaboration between two vastly different fields of expertise. Googling “wearable clothing” will return a myriad of IoT compatible sportswear and LED-enhanced garments that have failed to gain traction or acceptance in mainstream fashion. With limited understanding and access to what is possible outside of their respective industries, it’s proven difficult for fashion designers and engineers not to fall into the trap of designing gimmicky solutions for problems that don’t exist.\r\n<br><br>\r\nModular patternmaking is my careful dissection of the anatomy of clothing to examine how each parts of a whole can be manipulated, segmented, and/or combined to assemble a garment with integrated technology. When significant form factors such as garment type, silhouette, fit, design details, materials, trims, and finishes for accommodating hardware are identified and taken into account, can wearables find a place in mainstream fashion? \r\n<br><br>\r\nFor my thesis, I want to explore how modular patternmaking can be leveraged within the framework of product design to develop wearables of high value, support the integration of electronics, and be scaled for mass production. \r\n<br><br>\r\nTo demonstrate and test the viability of modular patternmaking, I designed a case study where I conducted qualitative interviews with 40 people about their style and how they envision the future of wearables. A thorough analysis and aggregation of common themes and insights led to the ideation of ‘Timepiece’, a leather motorcycle jacket that explores gesture as a wearables solution. \r\n","context_research":"For context and research, I read books and papers on the psychology of human-centered design, and multiple frameworks for product design and optimizing user experiences. I studied articles on the fashion supply chain, hardware hacking and manufacturing, connected devices, and the taxonomy of innovations for wearable products and services. I analyzed the traction of smart watches and hearables, and identified the major players, trends, and projections for the global wearables market. In addition, I interviewed industry professionals in wearables consulting, product design, physical computing, and the fashion industry. \r\n","technical_details":"‘Timepiece’ is a stylish staple that is both casual and professional to transition from day to night. Made in New York and crafted from fine leather, it is designed to get better with wear. Fully lined with a starry silk brocade, it features a slim-fit but is detailed with zippers in the lower back to adjust for comfort. For a woman on the go, it features a built-in watch that can be activated by simply tilting the wrist. The display camouflages into the sleeve when it’s not activated, so the technology and interaction is quiet, elegant, and delightful.\r\n<br><br>\r\nThe first proof of concept is programmed with off the shelf components and Arduino IDE. For a future iteration I want to customize a small, thin, flexible, PCB comprised of on-board Wifi module to access RTC, accelerometer to read accurate tilt function, capacitive touch display to customize alarms, haptics to generate feedback, and a wireless charging system. It will be energy efficient and access Wifi periodically to update the time, and remain in low power/sleep mode unless tilt, tap, and alarm(s) are activated. \r\n<br><br>\r\nGerber Technology, the leading provider of integrated hardware and software solutions for the global apparel industry, sponsored a trial license of their patternmaking software Gerber Accumark PDS-GMS for my thesis research. ","further_reading":"","tags":[{"name":"Design","slug":"design"},{"name":"IOT","slug":"iot"},{"name":"Product Design","slug":"product-design"},{"name":"UX","slug":"ux"},{"name":"Wearables","slug":"wearables"}],"video_presentation_url":"https://vimeo.com/336822126","video_documentation_url":"","project_url":"https://sandyhsieh.com/timepiece","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Sandy-768x512-1.jpg","title":"Sandy-768x512","alt":"sandy headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/MPM.jpg","title":"Modular Patternmaking","alt":"Modular Patternmaking","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/framework-1-1024x715.png","title":"framework","alt":"modular patternmaking product design framework","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Interviews-1024x767.jpg","title":"Interviews","alt":"design research interviews","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Working-1-1024x613.jpg","title":"Working","alt":"Woman patternmaking using CAD software","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/hardware-1-1024x683.jpg","title":"hardware","alt":"Digital clock hardware prototype","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/timepc-1024x766.png","title":"timepiece","alt":"Motorcycle jacket with embedded time and gesture on left sleeve","caption":""}]}