{"student_id":"144","student_name":"Yuhao Ko","student_slug":"yuhao-ko","advisor_name":"Stefani Bardin","title":"LifeShare","thesis_statement":"I am making an interactive environment that allows young people in Taiwan to share stories about their depression or anxiety in order to combat stigmas about mental health.","abstract":"LifeShare is an interactive application that creates a safe Augmented Reality environment where people experiencing depression or anxiety can both get help and also help others in Taiwan. For people who are depressed and anxious, this is a place that people can share their experience anonymously. By telling stories, and listening to other people's stories, individuals can develop a support system. This can alleviate the feeling of loneliness. After all, sometimes talking changes everything.\r\n","context_research":"World Health Organization(WHO) shows that Depression is a common illness worldwide, one of the top three contributor to death, with more than 300 million people being affected. However, TAIPEI (Taiwan News) - A recent study indicates only 20 percent of Taiwanese people with depression seek help, while one third of those seeking help give up treatment after their first doctor's visit. The reasons can be attributed to mental illness denial, shying away from treatment for depression, or don't know where to start when seeking help. To be more detailed, in Taiwanese culture, without proper education, depression is considered “unspeakable” or “weak”, or something to “be ashamed of.” As a result, depression has been stigmatized in Taiwan. Hence, as a creative technologist, I want to create an environment as catharsis to help young generation of people in Taiwan be willing to share their experience and destigmatize depression with recent technology.","technical_details":"LifeShare is made using Unity Engine with ARkit, an augmented reality packages that creates an augmented reality world  that allows for plane detection and the creation of portals. In addition, I programmed custom interactions in C# in this app. These include, touching to record a story, replying to messages, and listening to other people’s stories. Moreover, I use Unity built-in network API that allows multiple devices to interact with AR scenes in LifeShare.\r\n","further_reading":"<p>BACKGROUND</p>\n<p>As World Health Organization(WHO) shows that Depression is a common illness worldwide, one of the top three contributors to death, with more than 300 million people affected. According to the UN World Health Organization(http://www.who.int/gho/mental_health/en/), there are at least about 50 million people with depression in Asia and their numbers are on the rise. By 2020, depression and heart disease will have become the top two diseases that affect human lives worldwide.<br />\nHowever, a  recent study reported on by TAIPEI (Taiwanese News Agency) that only 20 percent of Taiwanese people with depression seek help, while one third of those seeking help give up treatment after their first doctor's visit.</p>\n<p>Why is that? According to a local epidemiology study on the occurrence of depression, only 20 percent of the people with depression would immediately seek help, and that can be attributed to mental illness denial, shying away from treatment for depression, or not knowing where to start when seeking help.</p>\n<p>In Taiwanese culture, without proper education, people will revert to the traditional perspectives they were exposed to growing up. Our education teaches us that “Confucius, a Chinese teacher, editor, politician, and philosopher, believes that one is responsible for cultivating his or her own mind. If you’re depressed, it’s because you didn’t do something right; you couldn’t control your own emotions.” As a result, depression has been stigmatized in Taiwan. This stigma remains stronger among the older generation because they grew up in less favorable circumstances. Therefore, depression is considered “unspeakable” or “weak”, or something to “be ashamed of.” More ludicrously, it is 2019, and WARM (Women Anonymous Reconnecting Mentally) is the first and only mental health support group in the entirety Taiwan. This group is trying to combat the stigma by encouraging people to share experience or stories about their depression.</p>\n<p>“Minor depression becomes major depression because we don’t talk about it; major depression becomes suicide because we don’t talk about it.“ Morley J Weston says.<br />\nAs a creative technologist, I want to create an environment as catharsis to help a young generation of people in Taiwan share their experiences and destigmatize depression with recent technology. I choose a target audience of young people between the ages of 20 and 20  because, while depression can strike at any time, it often first appears during people’s late teens to mid-twenties. People are experiencing depression at a younger age without proper outlet to share. This impulse of my ideation comes from stories about my friends. Some of them are taking medicine as a treatment for depression, but they never be willing to discuss  it. Thus, I want to make them realize they are supported and they are not alone.</p>\n<p>Augmented Reality gives a greater feeling of presence (the sensation of being there) and reality judgment (judging an experience as real) than Virtual Reality because the environment and the elements the people uses to interact with the application are real. Users can access to this environment whenever they are depressed. Challenges to sharing stories in a real life setting are different from different people: some might be very busy with work and others might not be willing to go out while they are depressed. Therefore, creating an App for them to share stories anonymously is the first step of my goal to destigmatize depression.</p>\n","tags":[{"name":"3D","slug":"3d"},{"name":"Art","slug":"art"},{"name":"Culture","slug":"culture"},{"name":"Mobile","slug":"mobile"},{"name":"VR/AR/Immersive","slug":"vr-ar-immersive"}],"video_presentation_url":"https://vimeo.com/336822151","video_documentation_url":"https://vimeo.com/335345212","project_url":"https://www.yuhaokosteven.com/lifeshare","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/selfPhoto-768x432-1.png","title":"selfPhoto-768x432","alt":"yuhao headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Thumbnail_img-1024x576.png","title":"Thumbnail_img","alt":"LifeShare","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Slide_img1-1-1024x683.png","title":"Slide_img1","alt":"render_pic","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Slide_img3-1024x683.png","title":"Slide_img3","alt":"storyboard","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-05-10-at-2.23.53-AM-1024x683.png","title":"Screen Shot 2019-05-10 at 2.23.53 AM","alt":"usr_interface","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-05-10-at-2.24.11-AM-1024x683.png","title":"Screen Shot 2019-05-10 at 2.24.11 AM","alt":"ar_scene","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-05-10-at-2.24.44-AM-1024x683.png","title":"Screen Shot 2019-05-10 at 2.24.44 AM","alt":"arkit","caption":""}]}