{"student_id":"145","student_name":"Yeonhee Lee","student_slug":"yeonhee-lee","advisor_name":"Kathleen Stevens Wilson","title":"Design System Starter Tool with AI","thesis_statement":"The Design System Starter Tool with AI helps you sort out how to create a more robust and consistent design system for your digital product. It shares expert perspectives based on the most popular design system methodology and even frees you from tedious jobs such as collecting your existing design patterns using machine learning technology.","abstract":"A design system is a series of design components that can be reused in different combinations for various purposes. More and More digital product companies realize the importance of having a reliable and consistent design system to have a clear brand identity, make their production process more efficient and streamline their communications between their people and teams. However, creating a design system is indeed an overwhelming task especially if you already have a messy set of UI components in your product.\r\nI also had that struggling experience when I worked on a design system building project in my last job. Although there were plenty of great books and web resources about creating a design system, they were all spread out in different places and it took a long time to find and digest them. Another significant pain point during the project was collecting all design assets and UI patterns from the existing products to find out the design issues they have. <br><br>\r\nFrom this experience, I considered creating a tool that can be a starting point for design system beginners by providing the basic steps to follow and the structure of design system based on the most popular methodology, Atomic Design. Also, inspired by the fact that image classification and object detection is one of the most favorable jobs for AI, I integrated it into my idea in order to accelerate the design system building process by having the machine do the tedious work for users.","context_research":"I found several great books that explain how to create a design system. They were all written by experts in the field who have actually participated in building design systems. The list of the books is as follows:<br><br>\r\n1. Creating a Design System by UXPin<br>\r\n2. Design Systems Handbook by Marco Suarez et al<br>\r\n3. Atomic Design by Brad Frost<br><br>\r\n\r\nAfter reading these books, I decided to make my tool based on Atomic Design methodology since I learned that a lot of corporate design systems are based on it and the two other books I looked at suggested design system guides developed from Atomic Design as well. <br><br>\r\n\r\nBesides these books, I read various articles written by professionals to gather advice and tips in terms of designing visual languages and UI patterns in a design system.<br><br>\r\n\r\nI also found some products that have a similar concept to mine. CSS Stat and Stylify Me analyze your websites and show you the style properties used there. Nevertheless, I can say my idea is still different from them as they only do this by parsing CSS codes and therefore, cannot provide you the list of UI patterns.<br><br>\r\n\r\nLastly, for the AI part, I have looked for some possible solutions in the existing machine learning techniques and found that YOLO: You Only Look Once is the most suitable approach for my purpose. It detects certain objects on a given image and creates bounding boxes around the results.","technical_details":"The existing pre-trained model for YOLO only worked for natural objects, therefore, I needed to train my own model with UI patterns on digital product screenshot images. Given the short time frame of the thesis semester, I decided to focus on just buttons as my target training object. I first collected 400 images of buttons in different digital product designs, then manually labeled all the bounding boxes for the buttons in those images, and trained them with YOLO ver. 2 until the data loss was less than 1, which took 50,000 epochs. ","further_reading":"","tags":[{"name":"Design","slug":"design"},{"name":"Machine Learning","slug":"machine-learning"},{"name":"UX","slug":"ux"}],"video_presentation_url":"https://vimeo.com/336836844","video_documentation_url":"https://vimeo.com/335426543","project_url":"http://www.yeonheelee.com/category/04/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/profile-768x432-1.jpg","title":"profile-768x432","alt":"yeonhee headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thumbnail-4-1024x683.jpg","title":"thumbnail","alt":"Thumbnail image for the Design System Starter Tool with AI","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/main_01-1024x576.jpg","title":"main_01","alt":"Slide show image 1 for the Design System Starter Tool with AI","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/main_02-1024x576.jpg","title":"main_02","alt":"Slide show image 2 for the Design System Starter Tool with AI","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/main_03-1024x576.jpg","title":"main_03","alt":"Slide show image 3 for the Design System Starter Tool with AI","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/main_04-1-1024x576.jpg","title":"main_04","alt":"Slide show image 4 for the Design System Starter Tool with AI","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/main_05-1024x576.jpg","title":"main_05","alt":"Slide show image 5 for the Design System Starter Tool with AI","caption":""}]}