{"student_id":"146","student_name":"Youjin Chung","student_slug":"youjin-chung","advisor_name":"Gregory Shakar","title":"The Tree of Babel","thesis_statement":"This project is a machine learning research project to find a way to analyze graph representations of interactive narrative structure and generate new narrative structure graphs using ML models.","abstract":"his project is a research journey that finding a way to understand, analyze, and generate graph representation of the interactive narrative structure. There is a field of machine learning implements on graphs, but mostly for networks like friendship from Facebook or epidemic studies not with the narrative flow.<br><br>\r\nInteractive media such as video game, interactive film, and ergodic literature have a non-linear narrative structure, which is the critical feature to makes them original genre. The structure of those genres has interesting patterns:  branching, clustering, redirection. The goal of this project is research on how to analyze the pre-existing interactive works using graph theory, and generate new patterns for new pieces.  The project scraped the database of manually analyzed graphs from Choose Your Own Adventure gamebooks. By formatting the narrative graphs to featured matrixes, K-means/Spectral/Agglomerative/Mean Shift clustering can categorize them to distinct patterns. After they cluster database, it is possible to generate similar matrixes of categorized patterns using autoencoder and visualize them for a web app deployment. This project also used text samples to fill nodes narratives of the graphs. By extracting entities of the text and information extraction of Natural Language Processing, the project fills word in the narrative structure. The next step of this project will be how to extract world status out of the full text and vectorize their relationship.","context_research":"Allison Parrish: Data for narrative structure and graph library, vector embedding for python.<br>\r\nGene Kogan: machine learning scheme of graph data for clustering and generation.<br>\r\nSam Kabo Ashwell: the theoretical approach to analyzing the narrative structure of interactive video games. Standard Patterns in Choice-Based Games.<br>\r\nMark O. Riedl: Beyond Adversarial: The Case for Game AI as Storytelling), Interactive Narrative: An Intelligent Systems Approach, PersonalizedInteractive Narratives via SequentialRecommendation of Plot Points.<br>\r\nGensim: Natual Language Processing library for Python. This is used for text summarization and word embedding using fastText.<br>\r\nNetworkX: Python package for the creation, manipulation, and study of the structure, dynamics, and functions of complex networks. I used them for general graph/network theory and implementation examples. This is the major part of the visualization.<br>\r\nScikit-learn: used for K-means clustering and referred for the implementation of other databases, such as images and text data for clustering.<br>\r\nGraph2Vec: Extraction of a featured matrix from the whole graph dataset.<br>\r\nPytorch geometric: Graph generation using autoencoder.\r\nTwine: Writing/Graph tool for nonlinear, interactive storytelling. I learned the basic structure of how writers plan interactive nonlinear narrative and examples. It inspired me to make a visualization of the data and interactivity for users.<br>\r\nTransverse Reading Gallery: The database of this project. They have manually analyzed graphs of old CYOA books, contains symbolized structure, graph, text files of log and contents, .gv .tgf formatted graph files.","technical_details":"I referred the data which are manually analyzed graphs from gamebooks. By formatting the graph data, I could extract a feature matrix of whole graphs and clustered them with algorithms of Scikit-learn library. After clustering with K-mean, Spectral, Agglomerative and Mean shift clustering, this approach could not yield significant results due to the limit of graph2vec, the model to extract a featured matrix. I set criteria to classify graphs; basic, broad, linear, merged, clustered and cyclic. After classification, I could generate similar new graphs to classified graphs using autoencoder. Those newly generated graphs are visualized on a web app.","further_reading":"","tags":[{"name":"Data","slug":"data"},{"name":"Experiment","slug":"experiment"},{"name":"Machine Learning","slug":"machine-learning"},{"name":"Networks","slug":"networks"},{"name":"Science","slug":"science"}],"video_presentation_url":"https://vimeo.com/336827253","video_documentation_url":"","project_url":"https://treebabel.herokuapp.com/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/youjin-768x432-1.jpg","title":"youjin-768x432","alt":"youjin headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/projectdiagram-1024x576.jpg","title":"Project diagram","alt":"Project diagram","caption":"the approaches of research as branching diagram"},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide1-1-1024x576.jpg","title":"raw data to featured matrix","alt":"first step","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide2-3-1024x576.jpg","title":"clustering","alt":"clustering","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide3-4-1024x576.jpg","title":"graph generation and visualization","alt":"graph generation and visualization","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/demo-1024x576.jpg","title":"demo","alt":"project demo image","caption":""}]}