{"student_id":"147","student_name":"Yifan Liu","student_slug":"yifan-liu","advisor_name":"Gregory Shakar","title":"The Ghost","thesis_statement":"\"The Ghost\" is an interactive video installation using holograms to create a space where the boundaries between the digital and physical worlds meet, overlap and bleed together.","abstract":"This project is an interactive video installation based on the idea of bridging over from traditional video arts to the reality and blurring the boundaries between the virtual world and the real world. It is inspired by the phenomenon of social media users frequently liking posts of daily objects that they see through filters, which are illusions that trap them easily. Out of the interest in exploring and playing with the narratives, I aim to give the users / audience some extent of control over how the information spreads on the internet by letting them hit a big “like” button and interact with the projected videos.","context_research":"There are many projection mapping artists who have worked on site-specific projects or projection mapping on specific objects. Some of those projects are interactive, which makes them even more real and engaging. I did research mainly on those interactive video pieces in order to see what people have done in the field of projection mapping so far, what they have done successfully and what they have not, how people respond to them and what is possible to be brought further. I see ideas in those projects which can be reiterated and developed with totally different approach.\r\nPart of the concept also derived from the technique I use called “pepper’s ghost”, which is a technique used to create illusions in reality that can be seen with people’s own eyes. Because the illusions that people see on social media are always affecting them while they are not always aware, they are often “haunted” by those illusions. The interconnection between the concept and the technique has proved the necessity of leveraging such technique to achieve the desired effects.","technical_details":"This project involves the use of pepper’s ghost projection techniques, interactive video display, physical computing and digital fabrication. Production of the visual contents involves 3D modeling and rendering, video editing and graphic design that simulates social media.","further_reading":"","tags":[{"name":"3D","slug":"3d"},{"name":"Art","slug":"art"},{"name":"Hologram","slug":"hologram"},{"name":"Installation","slug":"installation"}],"video_presentation_url":"https://vimeo.com/336827331","video_documentation_url":"https://vimeo.com/335291167","project_url":"https://yifan-liu.com/#/the-ghost/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Headshot-1-768x512-1.jpg","title":"Headshot-1-768x512","alt":"yifan headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/cans2-1024x576.jpg","title":"can 2","alt":"can 2","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Image1-2-1024x576.jpg","title":"Image1","alt":"Image1","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Image2-1024x576.jpg","title":"Image2","alt":"Image2","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/cans3-1024x576.jpg","title":"_cans3","alt":"_cans3","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/cans4-1024x576.jpg","title":"_cans4","alt":"_cans4","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/cans5-1024x576.jpg","title":"_cans5","alt":"cans5","caption":""}]}