{"student_id":"148","student_name":"Yiyao Nie","student_slug":"yiyao-nie","advisor_name":"Nancy Hechinger","title":"Life In A Nutshell","thesis_statement":"Chinese characters (language system) evolved in sync with Chinese people’s character and culture. This piece has two parts, one is a series of sculptures, and one is an interactive installation. The 13 sculptures portray human beings in 12 stages of life as a cycle. The installation invites viewers to become part of the language to experience 12 stages of life and understand the root of the written characters and Chinese philosophy about life.","abstract":"The most ancient characters/pictographs (more than 3600 years old), the Shang oracles, were carved onto tortoise shells and other animal bones. I chose 12 very elemental oracle bones all of which were derived from the basic character for “human”. I aimed to show the symbiotic relationship of language, human beings, and nature in the evolution of Chinese written language and Chinese culture. These 12 characters tell a story, poetically, of the cycle of life. In each one, there is the character for  ‘human’. A viewer will be asked to become part of all the characters. They will strive to mimic the character with their body and hold the posture. After keeping the posture for a few seconds, the story of that character will be revealed on the screen and they will become part of the character. Viewers can truly engage in the story to experience the stage of life the character conveys by interacting with the environment and the other virtual character in the story as an important character for viewers in their life, for example, families, lovers, friends and etc..\r\n<br><br>\r\nIn this project, I hope to convey to non-Chinese and also Chinese speakers something of the richness of Chinese 5000 years of culture and written language. I think different culture actually brings people together. I start up something very specific to my own culture, but it ends up something for human as a big community.\r\n<br><br>\r\nI’m fascinated by Chinese characters. As a graphic designer and programmer, I am also developing a toolkit for people who speak and write Chinese to facilitate working with new font and motion with characters. ","context_research":"Chinese characters have evolved over the long history of China. In this system, Chinese characters are formed as a pictogram and exhibit great potential for the graphical redesign. \r\n<br><br>\r\nThey are not only purely functional–for written communication– but they are also regarded as an art form and as a representation of Chinese culture. It’s very interesting to see that in each dynasty, artists used different tools and shapes to create Chinese characters, from the very first oracle bones carved on tortoise shells and animal bones to calligraphy written on paper and now to fonts typed generated in computer. They portray our life, our character, our origins, philosophical underpinnings, and history.\r\n<br><br>\r\nHowever, the function of Chinese characters have changed in the river of Chinese history; the origins of many characters have been forgotten.<br><br>\r\n \r\nThe Shang oracle bones are version 1.0 of Chinese characters. It portrays how the most ancient Chinese people see our world, our nature, our life and ourselves and transform them into drawings and then into the first written language of Chinese characters.\r\n<br><br>\r\nBy learning the Shang oracle bones, I hope, and I hope viewers, will understand the ancient people’s perspectives about major topics on nature, world, and human: where do we come from, where are we going, and how to live a life.<br><br>\r\n\r\nI researched the meaning of many pictograms(oracle bones) and finally chose 12 of them which were derived from the basic character for “human”  and represented the cycle of life.\r\n<br><br>\r\nHere are some similar projects:<br>\r\nhttps://tinganho.info/Type-Waterfall<br>\r\nhttps://tinganho.info/Motion-Type-Project<br>\r\nhttps://vimeo.com/89622753<br>\r\nhttp://t-h-e-s-p-a-c-e.com/typeface/<br>\r\nhttp://www.xubing.com/cn/work/details/206?year=1991&amp;type=year\r\n<br><br>\r\nFrom these projects, I conclude that Chinese characters really have great graphics potential to deliver meaning, evoke emotion and create aesthetics.\r\n","technical_details":"I firstly designed 13 characters containing human figures based on the 13 original images of pictograms. <br><br>\r\n\r\nThen I made 13 sculptures depicting human life in the nutshell starting from modeling, to 3d printing to fabrication.<br><br>\r\n\r\nThen I used machine learning to train 12 different human poses that resemble the human figures so that the installation can detect the human figure and the corresponding character which users are mimicking. And then I used motion capture to make story and animation.<br><br>\r\nFinally, I made an interactive installation using Kinect and Unity to invite viewers to be part of the character, watch the story, and experience the aspect of life embodied by the character. All the graphics in the installation are real-time rendered by using Unity shader, VFX, HDRP, and Scriptable Rendering Pipeline to achieve high-quality performance.","further_reading":"","tags":[{"name":"3D","slug":"3d"},{"name":"Animation","slug":"animation"},{"name":"Art","slug":"art"},{"name":"Culture","slug":"culture"},{"name":"Design","slug":"design"},{"name":"Experiment","slug":"experiment"},{"name":"History","slug":"history"},{"name":"Identity","slug":"identity"},{"name":"Installation","slug":"installation"},{"name":"Machine Learning","slug":"machine-learning"},{"name":"Narrative/Storytelling","slug":"narrative-storytelling"},{"name":"Projection Mapping","slug":"projection-mapping"},{"name":"Sculpture","slug":"sculpture"}],"video_presentation_url":"https://vimeo.com/337314577","video_documentation_url":"","project_url":"https://www.yiyaonie.space/lifeinanutshell","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/WechatIMG512-768x432-1.jpg","title":"WechatIMG512-768x432","alt":"yiyao headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/sky-1024x575.png","title":"sky","alt":"2","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-05-10-at-3.25.52-AM-1-1024x577.png","title":"Screen Shot 2019-05-10 at 3.25.52 AM 1","alt":"213","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-05-10-at-3.05.21-AM-1024x575.png","title":"Screen Shot 2019-05-10 at 3.05.21 AM","alt":"3","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-05-10-at-4.49.56-AM-1024x578.png","title":"Screen Shot 2019-05-10 at 4.49.56 AM","alt":"4","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-05-10-at-3.13.16-AM-1024x584.png","title":"Screen Shot 2019-05-10 at 3.13.16 AM","alt":"5","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-05-10-at-3.26.34-AM-1024x582.png","title":"Screen Shot 2019-05-10 at 3.26.34 AM","alt":"6","caption":""}]}