{"student_id":"15","student_name":"Aidan Nelson","student_slug":"aidan-nelson","advisor_name":"Gregory Shakar","title":"Refracting Rays","thesis_statement":"This installation uses custom lenses and digital rendering software to allow audience members to engage with optics and the phenomenon of refraction.","abstract":"How light interacts with surfaces, lenses and our eyes is fundamental to how visual arts are created and perceived.  Despite this importance, education around basic optical principles tends to employ a science-first approach which may not resonate within an artistic community.  This installation attempts to bridge that gap by encouraging audience members to holistically engage with optics and the phenomenon of refraction.\r\n<br><br>\r\nThis installation consists of a series of engagements with playful and impractical lenses.  A custom software tool distorts images such that they can only be seen through these lenses (a process known as anamorphosis). In the first such engagement, audience members are invited to draw on a digital canvas while looking through one such lens.  They are then able to view the results of their work with and without the lens.  In the second engagement, audience members encounter a large, amorphous video projection.  They later realize that the imagery can be decoded through a viewer mounted within the space.   These experiments aim to inspire audience members’ curiosity about the behavior of light.\r\n <br><br>\r\nAs an artist’s understanding of foundational optical principles grows, their palette is expanded to allow aesthetic exploration and play using these elements.  This installation aims to reduce technical barriers to entry and inspire artists to incorporate creative custom optics into their practice. \r\n","context_research":"This project drew inspiration from a number of different sources in art, museum exhibit design and computer graphics fields.  Deliberate perspective distortion (anamorphosis) was pioneered during the Renaissance and described in detail by Jean François Niceron in 1638.  My software was based in the computational approach described by Francesco De Comité in his paper, ‘A General Procedure for the Construction of Mirror Anamorphoses’ (2010).  Design of the physical installation was inspired in large part by existing museum exhibit designs, most notably at The Exploratorium (The Museum of Science, Art &amp; Human Perception) in San Francisco as well as The Museum of the Moving Image in New York.  Finally, this goals of this project were clarified through my conversations with a number of artists working with custom optics, including Robb Godshaw and Florian Born.\r\n","technical_details":"Custom lenses for the project were designed in the Rhinoceros 3D CAD software package.  These designs were exported for physical fabrication in acrylic on a Roland MDX-540A CNC mill.  Custom rendering software was built in Unity3D.\r\n","further_reading":"","tags":[{"name":"Art","slug":"art"},{"name":"Design","slug":"design"},{"name":"Education","slug":"education"},{"name":"Installation","slug":"installation"},{"name":"Science","slug":"science"},{"name":"Visual","slug":"visual"}],"video_presentation_url":"https://vimeo.com/336825454","video_documentation_url":"https://vimeo.com/331497697","project_url":"https://www.aidanjnelson.com/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/profile-2-169x300-1.jpg","title":"profile-2-169x300","alt":"aidan headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thumb-1024x576.jpg","title":"Lenses","alt":"Lenses","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/alan-1024x576.jpg","title":"User Testing","alt":"User Testing","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/2019-04-19-15-59-36.2019-04-19-16_02_13-1024x576.gif","title":"3d","alt":"3d","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/lens-2-1024x576.jpg","title":"Lenses","alt":"Lenses","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/lens-1-1024x576.jpg","title":"Caustics","alt":"Caustics","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/1E2A0001.2019-04-19-16_10_22-1024x576.gif","title":"gif","alt":"gif","caption":""}]}