{"student_id":"151","student_name":"Yang Yang","student_slug":"yang-yang","advisor_name":"Gabriel Barcia-Colombo","title":"Magical Pencil","thesis_statement":"Magical Pencil is a video game telling a story about a journey of a deserter who has a magical pencil by which whatever is drawn becomes real. In the game, players can create whatever they want by hand drawing to help the character to return to his home. The game can recognize what the player is drawing, and spawn a corresponding item in the game world, with an appearance of the player's doodle, to interact with the player.\r\n","abstract":"We all remember how cool it is when we saw Neo in Matrix saying “Guns, lots of guns.” So what if we get whatever we need in a video game just as simple as that? Then the purpose of the game switches from managing to obtain the game item to figure out what item is one of the solutions.\r\n<br><br>\r\nMoreover, hand drawing recognized by the game is a huge “Wow” moment, which is powered by the magic of Machine Learning. Riding on a motorcycle that was drawing by the player is another level of mind-blowing.\r\n","context_research":"Most interactions in video games are done by pressing some buttons or by clicking some virtual buttons, while quite a few of them by gestures or other sensors. My research focuses on new game inputs since traditional game inputs are hard to satisfy what an ITP-ish game needs. \r\n<br><br>\r\nLine Rider is the first one that caught my attention, in which players can draw a slope freehandedly and the game character sleds down the slop. Next, Scribblenauts is a vocabulary based video game allowing the player to create any in-game objects they want by typing in the names of the items, hence solving game puzzles in creative ways. \r\n<br><br>\r\nThe idea of drawing in games is intriguing because of its simplicity and expressiveness. Creating whatever players want is exciting. What if I combine them, allow the player to create whatever they need by doodling, then also give the game object an appearance identical to their sketch?\r\n<br><br>\r\nFurthermore, I did more in-depth research on drawing related games, found out that at this time point, none of them is allowing players to create game objects by drawing freely. \r\n<br><br>\r\nWhen Google introduced the Quick Draw project, I was fascinated. Now, this technology will play a crucial role in my game, so the next step is researching to figure out if Doodle Classification can be integrated into my project. Luckily, Google open sourced its Quick Draw dataset, so it is possible to train an ML model. Benefited from the Kaggle community, I did it.\r\n","technical_details":"The game client is powered by the Unity Engine and the doodle recognition by Tensorflow and Google Quick Draw Dataset. \r\nAnimations are hand drawn frame by frame.","further_reading":"<p>The storytelling part of this game is oriented by the game mechanism and my personality. The protagonist is a soldier but has no nation; thus I molded him a cat, to implying the detachment of our real world. Besides, he decided to be a deserter because I hate wars and the best thing I can imagine is staying with families peacefully, just like everyone on this earth.</p>\n<p>On his journey, trails and challenges are lurking and ready to rive him in pieces. There’re mountains blocking his way, deserts roasting him, dark woods trying to trap him and home guards wanting him dead. Blessed by his faith and the magical pencil, he managed to go forward. The game includes five scenes, yet the story has not ended, but we all know he will eventually see his family again.</p>\n<p>Parallel to the storyline, there is a level called “Another World.” How to enter it is by drawing a door, then stepping into it. This level is an empty white room, in which players can purely enjoy interacting with their own creations, and exploring various effect brought by combination of different game objects..</p>\n","tags":[{"name":"Art","slug":"art"},{"name":"Machine Learning","slug":"machine-learning"},{"name":"Narrative/Storytelling","slug":"narrative-storytelling"},{"name":"Play/Games","slug":"play-games"},{"name":"Product Design","slug":"product-design"}],"video_presentation_url":"https://vimeo.com/337309331","video_documentation_url":"https://vimeo.com/331466595","project_url":"http://yangyang.blog/2019/04/magical-pencil/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/yang.jpg","title":"yang","alt":"yang headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Thumbnail-1024x576.png","title":"Thumbnail","alt":"Thumbnail-Game Scene 1","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Slides-1-1024x768.jpg","title":"Slides-1","alt":"Screenshot - game scene - 1","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Slides-2-1024x768.jpg","title":"Slides-2","alt":"screenshot - game scene 1 - drawing on sketchbook","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Slides-3-1024x768.jpg","title":"Slides-3","alt":"screenshot - game scene 1 - riding motorbike","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Slides-4-1024x768.jpg","title":"Slides-4","alt":"screenshot - game scene 3 - in desert","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Slides-5-1024x768.jpg","title":"Slides-5","alt":"screenshot - game scene 4 - another world","caption":""}]}