{"student_id":"153","student_name":"Zahra Khosravi","student_slug":"zahra-khosravi","advisor_name":"Adaora Udoji","title":"Neural Painting","thesis_statement":"I focused on using machine learning techniques in creating art. To be more specific, I used style transfer technique to apply the style of my art to other images. I created an interactive webpage to access the model that I trained on my style in the browser. I was inspired by creative projects that used machine learning as a medium and emphasized a sense of human touch. ","abstract":"I used style transfer to apply the style of my art to other images. This was a two step process. First, I trained a model based on my drawing and then I used my style to recompose images in the style of my artwork. <br><br>\r\nThe style image that is used for the training process has to have certain characteristics. It needs to have very clear and repetitive patterns. The model is trained during a complex process that includes using a GPU on HPC services. I made the model accessible in the browser using Ml5.js library. I use the trained model on different input images. The model applies my style to the input images and outputs (generates) art. I repeated the whole process a number of times while I was changing different parameters in the code or training data set to improve the results. The decisions that I make for creating and picking the style image and input image are based on my personal experience as an illustrator. So far, I worked with famous artworks.The list of current input images is available on the website. I am interested in applying this model to works by my favorite artists. My target audience is an artist who is interested in using machine learning techniques to create art and wants to experiment with patterns and styles.","context_research":"I became familiar with applications of machine learning for creativity and art in Neural Aesthetic (ITP Fall 2018), Nature of Code (ITP Spring 2018) and Artificial Autonomous Artist (ITP Spring 2019) courses. In machine learning techniques we use the past trends from data samples to predict the future. A simple example of using these techniques is when in Analytical Chemistry, we use known parameters of a number of samples to draw a line and use that line to predicts the values of other samples. <br><br>\r\nI was exposed to creative projects that used machine learning techniques and data sets to create art. I was inspired by \"The Fall of House of Asher\", a project by Anna Ridler. She recreated a movie based on her style of paintings as if she painted it. I was fascinated by the idea of seeing myself paint my favorite movies, animations, and illustrations. I think creating images (animations, videos, illustrations, etc ) using a neural network that is trained on drawings and paintings adds a sense of human touch to the process. <br><br>\r\nDuring the process, I started by selecting patterns that were suitable to be used as the style image in the training process among my works. Style image has to have certain characteristics. For example, it needs to have very clear and repetitive patterns. I found instructions on how to train my model on Ml5.js website and run the process locally on my device before transferring the project to a HPC service. I conducted research on how to make the project work on NYU HPC service. I trained several iterations to find the right settings for the project. <br><br>\r\nI also worked on using Text-to-Speech APIs that are developed using machine learning techniques. <br><br>\r\nAs a side project, I researched different Cloud Text-to-Speech API and how to use it to create a text-to-speech feature. I created a prototype for a text to speech feature that takes text article input from a few news  and lifestyle websites and outputs an mp3 files for each article. This feature is for users who are visually impaired or prefer to listen to articles and text presented on a website. ","technical_details":"I trained a custom Fast Style Transfer model in TensorFlow and used the output model in Ml5.js with the ml5.styleTransfer() method. I started and followed through the training process multiple times on my personal device before I was able to move the training to NYU HPC clusters. When the first trained model was created, I used Ml5.js library to run the model in the browser. Finally, I used Ml5.js library to create an interactive website to run the trained model in the browser.","further_reading":"<p>The model that I have trained is working in the browser and generates new images. I can see the colors and textures that are present in the style images transferred to the output images. The complex process is working on the HPC clusters and generates models and the quality of the output is improved with every iteration.</p>\n<p>Here is the link to the project website:</p>\n<p><a href=\"https://elliekh.wixsite.com/zahra-thesis\">Project Website</a></p>\n<p><a href=\"https://elliekh.wixsite.com/zahra-thesis\">Documentation</a></p>\n<p><a href=\"https://elliekh.wixsite.com/zahra-thesis\">Images</a></p>\n<p><a href=\"https://elliekh.wixsite.com/zahra-thesis\">Audio Files</a></p>\n","tags":[{"name":"Accessibility","slug":"accessibility"},{"name":"Machine Learning","slug":"machine-learning"}],"video_presentation_url":"https://vimeo.com/336822189","video_documentation_url":"https://vimeo.com/331475890","project_url":"https://vimeo.com/331478857","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/default.png","title":"default","alt":"default","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Untitled-3.001-1024x576.jpeg","title":"Girl with a pearl earring recreated using a machine learning model","alt":"Girl with a pearl earring recreated using a machine learning model","caption":"Girl with a pearl earring recreated using a machine learning model"},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/girl.002-1024x576.jpeg","title":"Girl with pearl earring recreated using a machine learning model","alt":"Girl with pearl earring recreated using a machine learning model","caption":"Output Image of Machine Learning Style Transfer Model I trained on hand-printed textile"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Untitled.001-1-1024x576.jpeg","title":"The Starry Night in Hand-Printed Textile Style","alt":"The Starry Night in Hand-Printed Textile Style","caption":"The Starry Night recreated using Machine Learning model trained on Persian Textile"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/images.004-1024x576.jpeg","title":"Sunflowers recreated using a machine learning model","alt":"Sunflowers recreated using a machine learning model","caption":"Sunflowers recreated using a machine learning model"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/images.005-1024x576.jpeg","title":"The Starry Night recreated using a machine learning model","alt":"The Starry Night recreated using a machine learning model","caption":"The Starry Night recreated using a machine learning model"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/images.003-1024x576.jpeg","title":"Mona Lisa recreated using a machine learning model","alt":"Mona Lisa recreated using a machine learning model","caption":"Mona Lisa recreated using a machine learning model"}]}