{"student_id":"154","student_name":"Zohreh Zadbood","student_slug":"zohreh-zadbood","advisor_name":"Kathleen M Sullivan","title":"Who is RIGHT?","thesis_statement":"I have designed an experiment that aims at helping individuals to better think about other people's feeling and thoughts using interactive 360 videos. In fact, I want to help audience thinks about answering the question \"Who is right?\" during her exploration of my project. The user will acquire different perceptions about one specific situation which I designed in my story and  she can find out how hard it is to put herself/himself  in someone else’s shoes? and answering the main question. \r\n","abstract":"The project is an interactive 360/VR art piece. My objective in this project is to design an experiment that aims at helping individuals to think more about other people’s feeling and thoughts. Not only does it help people experience other people’s thoughts, but also also it gets them to think about the reasons which make people's perceptions different. The thesis takes a multidisciplinary approach to contribute to the research on human mind by combining concepts from psychology, communication, and interactive storytelling. From psychology, the top-down and bottom-up approaches are being used for getting the project message across. These two strategies of information processing and knowledge ordering, widely used in various scientific and humanistic research, are utilized in this project. My main question is ”Who is right?”. The user will acquire different perceptions about one specific situation which I designed in my story, which is about people’s romantic relationships. I shot some videos based on my story and the user will put on the headset and will see two scene in two versions. So she will watch part of four videos due to her interactions. \r\n","context_research":"My researches area was a broad one includes several fields.<br><br>\r\n\r\n1. Read about different theories of mind to find out the closest one to my idea / VR empathy <br>\r\n2. Read about the psychological aspects of understanding people’s thoughts and feelings<br>\r\n3. Search about different kinds of media as a tool for presenting my idea <br>\r\n4. Search about the possible interactions <br>\r\n5. Search about the 360 videos and VR capabilities<br>\r\n6. Search about the technical aspects<br>\r\n7. Find cast, crew and location for shooting<br>\r\n<br>\r\nIn my project I got help from different references. Here you can find a list of my references.<br><br>\r\n\r\n1.Interviews<br><br>\r\n- Have an interview with 10 young men and 5 young women of my friends about the story that I sent to them<br>\r\n- Have several appointment with Dr. Asieh Zadbood as a doctor, psychologist and neuroscientist.\r\n<br><br>\r\n2.Books<br><br>\r\n-The psychology of love(Sigmund Freud)<br>\r\n-The prisoners of our thoughts(Alex Pattakos)<br>\r\n-What everybody is saying(Joe Navarro)<br>\r\n-The house that we grew up in( Lisa Jewell)<br>\r\n-Think and grow rich(Napoleon Hill)\r\n<br><br>\r\n3.Articles<br><br>\r\n-How love and lust change people’s perception of relationship partners<br>\r\n-Seeing love, or seeing lust: How people interpret ambiguous romantic situations\r\n(Journal of Experimental Social Psychology)\r\n<br><br>\r\nThe Influence of Media on Young People’s Attitudes towards their Love and Beliefs on Romantic and Realistic Relationships\r\n(International Journal of Academic Research in Psychology)\r\n<br><br>\r\n4.ITP faculties<br><br>\r\n-Heidi Brant<br>\r\n-Nick Hubbard<br>\r\n-Marianne Petit <br>\r\n-Gabe Barcia-Colombo <br>\r\n-Marina Zurkow<br>\r\n-Matthew Niederhauser<br>\r\n-Francesca Mirabella<br>\r\n<br><br>\r\n5.Graduated ITPers:<br><br>\r\n-Richard Lapham<br>\r\n-Dominic Barret<br>\r\n-Nouf Aljowaysir<br>\r\n-Marco Fguarino<br>\r\n-Christina Hall<br>\r\n<br>\r\n6.Experts in Film department :<br><br>\r\n-Spike Lee<br>\r\n-Alex Raspa<br>\r\n-Fritz Gerald<br>\r\n-Damien Panitz<br>\r\n-Tarek Gamal Eldin<br>","technical_details":"I wrote the first version of the short story then I developed the idea during “Directing Strategies” class by Spike Lee. After that I changed the short story structure into a screenplay. Then I chose some important scenes of the whole story for demonstrating the core idea and editing the dialogues for shooting the scenes using professional actors. I was working on shooting some videos and simultaneously was working on importing the video into Unity and implementing the interactions. Both two main areas were too challenging because they were super time-consuming with a lot of works.","further_reading":"<p>In my thesis the user will put on the headset and go through the story. She will watch two different scenes. And each scene has two version so the user will watch four different videos. Each scene belongs to two different character of my story and the two different versions are based on the each of the character's perspective. In fact, the user will see the first scene which is a conversation of Chris and Mary twice. One time based on the Chris's perspective and one time based on the Mary's perspective. When I talk about perspective I meant that if I ask Chris after the conversation to tell me the detail of the it, he will say all the details which I have them in Chris's perspective video. And the same for Mary, all the details of the Mary's perspective are based on the things that she cares about and she remembered from their conversation. It is same for the second scene. The is a discussion of Dan and Sarah and the user will see them in two version one time from the Dan's perspective and one time from the Sarah's perspective.</p>\n<p>The is a unique interaction in this story that I implement to help user think more the details of perspectives which make them different from each other. As the user put on the headset can also play with two different key of the keyboard to switch between perspectives. For example in scene one which is about Chris and Mary the user is watching the Chris's perspective where they are siting next to each other and talking. Now the user can press button A and fade out the Chris's perspective and press button M to fade in  Mary's perspective in the other direction of the sphere( through 360 sphere environment). In fact she can turn around her head in left and right and switch whenever she wants to see exactly what is the different of the perspectives and think about the reasons which make them different from each other.</p>\n<p>https://wp.nyu.edu/zohreh/category/thesis/</p>\n","tags":[{"name":"Art","slug":"art"},{"name":"Experiment","slug":"experiment"},{"name":"Narrative/Storytelling","slug":"narrative-storytelling"},{"name":"VR/AR/Immersive","slug":"vr-ar-immersive"}],"video_presentation_url":"https://vimeo.com/336827387","video_documentation_url":"https://www.youtube.com/watch?v=4aYiNOXF6go","project_url":"https://itp.nyu.edu/thesis/journal2019/kat/author/zz1971/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/zzprofilephoto-0-768x512-1.jpg","title":"zzprofilephoto-0-768x512","alt":"zohreh headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/poster-copy-1024x779.jpg","title":"poster copy","alt":"project poster","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screenshot_20190421-212718_20190421213309115.jpg","title":"Screenshot_20190421-212718_20190421213309115","alt":"--","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screenshot_20190421-212737_20190421213418714.jpg","title":"Screenshot_20190421-212737_20190421213418714","alt":"--","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screenshot_20190421-212802_20190421213459059.jpg","title":"Screenshot_20190421-212802_20190421213459059","alt":"--","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/PSX_20190421_232735.jpg","title":"PSX_20190421_232735","alt":"--","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/PSX_20190421_232947.jpg","title":"PSX_20190421_232947","alt":"--","caption":""}]}