{"student_id":"16","student_name":"Nicolas Sanin","student_slug":"nicolas-sanin","advisor_name":"Stefani Bardin","title":"Slow numbers","thesis_statement":"How “random” real events are? How random can they be? How can we predict them?<br><br>\r\nSlow numbers is an exploration of “randomness”, focusing on testing the degrees of effectiveness of different “random” generators. The goal is to reveal the nature of these methods by using them to produce “random” data that we will have the chance to analyze, observe and compare. That way, revealing subtleties of this fascinating subject and also raising new questions. \r\n\r\n","abstract":"Slow numbers is an exploration of randomness, focusing on testing the degrees of effectiveness of random generators such as six-sided dice, digital algorithms and “human simulated six-sided die results”. In this process, the idea is to “harvest random results” from each method, so we can hopefully reveal possible biases and patterns on each random generation system. And we can also compare them after, to see how the definition for “randomness” works according to each method.\r\n<br><br>\r\nThe goal of this project is to look at what we call Chance or Randomness, and real it’s subtleties. It is an effort to understand it by means of an interdisciplinary dialogue. And also to highlight the beauty behind it, from a conceptual point of view, and from an Aesthetical point. \r\n<br><br>\r\nThe project is based on an empirical method, with an artistic vocation, inspired by the scientific methods of thinking and creating knowledge by creating practical experiments that can be analyzed after some action has been taken. Very much in the spirit of Intermedia: the collaboration between art and other disciplines. In this case, setting up a dialogue between Art, Mathematics, Probability, Electronics, Computer Science, Design, Philosophy, and Performance.\r\n<br><br>\r\nSlow numbers also pretend to raise more questions than to give true facts. The idea is that after all, we can ask ourselves many questions. Such as:\r\n<br>\r\nHow “random” Dice Are? \r\nHow “random” can they get to be?\r\nHow “random” are different computer algorithms?\r\nHow successfully can humans simulate random outcomes?\r\nWhat do we mean when we say something is “random”?\r\nIs there such a thing as “randomness”? \r\nDo we call random what we can’t fully explain? \r\nIs probability right?\r\nHow can we make “randomness” useful in our lives? \r\n\r\n<br><br>\r\n\"The world is governed by chance. Randomness stalks us every day of our lives. \"   Paul Auster\r\n\r\n","context_research":"For my thesis, my research was based on the ideas of probability and randomness. For this, I consulted different resources like books about mathematics, risk, and probability. Also, essays about the subject. To name the most important sources, I would say. “Chances Are…” by Ellen Kaplan and Michael Kaplan, “Fooled by Randomness” by Nassim Nicholas Taleb, and “Against the Gods, The Remarkable Story of Risk” by Peter L.Bernstein. I also consulted Joey Cain, a remarkable undergraduate student from the Mathematics Department at New York University. He gave me his feedback about the methods for the dice testing experiments, and also important insights about how to analyze the results. Other than that, I also looked at randomness from a philosophical point of view, focusing on the books by Luke Rheinhardt. His focus is on how can we embrace randomness in life in different ways, how we deal with it, and how we can use it to make our lives much interesting, fun and happier. Another part of my investigation was on the essays related to what is Known as “Fluxus art”. My interest was the ideas of play and experimentation, and also the concept of intermedia. That is the collaboration between art and other fields of knowledge. I also looked carefully at the work of different artists that have addressed the topic of randomness. To name the most relevant for this project, I would have to name Francois Morellet, Ellsworth Kelly, John cage, On Kawara, Rafael Lozano Hemmer and Ryoji Ikeda. ","technical_details":"For the project, I developed a dice roller automatic machine. It consists of an amplifier that is connected to a subwoofer speaker and a computer. It has also a web camera on top of a recipient holding the dice, that is attached to the speaker. On the computer, I wrote a program on Processing to send an audio file to the speaker so it will shake the recipient and make the die jump at the rhythm of a 2 second part of a reggaeton song (after testing many different audio signals, this was the more efficient on introducing more \"chaos-shaking\"). After the die is shacked and has landed on one of the six sides, the open computer vision of the software counts the dots of the dice, and then add them to a text file. The machine is able to collect around eight hundred results per hour. Then I’m using Microsoft Excel to count the results and to visualize them. For producing digital random simulated results, I used Processing, I tunes, Python and Javascript P5. To produce \"human simulated random outcomes\" I used processing and a computer keyboard. I collected results from more than 15 people for the first experiment. And I also did my own personal set of \"random human generated outcomes\". ","further_reading":"<p>“Everybody Knows that the dice are loaded, everybody rolls with their fingers crossed”     Leonard Cohen.</p>\n<p>“But how loaded dice are?”     Nicolas Sanin.</p>\n<p>Dice are beautiful as an example of good design. My bet is that an alien intelligence would understand their concept faster than many other artifacts they could find if they would land in our beloved and endangered planet. And they would love them as I do! Their form and functionality match so well, that we don’t need too much explanation to use them, and to understand the complex, interesting and metaphysical question they are addressing: is “randomness” real? Or it’s just a word to disguise our incapability to fully explain events from a logical and rational point of view.</p>\n<p>Dice are designed to be rolled, so once they land on a surface and stop moving, we can look at their upper surface and get a message. A message that can be in the form of one dot, two dots, three dots, four dots, five dots or six dots. The idea is that we will only know the message, once the die is cast. In theory, this is impossible to know for certain, but this is questionable. According to the general idea of probability, you could get close to make a prediction, based on enough collected data, obtained from rolling the same dice in a similar way of rolling it. But there’s also a concept of each dice roll being a discrete event, meaning that it won't be determined by a previous roll or result. Even if there is a tendency in the die, each roll of the ide is an independent event. There are a lot of subtleties around this problem, that I’m excited to explore. I don’t want to believe blindly in the authority of probability, science or religion. I want to let the dice speak for themselves! And to create a dialogue with the concepts around it that come from probability, religion, physics, metaphysics, mathematics, speculation, and philosophy, among other possible ways of thinking.</p>\n<p>How “random” dice are? How random can they be? How can I test them and observe how they are creating what we call “random” results? Can we understand enough to be able to predict the next roll? Can a computer learn how to do this? If so, how accurate can it be? Would it beat us on a gambling session? These are practical questions we can address using technology like electronics, computers and off course, dice! (Which could arguably or poetically be understood as an analog, electricity-less computer or machine).</p>\n<p>People, including me, take the word “randomness” for granted. When I roll a die I do it assuming it will give me an unpredictable or “random” outcome. This also happens with the use of computers. And when we use our phone or music player in the Shuffle mode. We want to believe the randomness they produce is “perfect”. But according to Donald Knuth:</p>\n<p>“Many random number generators in use today are not very good. There is a tendency for people to avoid learning anything about such subroutines; quite often we find that some old method that is comparatively unsatisfactory has blindly been passed down from one programmer to another, and today’s users have no understanding of its limitations.”</p>\n<p>— Donald Knuth; <a href=\"https://en.wikipedia.org/wiki/The_Art_of_Computer_Programming\">The Art of Computer Programming</a>, Volume 2.</p>\n<p>As a visual artist, I have done different experiments using dices, roulettes and other means of trying to “create random results”. I have been able to visualize and reveal the nature of these random generators by doing these experiments. All of these experiments were done with analog technology like painting, pencil, paper, ink, and hands, without the use of electronics and computers. These experiments have very interesting and beautiful results, but I could go way farther using computers and electronics. This is of course nothing new. It has been done in science experiments and by the dice maker industry, and curious individuals that are often difficult to categorize. But I want to address this from the point of view of the arts. That means for me, to look into it having aesthetical interests that go in hand with conceptual questions.</p>\n<p>I think “randomness” is the border between the unknown, reason and faith. It's a concept that is so mysterious, that has been addressed by science, art, philosophy, religion, art and other areas of thinking. What I find to be beautiful is that none of them have a final word to explain it, to deny it or to affirm it is real. It has also been part of different mythologies in cultures around the world. Probably during most of human existence.</p>\n<p>There are many possible directions to take this project. That’s what is so exciting for me. It is a project that has been allowing me to learn about so many different things, that motivates me to insist on digging into it. It would take a lot of words and time to name everything I have learned since I started looking at dice through the eyes of a curious artist. I consider this project as another iteration in the journey of \"randomness\" observation. None the less, an important step for me. I will continue this path, hoping it will lead me and the ones I share it with, to very \"random\", \"unexpected\", \"surprising\" and \"thrilling findings.</p>\n<p>“I believe in a perfectly ordered chaos”  Francis Bacon</p>\n<p>“I also believe in a perfectly ordered chaos. But how perfectly ordered?”    Nicolas Sanin</p>\n","tags":[{"name":"Art","slug":"art"},{"name":"chance","slug":"chance"},{"name":"Experiment","slug":"experiment"},{"name":"probability","slug":"probability"},{"name":"randomness","slug":"randomness"},{"name":"Science","slug":"science"}],"video_presentation_url":"https://vimeo.com/336814600","video_documentation_url":"http://www.nicosanin.co/2019/04/19/slow-numbers-video-documentation/","project_url":"http://www.nicosanin.co/category/thesis-slow-numbers/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/autorretrato_1280x1920-768x432-1.jpg","title":"autorretrato_1280x1920-768x432","alt":"nico headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/DATA_BASE_MAIN-768x432-1.jpg","title":"DATA_BASE_MAIN-768x432","alt":"DATA BASE MAIN","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/humanDice-1-copy-copy_SIZE-768x432-1.png","title":"humanDice-1-copy-copy_SIZE-768x432","alt":"human Dice","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/open_cv_test_probe_april4-768x444-1.png","title":"open cv test","alt":"open cv test","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/numbers_SIZE-768x432-1.jpg","title":"numbers size","alt":"numbers size","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/ITUNE_PLAY_COUNT_size-768x432-1.png","title":"ITUNE_PLAY_COUNT_size-768x432","alt":"ITUNE PLAY COUNT","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/aleaaa_SIZE-768x432-1.jpg","title":"aleaaa_SIZE-768x432","alt":"aleaaa SIZE","caption":""}]}