{"student_id":"18","student_name":"Ayal Rosenberg","student_slug":"ayal-rosenberg","advisor_name":"Gregory Shakar","title":"ElectroEd","thesis_statement":"Tangible, electronic-music instruments - designed for children - can create more joyful and meaningful music experiences at early ages. Allowing children to easily create, play and educate themselves through experience and immersion.\r\n","abstract":"Creative outlet and joyful learning are the true jet-engines for a young child’s well being. The faster children will be allowed to create and “jam”, the deeper the experience goes (just like their quest for language). At young ages, traditional music education and instruments are maintaining a great distance between competence and actual creation. This leads to anxiety and boredom with most kids, and creates this unjustified natural-selection based on talent and pushy parents. Electronic music  instruments (such as sequencers, drum machines, loop machines), are perfect tools for achieving the goal of a joyful, fulfilling and effective music-learning experience, and are typically not marketed to young children nor offered as valid beginning instruments.<br><br>\r\nI have made two prototypes of Music-tech instruments that incorporate the ideas of helping kids (ages 6-9) encounter music in a fun, immersive and empowering way.<br><br>\r\nThe elements on which I based my designs are - simplicity, tangibility, sense-of-success, and the lack of the screen(avoiding overstimulation). For years, the field of electronic-music instruments has been growing and developing along a billion dollar industry of music production and R&amp;D labs. Why shouldn't kids be a part of the audience (and practitioners)? Do electronic beats and sounds suit only the palette of a “sophisticated” adult mind? What could happen if kids will get access to the realm of electronic instruments? <br><br>\r\nOur fear that this is too-easy and too-quick an access to music, and that kids need to learn hardship in order to become a creative person and an artist, is passé, condescending and egotistical. My research shows, that the demand for traditional instruments will rise after children will gain more positive and empowering music-experiences at young ages.With ElectroED, I create a tool that allows children to access music creation in a way that is creative and fulfilling.\r\n","context_research":"In Hans Henrik Knoop’s, “Play, Learning and Creativity”, he interrogates the philosophy that happy children are better learners. He writes, “Children are dependent on learning effectively and experiencing joy in life right from birth...if they are bored, they’ll soon grow restless and seek-out greater stimulation”. One critical factor is the “creative-tension”, which will dictate whether a child will engage or withdraw. If the tension is too big, there will be no flow and no harmony in the act. ElectroED was created with this tension in mind.<br><br>\r\n\r\nMy target users are 6-9 year-olds. I have learned that during those years, the child’s mind is making the transition from the absorbent-mind into the creative and goal-driven mind. It’s usually around the age of 10 that children are “choosing” an instrument with their parents. So I believe that before that, a child should be immersed in positive creating and really experience music. After seeing children engage my beat instrument, I have learned that the element of success is very powerful in a child’s state of creating.<br><br>\r\nIn the matter of what else is out there - Most of the Music-tech-for-kids world has an engineering (DIY) approach. It’s almost always about expressing engineering creativity and not artistic creativity. The other mediums are plastic, complicated, over-stimulating toys, and screen-based applications. There are hardly, if any, true tangible products that can be referred to as musical instruments.\r\n","technical_details":"Beat-Machine : a matrix interface on which the user places magnets, thus creating a percussive step sequencer. The magnets simply close a circuit and \"inform\" an Arduino board what to play and when. There is also a tempo knob and a drum-kit (sample) dial that allows you to change styles.<br><br>\r\n\r\nLoop-machine : a touch based ergonomic keyboard that performs as a two channel looper that synthesizes sounds in real time. This instrument uses a Teensy board, and a capacitive-touch system to manage the keyboard interaction. \r\n ","further_reading":"","tags":[{"name":"Design","slug":"design"},{"name":"Education","slug":"education"},{"name":"Music","slug":"music"},{"name":"Play/Games","slug":"play-games"}],"video_presentation_url":"https://vimeo.com/336825536","video_documentation_url":"https://vimeo.com/261948474 , https://vimeo.com/335235072","project_url":"","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/headshot-768x512-1.jpg","title":"headshot-768x512","alt":"ayal headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/imgForArchive-1-1024x576.jpg","title":"imgForArchive","alt":"1","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/goodPic2-1024x683.jpg","title":"goodPic2","alt":"1","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/8V6B0206-1024x683.jpg","title":"8V6B0206","alt":"1","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/govIls2-1024x680.jpg","title":"govIls2","alt":"1","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/looperPic-archive-1024x576.png","title":"looperPic archive","alt":"1","caption":""}]}