{"student_id":"19","student_name":"Alden Rivendale Jones","student_slug":"alden-rivendale-jones","advisor_name":"Gabriel Barcia-Colombo","title":"Future's Market","thesis_statement":"Future’s Market is a store of tomorrow: a predicted intervention into predictive systems, a performance of ubiquitous surveillance infrastructure, or a look at a world where walls and wires and bank accounts heave and palpitate with a million unhidden eyes.","abstract":"Future’s Market is the performance of a real store. Practically it operates as a kiosk facilitated by Jim Future, it's main proprietor, played by Alden. They sell a variety of different speculative services meant to be interventions into the predictive economy of tomorrow, which, thanks to ubiquitous IoT sensing technologies, has become a near perfect loop between surveillance, prediction, and behavior modification. Customers are able to buy new personalities, edit their biometric profiles, bottle up emotions to save for later, have their trash examined and scored, or get their identity scrambled. Each of these services is played not so much as a subversion of this new economy but as an unexpected extension of it, a disruption that plays by the same rules, a way of gaming the system by taking it at face value. If someone's Google search history can be used to infer their personality, why couldn't their personality be changed by targeted searching? \r\n<br><br>\r\nJim is played as the type of man who's never been told \"no\" by life yet whose greatest ambition as a small business owner is to one day pack up shop and go on a never-ending Carnival Cruise. A little bit outlandish and stylish but only so far as to drum up new business, inside he's just an everyman trying to make by without his own mediocrity getting in the way. He isn't really cut out for this world but then, who is?\r\n","context_research":"Some influences include Zach Blas’s performative lectures on the future of the internet, Michael Smith's Mike's World, Birgit Bachelor and Walter Langelaar’s Commodify.us, Extrapolation Factory’s workshop series, Hito Steyerl’s Duty Free Art, She Lea Chang’s Garlic=Rich Air, American Artists’s Black Gooey Universe, Irena Haiduk’s Whitney Frauenbank, Melanie Hoff and Dan Taeyoung's Small Data Squad, Helen Nissenbaum’s work on obfuscation tactics, and Lynn Hershman Leeson’s Venus of the Anthropocene.","technical_details":"","further_reading":"<p>I used to work as a consultant in the energy sector. My work was primarily as a statistician, but I was on a behavioral economics team, and many of my projects for clients involved devising or evaluating behavioral interventions based on large sets of energy use data. One of my clients was Nest, which provided us its users’ thermostat set point data for the purposes of predicting energy demand spikes and creating behavioral intervention products to smooth out that demand. While my work was for the social good – promoting energy efficient behavior – at some point I became disgusted with the “big data” industry as a whole, with the work I saw my colleagues outside of the energy sector doing, with the kinds of data that companies were scooping up in order to fulfill an impulse to predict and control behavior. What my coworkers saw as a grand future of greater efficiency, utility, and productivity, I saw as a sordid bifurcation of the populace into evaluators of behavior and those whose behavior was bought and sold.</p>\n<p>In ruminating on this feeling I was brought to a question: what will moving through the world feel like when most of the world is equipped to silently judge you? What if your credit score dropped when you lost your purse? Who benefits the most from these systems of remote judgement and evaluation and who bears the greatest burden? In this project I wanted to examine these questions and see how different answers felt.</p>\n<p><img src=\"http://alden.website/FuturesMarketMenu.png\" /></p>\n<p>I came up with a menu of services and decided that a store was a method I could use to engage with these questions. I wanted face to face interactions both so I could get an immediate sense over how well my ideas were being understood and put a very human face on ideas that are typically expressed abstractly.</p>\n","tags":[{"name":"Art","slug":"art"},{"name":"Machine Learning","slug":"machine-learning"},{"name":"Performance","slug":"performance"},{"name":"social practice","slug":"social-practice"},{"name":"Speculation","slug":"speculation"}],"video_presentation_url":"https://vimeo.com/337308373","video_documentation_url":"https://vimeo.com/331733303","project_url":"http://future.click","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/me-1-768x512-1.jpg","title":"me-1-768x512","alt":"alden headshot","caption":""},"thumbnail_image":{"src":null,"title":"future","alt":"WCAG violation: this image will not be displayed due to lack of alternative text.","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/P3580114_bright-1024x576.jpg","title":"Future's Market at Hester Street Fair","alt":"A picture of Alden sitting at their Future's Market booth","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/IMG_8778-1024x683.jpg","title":"Selling a New Personality","alt":"Alden selling a new personality to a customer","caption":"Alden selling a new personality to a customer"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/IMG_0854-1024x768.jpg","title":"Refuse Reading","alt":"A customer getting their garbage scanned by the Refuse Reader","caption":"A customer getting their garbage scanned by the Refuse Reader"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/IMG_20190504_134118-1024x768.jpg","title":"Bionetic Scrying","alt":"A woman standing in front of the booth looking into a webcam.","caption":"A customer being bionetically scried"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/P3580095_bright-1024x576.jpg","title":"Affect Juice Jar","alt":"A customer holding down a red button in order to fill up a jar labeled \"disgust\" with a greenish liquid","caption":"A customer filling their affect juice jar with \"disgust\""}]}