{"student_id":"20","student_name":"Amitabh Shrivastava","student_slug":"amitabh-shrivastava","advisor_name":"Nancy Hechinger","title":"Programmable-Air","thesis_statement":"Programmable-Air is an easy-to-use open-source hardware kit that enables makers to control air flow for their DIY soft robotics projects. My thesis is to crowdfund this project and get it ready for small-scale manufacturing.","abstract":"Soft Robotics is an emerging field that deals with making mechanisms out of highly flexible materials. It is gaining traction in academics with multi-million dollar investments because of emerging use cases in human-robot interaction and industrial automation. The field is still in its infancy. I believe that given the right tools, makers will have a lot to contribute to soft robotics. The aim of Programmable-Air is to provide makers with a tool to control air flow and in doing so, advance inflatable soft robotics. \r\n<br><br>\r\nI have already hand-made and sold over two dozen Programmable-Air beta kits to makers at institutes like UCLA and Microsoft. Academics and artists have used the kit to power projects such as- an inflatable bra, a sculpture about female sexuality, a Halloween prank, an inflatable seat-belt, lego-like soft grippers, and more! There is an increasing demand that can only be met by small-scale(i.e. thousands of units, not millions) manufacturing, which requires an exorbitant upfront investment. So, I am launching a crowdfunding campaign to make this tool available for the maker community.","context_research":"Programmable-Air started out as the final project for the Soft Robotics class taught by Kari Love. I wanted to make a walking soft robot. I soon realized that while it’s very easy to 3D print molds, and cast silicone to make a state-of-the-art soft robot, it’s very difficult to control it programmatically. <br><br>\r\n\r\nTools like Soft Robotics Toolkit from Harvard and Pneuduino from MIT are trying to make inflatable soft robots more accessible. But they leave a lot to be desired in portability, ease of use, and -most importantly- cost. So I created Programmable-Air, an economical, portable, plug’n’play solution. ","technical_details":"Programmable-Air has a built-in high-pressure pump, vacuum pump, pneumatic valves, pressure sensor, and an Arduino Nano. The output from Programmable-Air is a single tube that goes into your soft robot or pneumatic actuator. By controlling the motors and valves, you can push air in or out of the actuator, or let it exchange air with the atmosphere. All the while you get feedback about the state of the actuator through the pressure sensor.\r\n<br><br>\r\nThe Programmable-Air Arduino library makes it easy to control the valves and pumps. Simple functions like blow(), suck(), vent(), and readPressure() cover most of the basic use cases.\r\n","further_reading":"<p>I want to see Programmable-Air in the hands of makers. Unfortunately, the only way to do this without losing a lot of money is to sell it. But I don’t want to make a lot of profit from selling it, just enough to make it a self-sustaining business.</p>\n<p>Selling it at a reasonable price point involves leveraging the benefits of mass manufacturing. Which means upfront investment before the kits are ready to be sold. Because I’m not comfortable making such an investment as a student, I chose to go with a crowdfunding model where people pre-order the kits. After a lot of deliberation, I chose <a href=\"https://crowdsupply.com\">CrowdSupply</a> instead of the more popular platforms like Kickstarter or Indiegogo. CrowdSupply specializes in open source hardware projects and can provide engineering and logistical support taking some of the burden off my shoulders.</p>\n<p>Having a successful crowdfunding campaign depends on a lot of factors, with community engagement being chief among them. People need to have trust in the product and in me, to pay for a product that hasn’t been manufactured yet. So, I have been taking a lot of steps to engage people in the project. I have been going workshops on using Programmable-Air, and have set up speaking engagements at conferences during the crowdfunding campaign. I have also been collaborating with artists, mainly from within ITP to make interesting projects with the kit.</p>\n<p>Finally, I have also been trying to develop collaborations with businesses. Proto-Sauce, a maker of flexible 3D printing resin is one such business. Proto-Sauce’s resin can be used to make soft actuators that work with vacuum instead of high pressure. Which makes it a perfect pairing with Programmable-Air. Currently, I am working with <a href=\"https://www.proto-sauce.com/\">Proto-Sauce</a> to make a scale model of Baymax(a character from Big Hero 6) which folds in on itself. Another collaboration I have been developing is with <a href=\"http://opensoftmachines.com\">Open Soft Machines</a>. They make DIY kits of soft robotic actuators, which are easily controlled with Programmable-Air. I am hoping to offer a Programmable-Air, Open Soft Machines combined kit in the crowdfunding.</p>\n<p>Taking a project to production brings with it a number of challenges, such as finding reliable component suppliers, packaging, negotiating manufacturing costs. I was blindsided by the assembly cost of the kit, which exceeded the cost of the parts and shipping put together. I had to redesign much of the circuit board to end up with an increased cost of components, but reduced overall production cost due to savings in assembly cost.</p>\n<p>Initially, I wanted to sell Programmable-Air kits at a 75$ price point, maybe 100$ with accessories and shipping included. And with a 40$ bill of materials, it seemed like a reasonable price. But as a soon found out after speaking with manufacturers this could not be. The best assembly cost quote I could get was 68$ per board at a hundred boards minimum order. So currently, I am planning to sell the boards at 175$ each.</p>\n<p>I also learned that manufacturing costs vary widely between sources due to reasons too complex to predict. For example, when getting quotes for product cases, I was getting quotes in the 7-12$ range. After some more searching, I found a seller who could offer a similar case for 3.5$ each. The reason, as it turned out was that they could make my case by combining the bottom pieces of a different case that they had in surplus stock. I’m all too happy to pass on this profit to the customers and will keep in mind to get as many quotes as possible next time onwards.</p>\n<p>Having read up a lot on hardware manufacturing, the common theme I found was ‘be ready for things to go wrong’. I can’t wait to find out what goes wrong with Programmable-Air production.</p>\n","tags":[{"name":"Electrical Engineering","slug":"electrical-engineering"},{"name":"Experiment","slug":"experiment"},{"name":"Robotics","slug":"robotics"},{"name":"Science","slug":"science"},{"name":"Software","slug":"software"},{"name":"Tool","slug":"tool"}],"video_presentation_url":"https://vimeo.com/336814645","video_documentation_url":"https://vimeo.com/318337374","project_url":"https://programmableair.com","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/IMG_4688-Edit-Copy-2-768x432-1.jpg","title":"IMG_4688-Edit-Copy-2-768x432","alt":"amitabh headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thumbnail-1-1024x614.png","title":"thumbnail","alt":"thumbnail","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/mainImg-1-1024x683.jpg","title":"Programmable-Air kit","alt":"Programmable-Air kit","caption":"Programmable-Air kit."},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/mainImg-2.gif","title":"Programmable-Air action","alt":"Programmable-Air action","caption":"Programmable-Air in action."},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/mainImg-3-1024x683.jpg","title":"Hand assembled kits.","alt":"Hand assembled kits.","caption":"(painstakingly) Hand assembled kits."},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/mainImg-5-1024x683.jpg","title":"User testing!","alt":"User testing!","caption":"User testing!"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/mainImg-4-1024x683.jpg","title":"World Maker Faire, NYC","alt":"World Maker Faire, NYC","caption":"World Maker Faire, NYC"}]}