{"student_id":"22","student_name":"Beverly Chou","student_slug":"beverly-chou","advisor_name":"Kathleen Stevens Wilson","title":"Slow Net","thesis_statement":"Slow Net is a series of experiments that explore how slow networks can be used to protect against data-collecting entities that threaten our autonomy and influence our identities.","abstract":"Privacy concerns have made many news headlines recently, and it’s become clear that our behavioral data is collected when we’re browsing online and using smart devices. Some of the data is used for improving user experience, but much of it is used to predict and influence our behaviors in real-time. By predicting what we’ll do next, data collectors can use the data to intervene and divert our actions in a direction that supports them economically. In this process, humans are reduced to interchangeable pieces of data in a homogenous population of data laborers. As a result, power and wealth is concentrated among those who are able to collect, utilize, and gatekeep vast amounts of information. Our identities get privatized and our autonomy is threatened.<br><br>\r\n\r\nBecause real-time collection of data is enabled by fast Internet speeds, one form of resistance could involve co-opting a tactic from labor unions called the slowdown strike, in which workers deliberately reduce their productivity. My thesis project, Slow Net, aims to utilize this strategy of purposeful inefficiency in three pieces. <br><br>\r\n\r\n1. A zine called A Quick Guide to the Slow Net provides conceptual context to the problems underpinning data collection. <br>\r\n\r\n2. An online messaging application, Slow Chat, forces users to write longer messages and wait longer between messages as conversations progress. <br>\r\n\r\n3. A Slow Router provides free wifi at a much slower speed than expected. <br><br>\r\n\r\nEach of these pieces functions with the goal of slowing the capture of personal data, encouraging more intentional action, and creating opportunities for idle time that allow for introspection and self-development. Collectively these actions attempt to preserve our autonomy and identity. My hope is that as users we can reconsider our relationship with many of the internet platforms we use that exploit us, and as technologists we can re-examine our role in working with and developing these technologies.","context_research":"I originally started my inquiry by asking how we can build trust in our everyday technologies by exposing their underlying systems. I am fascinated with infrastructure and Hans Haacke’s work, especially \"Condensation Cube\", which exposes an invisible system in action. Haacke’s \"Shapolsky Et Al. Manhattan Real Estate Holdings, A Real-Time Social System, As Of May 1, 1971\" was my main inspiration in trying to map where our behavioral data goes after it gets collected. After reading Shoshana Zuboff’s \"The Age of Surveillance Capitalism\" and Jack Self’s article \"Beyond the Self\", I eventually diverged to focus on the impact of data collection because I was alarmed by the imbalance of power between users and data holders. Our current ITP resident Se¿o’s \"Postcards Computer\" and Kevin Roose’s New York Times article “Is Tech Too Easy to Use?” helped me to develop a rationale around how complexity and inefficiency can be used advantageously. \r\n<br><br>\r\nFor A Quick Guide to the Slow Net, I was inspired by Mimi Onuoha and Diana Nucera’s \"A People’s Guide to AI\" and and Amy Wibowo’s \"Bubblesort Zines\". I really like how they discuss complicated technical ideas to broader audience. Slow Chat was largely inspired by my inability to text people back within socially appropriate timeframes. For the Slow Router, I looked to other artists using network infrastructure to resist against invasions of privacy like Trevor Paglen’s \"Autonomy Cube\" and Dhruv Mehrotra’s \"Othernet\". ","technical_details":"Slow Chat was created using Node.js, Express, and Socket.io javascript libraries. The Slow Router is a Raspberry Pi 3 B+ on Raspbian Stretch Lite operating system running hostapd, isc-dhcp-server, wondershaper, and nodogsplash.","further_reading":"","tags":[{"name":"Networks","slug":"networks"},{"name":"Privacy/Security","slug":"privacy-security"},{"name":"Social Good/Activism","slug":"social-good-activism"},{"name":"Speculation","slug":"speculation"}],"video_presentation_url":"https://vimeo.com/336836245","video_documentation_url":"","project_url":"https://beverlychou.com/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/bev-headshot-1.jpg","title":"bev-headshot (1)","alt":"bev headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thesis-archive-icon.jpg","title":"thesis-archive-icon","alt":"hand draw image of a snail","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thesis-archive-main-1024x565.jpg","title":"thesis-archive-main","alt":"photo showing the slow net zine on the left, an iphone displaying slow chat app in the middle, and a rapsberry pi with an ethernet cable plugged in on the right","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thesis-archive-zine-1024x632.jpg","title":"thesis-archive-zine","alt":"Young woman stands by window reading a zine that reads \"A Quick Guide to the Slow Net\" on the cover","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thesis-archive-chat-1-1024x602.jpg","title":"thesis-archive-chat-1","alt":"screenshot from a laptop showing slow chat app conversation between two people","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thesis-archive-slownet-portal-1-425x1024.jpg","title":"thesis-archive-slownet-portal-1","alt":"screenshot from a smartphone of slow net captive portal","caption":""}]}