{"student_id":"23","student_name":"Barak Chamo","student_slug":"barak-chamo","advisor_name":"Gabriel Barcia-Colombo","title":"An Instrument of Value","thesis_statement":"A computer-controlled carving machine - reprogrammed, refitted and repurposed.<br>\r\nDefying its intention of production to continuously draw patterns in sand.<br><br>\r\n\r\nAn Instrument of Value is a robotic sculpture that portrays the juxtaposition between technological and a human experience rooted in the present.","abstract":"We make technology in our image, an extension of our bodies and senses. In return, technology, through automation and mechanisation, shapes human society. But as some aspects of human function, such as production and association, are accelerated, other parts of the human experience are diminished. This societal “tunnel vision”, driven by globalized values of production and consumption, stands at great odds with spiritual and cultural practices that place meditation, presence and impermanence at the core, rather than the periphery.\r\n<br><br>\r\nI remembered visits to Zen temples in Japan, where I saw monks endlessly rake rock gardens and picking moss, or the dedication of Tibetan monks as they draw sand mandalas only to sweep them away upon completion. I was inspired by this contrast and conflict of values to use technology in service of meditation, true experience and presence. Using machines of production automation and reprogram them into agents of continuous practice, defying their purpose of production, focusing on the performance of a task rather than its material outcome or accomplishment.\r\n<br><br>\r\nEach geometric patten is plotted slowly, neatly, in white sand and as it completes the machine dwells for a short while, allowing viewers to appreciate and contemplate its performance but not own or collect it.  Then, in decisive brush strokes, it sweeps away the sand to clear the plate for a new design, again and again.\r\n<br><br>\r\nWith this work I hope to open up the question of how technology shapes our society, and what are the cultural values that dictate the direction in which technology evolves. Can we imagine a world in which meditation and presence are not at odds with technological progress? How could a meditating robot inspire us to imagine such a future?","context_research":"Research for my thesis project was divided into three parts: conceptual, technical and formal.\r\n<br><br>\r\nI began by studying Asian philosophy and spiritual practice to understand the meaning behind meditational practices that were inspiring to me, such as the drawing and destruction of sand mandalas, raking of rock garden, and various forms of dance. I also studied Western philosophy, media theory and sociology, including writings by Kant, McLuhan, Dewey and Marcuse in an attempt to identify and explain (to myself first) the disparity and opposition I noticed between technological progress and a diminishing sense of meaningful connection, presence and experience.\r\n<br><br>\r\nTechnical research focused on learning how to generate mandalas in code, based on a set of rules that are randomly activated. These generated drawing then had to be converted into machine code, and plotted using software I wrote to control CNC carving machines. I also had to experiment with various methods for plotting sand at constant rates and built a custom sand extruder that could be retrofitted onto my machine of choice.\r\n<br><br>\r\nI also conducted formal research on the meaning and structure on mandalas, and found helpful books that broke down the intricate sand paintings intro their constituent parts. It was very important to me that the drawings created by the machine are respectful to the original formal meaning of  the mandala and that they pay homage to this truly inspiring spiritual practice, rather than appropriate and desecrate it.","technical_details":"The piece is made of a repurposed X-Carve CNC machine, used typically as an automated carving machine, custom software I wrote to generate vector mandalas as SVGs and convert them into G-Code, that can then be plotted by the X-Carve.\r\n<br><br>\r\nTo extrude the sand I used an Arduino micro controller to identify signals from the X-Carve's controller that are meant to activate a drill. These signals turned a custom-built funnel I built out of brass on and off, letting sand out at a constant rate.","further_reading":"","tags":[{"name":"Art","slug":"art"},{"name":"Culture","slug":"culture"},{"name":"Meditation","slug":"meditation"},{"name":"Robotics","slug":"robotics"},{"name":"Sculpture","slug":"sculpture"},{"name":"Speculation","slug":"speculation"}],"video_presentation_url":"https://vimeo.com/337308528","video_documentation_url":"https://vimeo.com/331471476/b09680eede","project_url":"http://barakchamo.com/instrument-of-value","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/5W3A1653-768x512-1.jpg","title":"5W3A1653-768x512","alt":"barak headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/0C2A9362-2-2.jpg","title":"An Instrument of Value","alt":"An Instrument of Value - the moment the machine begins to brush the sand painting away","caption":"The machine begins brushing away the sand painting"},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/0C2A9362-1024x576.jpg","title":"An Instrument of Value","alt":"An Instrument of Value - the moment the machine begins to brush the sand painting away","caption":"The machine begins brushing away the sand painting"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Untitled1-1024x576.jpg","title":"An Instrument of Value","alt":"An Instrument of Value - top view of the machine","caption":"A pattern is plotted, each one is unique"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/5W3A6537-1024x576.jpg","title":"An Instrument of Value","alt":"An Instrument of Value - a completed four leaf lotus pattern","caption":"Upon completion the machine dwells for a minute, allowing viewers to appreciate its performance. The pattern, however, cannot be removed whole from the fixed black bed."},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/7A7A6830-1024x576.jpg","title":"An Instrument of Value","alt":"An Instrument of Value - parts of sand extruder","caption":"Parts of the sand extruder, this replaced the typical drill spindle, transforming the purpose of the machine"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/0C2A9358-1024x576.jpg","title":"An Instrument of Value","alt":"An Instrument of Value - completed hexagon pattern","caption":"The sand is extruded slowly and precisely, the formation of accurate patterns is mesmerizing to watch."}]}