{"student_id":"25","student_name":"Chian Huang","student_slug":"chian-huang","advisor_name":"Adaora Udoji","title":"Memory Playback, \"Grandma, do you remember?”","thesis_statement":"Memory Playback, “Ama, do you remember?” is an interactive experience with spatial audio design that brings the past memory between my grandma and me to the dining table. This project is designed for my grandma who suffers from Alzheimer's disease. It questions about can the emerging technology help to recall my grandma’s loss memory and enhance her life quality.","abstract":"Memory Playback, “Grandma, do you remember?” is an interactive memory playback experience designed for my grandma. The experience is about a series of past memories between my grandma and her family that are projected on a set of plates. \r\n<br><br>\r\nIn this experience, each plate is designed as a plane for projecting different life moments between my grandma and me. The plate is like a container that holds the memory; therefore, by putting different plates together, it will trigger different video and spatial audios. The audio contains the recordings of the conversations we had in the past which associated to individual memory, including narration to guide through the experience.  \r\n<br><br>\r\nMy grandma suffers from Alzheimer’s disease who experiences memory loss, cognitive and mobility disability. As her family members, it’s difficult to see our loved one changes dramatically to a different person. Although she loses her memory about her family, she still enjoys being around with them. Therefore, this project is designed for myself, my grandma, and the family as an opportunity to look back the memories and celebrate these precious moments together. Moreover, I want to investigate how effective it can be by using different forms of visuals and audios to recall the memory for Alzheimer’s patient. \r\n","context_research":"I practiced different methodologies of research, such us observation, qualitative research, and literature reviews. \r\n<br><br>\r\nFor over five years, I have observed my grandma who has slowly progressed from the early stage of Alzheimer’s to the later stage today. Other than understanding my grandma, I also talked to different family members whose loved ones also suffer from the same disease. In particular, I want to know about what do they feel, what have they done to fight for the disease, and what are their best wishes to them. Moreover, I was able to talk to the Clinical Supervisor from Alzheimer’s Association, NYC Chapter, who is in charge of organization’s care and support team. After the conversation, I understand what do the professionals have learned and what do they think from an organization’s perspective. \r\n<br><br>\r\nLastly, I have reviewed many different studies such as how the brain works, how the memory is recalled, how can Alzheimer’s patients deal with their life changes, and how can the emerging technologies help the family members’ life to become better. \r\n","technical_details":"Video Content: <br>\r\nThe footages are filmed by Kinect and Depthkit. After creating the content, the video will be triggered based on user’s input, such as placing the plates on the table or opening the lid of a container. \r\n <br><br>\r\nInteraction:<br>\r\nEach plate is embedded with photocell sensors, when the user moves the plates or open the lid, the video footage and the audio will be triggered.\r\n <br><br>\r\nAudio:<br>\r\nThe content of the audio are based on the recordings, including conversations between my grandma and me, sound effects, and audio narration that guides the user through the entire experience. ","further_reading":"<p>Background:</p>\n<p>Both of my grandmas are currently suffering at different stages of Alzheimer’s disease. Although they are the one who is suffering from the disease, as a family member, it is very difficult to see them having dramatic changes in personality, physical, and cognitive ability. Because of the impact of Alzheimer’s disease, their life quality decreases. All of the changes are very unexpected for not only the patients but also the family members.</p>\n<p>According to U.S Government of Health &amp; Human Service, Alzheimer is a possible genetic disease. Also, Alzheimer’s disease is an irreversible, progressive brain disease, there’s still no cure for this disease today.</p>\n<p>Imagine my parents who might carry the gene that lead to Alzheimer’s, they have high chances to be the next Alzheimer's patients. Seeing my grandma who lost her memories of her families and suffer during the rest of her life, I have a strong incentive to find a way to enhance the life quality for Alzheimer’s patients.</p>\n<p>Original Work Process:</p>\n<p>I want to design an experience that my grandma is able to see the shared memories that we both own together on the dining table when she is alone oversea in Taiwan.</p>\n<p>By using depth camera (MS Kinect), I will be able to capture the body in 3D space and observe the footage (data) by using Depthkit, then export the footage into Unity using Depthkit Unity Plugin. After that, I can tag the footage to the assigned object. By using Vuforia image target, the footage will be called and used to augment real life by using this AR app.</p>\n<p>The emphasis in this project will be choosing the key memories (footages) to focus on, the target object on the dining table (specially designed tableware), and the presentation of how the memories (footages) will be displayed in the physical space. The reason why the location is taken place on the dining table is because having dinner together with all family members is a valuable moment in the traditional Asian culture, especially in Taiwan. The greatest thing that my grandmas will like to see is all her family eating on a same dining table. Unfortunately, the companionship could only be done through technology today since we are at a different stage of life that can't physically be there.</p>\n<p>Research and Testing:</p>\n<p>After researching on Alzheimer’s patient by observing my grandma and talking to many family members, I realized the best cure for them is family’s companionship. Although my grandma doesn’t remember anything, she loves to be around with her family and listen to the the past memories or any stories related to them. As a result, I decide to build this experience specially for my grandma as a gift.</p>\n<p>In the beginning, my research focuses on investigating how AR could be used to create an experience to enhance the life quality for Alzheimer’s patients. I planned to project the video to the physical environment, like holographic.<br />\nAfter validating and user test on the concept, I realized this is not the best solution. First, it doesn’t make sense to activate the memory through phone when my grandma is on the dining table. Second, my grandma is not so tech-savvy and she might be confused of seeing the holographic. Lastly, the setting seems incomplete and the message doesn’t convey so strongly.</p>\n<p>Conclusion:</p>\n<p>After several experiments, I decide to focus on the goal of the idea, which is letting my grandma to see her lost memory on the dining table. Without complicated settings, I focus on the visual and audio interaction which invites the user (my grandma) to see the journey of our memory. The video content is still filmed by Kinect and Depthkit. Instead of projecting a 3D visual to the physical environment, I'm using projection mapping techniques to project the video footages that are triggered by user's interaction.</p>\n","tags":[{"name":"Art","slug":"art"},{"name":"Design","slug":"design"},{"name":"Installation","slug":"installation"},{"name":"Memory","slug":"memory"},{"name":"Narrative/Storytelling","slug":"narrative-storytelling"}],"video_presentation_url":"https://vimeo.com/336814678","video_documentation_url":"https://vimeo.com/user72937333/memoryplayback","project_url":"https://www.chianhuang.xyz/memoryplayback","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/ChianHuang-768x432-1.jpg","title":"ChianHuang-768x432","alt":"Chian headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/archive_main.jpg","title":"archive_main","alt":"memory playback_main","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/archive_slide4-1024x576.jpg","title":"archive_slide4","alt":"all the projection","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/archive_slide5-1024x576.jpg","title":"archive_slide5","alt":"one of the projection","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/archive_slide1-1-1024x576.jpg","title":"archive_slide1","alt":"my grandma and the younger me","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/archive_slide3-1-1024x576.jpg","title":"archive_slide3","alt":"my grandma and the current me","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/archive_slide4-1-1024x576.jpg","title":"archive_slide4","alt":"words to say it to my grandma","caption":""}]}