{"student_id":"26","student_name":"Chelsea Chen Chen","student_slug":"chelsea-chen-chen","advisor_name":"Gabriel Barcia-Colombo","title":"Now You Are In the Conversation","thesis_statement":"A playful critique that visually depicts the relationship between artist, artwork, and audiences in an age that mediated by smartphones and social networks. To discuss how do people look at artworks now and does our obsession with capturing takes away from the enjoyment of the experience itself.","abstract":"Now you are in the conversation is a square-shaped keyboard displayed in a 30-inch frame just like a traditional oil painting. Instead of having 26 letters, it has hundreds of blank keys. Hundreds of mini solenoids drive those keys to type themselves nonstop until it detects audiences are taking photos for it.\r\n\r\n","context_research":"It takes two to tango, and also to have a conversation. The self-typing keyboard illustrates the artist’s endless monologue, and audiences can join the artist by viewing it. At this moment, the monologue turns to a conversation. The blank keys represent that art is not asking you to accept a conclusion, just that you entertain these possibilities -- what makes art special is that it resists closure. When the audiences raise their smartphones they ended the conversation, everything stops. \r\n <br><br>\r\n\r\n Any discussion of how we look at art today must take into account how the world of art has changed with the advent of smartphones and social networks.<br><br>\r\n<br><br>\r\nIf you google an image of the Mona Lisa today, you will be confronted with as many images of visitors raising their smartphones to document the painting as you will of the piece itself. Moreover, in terms of those most popular Instagram-Ready exhibitions - such as Dream Machine and 29 rooms - the experience of the artwork itself is secondary to its pictures. You won’t really remember the physical experience of being in the exhibitions; only how it looks. The enduring part of the experience is how it lives as a photo, and so only its photographic qualities matter. \r\n<br><br>\r\n\r\nIn my opinion, observation should be primary to participation. In classic Kantian aesthetic philosophy, the “judgment” of art was specifically about removing a given object of contemplation from “personal interest.” The aesthetic was the domain where audiences separated themselves from attachments to artist or subject matter and judged the work independently. \r\n <br><br>\r\nI hope to spark curiosity that my audience might get interested in other things besides their own image. So I created an interactive installation that gets annoyed by being surrounded by people who take too many photos. \r\n","technical_details":"To detect whether the audience is documenting, I need to define this human gesture in machine language. I used openPose TensorFlow to identify human hand skeletons and trained my binary classifier, which takes the hand skeletons as input features to predict whether the audience is taking a picture by phone.","further_reading":"","tags":[{"name":"Art","slug":"art"},{"name":"Culture","slug":"culture"},{"name":"Installation","slug":"installation"},{"name":"Machine Learning","slug":"machine-learning"}],"video_presentation_url":"https://vimeo.com/337308653","video_documentation_url":"https://vimeo.com/331218720","project_url":"https://chelseachenchen.com/portfolio/now-you-are-in-the-conversation/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/profiloPic-768x432-1.jpg","title":"profiloPic-768x432","alt":"chelsea headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thumbnail-7-576x1024.jpg","title":"thumbnail","alt":"a close shot of white computer keys","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/WechatIMG2347-1024x562.png","title":"WechatIMG2347","alt":"a keyboard wall","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/keyImage4-1024x576.jpg","title":"keyImage4","alt":"a closed shot of keys","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/keyImage2-1024x576.jpg","title":"keyImage2","alt":"a closed shot of keys","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-05-10-at-12.06.02-AM-copy-1024x576.jpg","title":"Screen Shot 2019-05-10 at 12.06.02 AM copy","alt":"a woman tries to take a photo for the keyboard wall","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-05-10-at-12.08.51-AM-copy-1024x576.jpg","title":"Screen Shot 2019-05-10 at 12.08.51 AM copy","alt":"a key cap attached with a solenoid","caption":""}]}