{"student_id":"27","student_name":"Caleb Ferguson","student_slug":"caleb-ferguson","advisor_name":"Gregory Shakar","title":"North Central Positronics","thesis_statement":"A sprawling online text adventure game set in a post-apocalyptic future where any player can add-to or change the game universe at any time. ","abstract":"While we gladly recount \"It's not about the destination, it's about the journey\", the results-based culture we live in often encourages the opposite. <br><br>\r\n\r\nDespite our professed disdain for rigid procedures and bureaucracy, we find ourselves entrenched in economic and social systems that enforce behavioral compliance to protocol.\r\n<br><br>\r\nThis game is set an post-apocalyptic world dominated by an authoritarian collective called North Central Positronics. While the overbearing collective demands the player follow certain instructions, the game allows players to break away from protocol and make their own path.<br><br>\r\n\r\nPlayers that stake out their own path have complete control over the content of their adventure, and whatever they add is permanently saved in the game universe. Players can link their adventures and narratives to others material in the game - creating an opportunity for collaborative creativity as well.\r\n<br><br>\r\nThe game allows players to do all of this under the veil of total anonymity, giving them an opportunity to adventure without fear of surveillance or judgement.\r\n<br><br>\r\nThe resulting game universe is therefore ever-changing and rhizomatic. Players that contribute to it break away from artificial ‘choices’ a traditional game or story has to offer, and instead truly create their own.","context_research":"North Central Positronics is commentary on technology’s role in the concentration of power and authority. <br><br>\r\n\r\nModern technologies like cloud computing, media streaming, blockchain, and even the internet itself promised decentralization and democratization; but have also created mega-tech giants, overnight millionaires, and crises about surveillance and personal data.<br><br>\r\n\r\nAlexander Galloway details this era of containment and control in his book 'Protocol: How control exists after decentralization'. It is an era of fidelity, pattern and algorithm where information is a life-force and randomness is the enemy. \r\n<br><br>\r\nCompanies in this era grapple for complete control of our wallets and eyeballs by creating behavioral funnels that provide the ‘illusion of choice’ in the content we see and the actions we take.<br><br>\r\n\r\nNetflix’s interactive 'Bandersnatch' is a paragon of this illusion. While viewers feel they’re making personalized choices, they are really operating within a gated, highly monitored world designed to retain their attention.<br><br>\r\n\r\nNorth Central Positronics goes a step beyond the gated worlds of choose-your-own-adventure games and rigid text adventure games like Zork. It is influenced by The Stanley Parable, which pokes fun at the illusion of choice in games and in life; and Dungeons &amp; Dragons, which encourages creativity and spontaneity in lieu of optimal path-finding.<br><br>\r\n\r\nThe game’s content is inspired by works of sci-fi including The Matrix and Animatrix series, The Dark Tower series by Stephen King, and CW’s The 100 - works which call these themes into question by transporting the viewer to a world just far enough from our own.","technical_details":"North Central Positronics looks like a game, but is secretly a wiki! It is powered by Mediawiki - the software that runs Wikipedia. Mediawiki was used because it is designed for collaborative production and has many add-on “extensions” that enable the game’s design, features, and content.<br><br>\r\n\r\nIt is deployed to the web through Heroku, connected to a ClearDB MySQL database and AWS S3 bucket for multimedia storage.","further_reading":"","tags":[{"name":"Culture","slug":"culture"},{"name":"Narrative/Storytelling","slug":"narrative-storytelling"},{"name":"Networks","slug":"networks"},{"name":"Play/Games","slug":"play-games"},{"name":"Speculation","slug":"speculation"}],"video_presentation_url":"https://vimeo.com/336825590","video_documentation_url":"","project_url":"https://thesis.calebfergie.com","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/caleb-headshot-e1557460120298-768x432-1.jpg","title":"caleb-headshot-e1557460120298-768x432","alt":"caleb headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/db-main-pic.png","title":"db-main-pic","alt":"db-main-pic","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/7-db-1024x608.png","title":"7-db","alt":"7-db","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/vista-no-bar-1024x529.png","title":"vista-no-bar","alt":"vista-no-bar","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/ScienceVictoryCiv5_ScreenArt.png","title":"ScienceVictoryCiv5_ScreenArt","alt":"ScienceVictoryCiv5_ScreenArt","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/shareholder-value-1.jpg","title":"shareholder-value","alt":"shareholder-value","caption":""}]}