{"student_id":"28","student_name":"Camille M Weins","student_slug":"camille-m-weins","advisor_name":"Gregory Shakar","title":"The Comorbiditree","thesis_statement":"The Comorbiditree is a tool that takes a case study approach to illustrating how mismanaging type 2 diabetes, which is heavily affected by blood sugar levels and exercise duration, can lead to the development of a comorbidity or multi-morbidity.","abstract":"Type 2 Diabetes is considered the 7th leading cause of death in the United States. However, Heart Disease is ranked at number one, and can be considered a comorbidity of Diabetes. Thus, a diabetic needs to undergo a monumental lifestyle change to manage their fasting blood glucose level, effectively creating a constrained environment that can oftentimes make them feel powerless. The Comorbiditree seeks to provide new perspective on a user’s sense of control. This app was designed with my mother’s statistics in mind, however, it can easily be scaled for others. This app utilizes two quantifiable variables, blood sugar, a reflection of your diet, and exercise duration, which can have immediate results on your blood sugar value, to build a model that connects my mother’s data and relates it to its comorbidities. ","context_research":"I spent a lot of time talking to Dr. Boris Boguslavskiy about the specifics of the disease and where he finds some of his resources for patient pamphlets. I also was in correspondence with Sam Slover regarding a lot of the technicalities of my thesis. My thesis is a reflection of applied science with a secondary focus on the visualization.\r\n<br><br>\r\nMy mother doesn’t own a computer. She’s around them constantly for her job so she doesn’t want to see any symbols of work when she’s home. It made perfect sense to build a web app because it’s easy to scale for a tablet or smartphone. A case study approach gives me the ability to make a speculative model such as this without worrying about the liability of developing for a wide audience, given the subject matter. However, that doesn’t mean that someone can’t use my approach as a reference for their own personal needs.\r\n","technical_details":"I’m using d3.js to bind the data to a radar style graph. Radar graphs are meant for multivariate data; you would typically see these graphs used for personality tests. <br><br>\r\nThis project is a web app that is database-less. It saves the data using local storage and can easily be cleared by the user. I deployed this app using Heroku. I made my own equations based on exercise duration and blood sugar level.","further_reading":"<p>Existing diabetes apps can be too granular. They focus on diet, or they gamify blood sugar data. But there is something interesting about being more speculative and holistic. Anyone can become diabetic. My mother falls into the category of not overweight or visually heavy, tall, fairly active and works long hours, yet she has diabetes. I chose to build a predictive tool for my mother that showcases your future if you don’t make radical lifestyle choices and adhere to them. Her biggest fear is that she will need insulin to manage her blood sugar. To my mother, the existing apps are annoyingly positive. She says she doesn't need someone to tell her she’s doing great or anything because she already has no choice. I took an unusual approach in the design by making it not encouraging, but intentionally cold and reflective of the data. I didn’t want to sugar coat anything. As stated by Dr. Boguslavskiy, a lot of people like to blame the development of a disease on genetics, but, “genetics is 20-30% percent of the blame up to a certain age.” Our body systems are more connected than we realize. They are a complex network of tissues and when one element starts to crumble it doesn’t take much for something else to topple.</p>\n<p>I have included a works cited document for all of the literature I have referenced in building the Comorbiditree.</p>\n<p><a href=\"https://bit.ly/2ZhbgMk\">https://bit.ly/2ZhbgMk</a></p>\n","tags":[{"name":"Data","slug":"data"},{"name":"Science","slug":"science"},{"name":"Speculation","slug":"speculation"},{"name":"Tool","slug":"tool"}],"video_presentation_url":"https://vimeo.com/336825663","video_documentation_url":"","project_url":"https://comorbiditree.herokuapp.com/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/camille-weins-768x432-1.jpg","title":"camille-weins-768x432","alt":"camille headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/graph-2.jpg","title":"graph","alt":"graph of comorbidities","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/low-risk-1024x567.jpg","title":"low-risk","alt":"low comorbidity odds","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/moderate-risk-1024x597.jpg","title":"moderate-risk","alt":"moderate risk","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/high-risk-1024x597.jpg","title":"high-risk","alt":"high comorbidity odds","caption":""}]}