{"student_id":"29","student_name":"Camilla Padgitt-Coles","student_slug":"camilla-padgitt-coles","advisor_name":"Gregory Shakar","title":"The Tuning House","thesis_statement":"\"The Tuning House\" is a voice-activated light and sound installation where you use your voice to choose a color and sound palette. The frequency of the participant’s voice is translated into a synthesized pitch and color, creating a personalized expression of chromo-synesthesia. Isolating color and sound pairings in this way highlights a simplified and subjective relationship between frequencies which are present all around us.","abstract":"The idea behind this project is to customize sounds and related colors using something personal to the participant as an input. For this installation, the personalized input is the voice. It encourages humming, toning and actively using the voice to customize pitches and related colors. As the participant's voice is synthesized into minimalist color, light, and sonic tones, a feedback loop is created that can continue or be frozen to create a chord or meditative drone. This interaction can create joy out of thin air and/or quiet the mind and thoughts depending on the way the participant chooses to interact with it. ","context_research":"My main influences were Brian Eno’s relaxation rooms that he created for a hospital in the UK and LaMonte Young and Marian Zazeela’s \"Dream House\" installation in NYC. \r\n<Br><Br>\r\nBrian Eno’s relaxation rooms for the Montefiore Hospital in England seemed like exactly like a place that I wish existed in public spaces everywhere; somewhere quiet and pleasant to escape to and recharge in before returning to your daily tasks, whatever they may be. The Dream House by LaMonte Young and Marian Zazeela is a place I have visited many times. While it is not technically interactive, it is a highly sensory environment. LaMonte Young designed a drone for the space that changes based on where you are holding your head, all with physical sound engineering and using no sensors whatsoever. I found that when I left the Dream House, I felt changed.\r\n<Br><Br>\r\nFor this project, I researched topics regarding the relationships between light and sound from both scientific and psychological perspectives, as well as color therapy, specifically color light therapy, or chromotherapy. Last summer, I landed on the Dinshah chromotherapy system, which was developed by Dinshah Ghadiali in 1920. According to this system, each color has a specific therapeutic purpose. I also created a series of experiments using Dinshah’s color to note translation system, which finds correlations between colors and sounds by doing math on their respective frequencies to try to find the closest relationships between them over the electromagnetic spectrum. This was done by dividing the frequency of the color by two 40 times to find the closest frequency of sound. For example, the color red translated to the frequency of around 397 is closest to the musical note G at the frequency of 392. The idea was that using these supporting sounds would support a chromotherapy session with a specific color. \r\n<Br><Br>\r\nI used the Dinshah chromotherapy system as a basis for color and sound pairings which I have since built on, and I prototyped installations leading up to my thesis in the classes Ideation &amp; Prototyping (Tandon), Video Sculpture, The Temporary Expert, The Code Of Music, and NIME, as well as in an unofficial 100 Days Of Making research project.","technical_details":"The installation is run by a laptop with Max MSP which is tracking the shifting frequency or pitch of the participant’s voice then translating it to a synthesized sound at the same pitch and an associated color, then sending midi control changes to Madmapper in order to trigger an array of colors (LEDs), using a frosted wall to diffuse the light. It can be tuned to reflect the user's vocal range, or tuned to an environment to set the lowest and highest pitch across the visible color spectrum.\r\n<Br><Br>\r\nThe installation is constructed inside a small greenhouse shed (4 ft wide x 6 ft long x 7 ft high) with semi-transparent polycarbonate walls. Inside is a chair with a back, a microphone running to an audio interface, and seven 4-foot long LED bars displayed on a trellis behind a 4 x 6 ft sheet of 1/4\" thick acrylic. ","further_reading":"<p>What does it mean to \"get tuned\"?</p>\n<p>Tuning, in music, is when you adjust your instrument’s vibrations to match those of a certain musical scale, for example, tightening or loosening a string through rotating a knob on a guitar.</p>\n<p>Tuning a person means something more akin to meditation. When you are “tuning in” to something you are focusing on it; this is similar to when you focus on something in meditation, or on stillness, or ideally on nothing. I watched a TED talk before I came to ITP in which a monk described how he overcame his inability to focus through deciding to actively practice concentration. He imagined his mind as something similar to a house with many rooms, with a ball of light that traveled from room to room. He described imagining where you are in the present moment as an area in the mind and then bringing the light into that area of the mind. This is something I have been trying to express in my thesis project and through my time at ITP.</p>\n<p><img src=\"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/IMG_0010-1.jpg\" /></p>\n<p><img src=\"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/IMG_0024-1.jpg\" /></p>\n<p><img src=\"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/lucytuninghouse-1.jpg\" /></p>\n<p><img src=\"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/DSC_0323-2.jpg\" /></p>\n<p><img src=\"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/DSC_0330-2.jpg\" /></p>\n<p>&nbsp;</p>\n","tags":[{"name":"Art","slug":"art"},{"name":"Installation","slug":"installation"},{"name":"Meditation","slug":"meditation"},{"name":"Music","slug":"music"},{"name":"Play/Games","slug":"play-games"}],"video_presentation_url":"https://vimeo.com/336825708","video_documentation_url":"https://vimeo.com/camillapc/the-tuning-house","project_url":"http://www.ivymeadows.net/the-tuning-house","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/portrait-1-768x432-1.jpg","title":"portrait-1-768x432","alt":"camilla portrait","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/tuninghouse-1-1024x576.jpg","title":"tuninghouse","alt":"Image of the Tuning House with a light green light and a person inside, taken from a distance and with the door closed","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/tuninghouse-1-1024x576.jpg","title":"tuninghouse","alt":"Image of the Tuning House with a light green light and a person inside, taken from a distance and with the door closed","caption":""}]}