{"student_id":"3","student_name":"Amena Hayat","student_slug":"amena-hayat","advisor_name":"Stefani Bardin","title":"The Language of Silence VR","thesis_statement":"A volumetric documentary with holograms from real Pakistani women, across different socio-economic classes and levels of education, who share their stories of gender disparity in the country. I want to highlight that with a lack of education, the cultural norms get more violent and I hope to promote education for the female child. ","abstract":"In Pakistan, the world’s first Islamic nation to appoint a female head of state, only 13 percent of girls are still in school by ninth grade. The effects of poverty are everywhere, but the country’s dual system of civil and sharia law, enables a cloak of invisibility over those effects which belong a gendered nature, while law enforcement authorities routinely dismiss crimes against women as private disputes. The country’s women's status differs significantly by community - in each sect access to property, education, employment and sometimes basic human rights remains considerably lower compared to men's. As a result of this power imbalance that begins with education or lack thereof, rampant domestic abuse and a high rate of child marriages and forced marriages still remain, young girls are forcibly married off in order to resolve the feuds between different clans, there are 1000 honour killings, 400 acid attacks a year while punishments meted out to the murderers are very lenient. It is important to note that a vast majority of crimes are never reported. Voicing all this is not safe, however, and silence is the norm.<br><br>\r\nI collected stories, anonymously, from women across multiple sects in Pakistani society, who wanted to share them, as themselves or through an actor. These stories highlight the fact that the literacy rate for urban women is more than five times the rate for rural women, and while that helps them gain more rights, the theme of Pakistan's hyper-patriarchal culture remains the same: \r\nگھر کی بات گھر میں\r\n“Ghar ki baat ghar mein”\r\nOr, let the matters of a family stay within the walls.","context_research":"Influenced by the following volumetric films/documentaries/experiences:<br>\r\nBlackout<br>\r\nTerminal 3<br>\r\nZero Days VR<br>\r\nClouds<br>\r\nTzina: symphony of longing<br>\r\nOther influences:<br>\r\nArtwork by Shehzil Malik<br>\r\nTehmina Durrani's My Feudal Lord<br>\r\nKhalida Brohi's I Should Have Honor: A Memoir of Hope and Pride in Pakistan<br>\r\nMaya Angelou's work<br>\r\nChimamanda Adichie's ted talks<br>\r\nSaadat H. Manto's short stories<br>\r\n<br>\r\nBasically researched this topic my whole life. When I saw Terminal 3 however, it gave me a perfect medium to share these stories and create an impact.","technical_details":"The experience contains holograms of women shot with a Kinect calibrated with a DSLR camera, their data streams merged with Depthkit. A green screen studio was set up in my home in Lahore, Pakistan. The scenes were set in Unity, using a special Depthkit plugin, and effects were added to the holograms using special algorithms. The trailer was made on Adobe Premiere, and the soundtrack with Ableton + MIDI.\r\n","further_reading":"","tags":[{"name":"Hologram","slug":"hologram"},{"name":"Narrative/Storytelling","slug":"narrative-storytelling"},{"name":"VR/AR/Immersive","slug":"vr-ar-immersive"}],"video_presentation_url":"https://vimeo.com/336812271","video_documentation_url":"","project_url":"","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Amena-Hayat-photoID-copy-1024x1003.jpg","title":"Amena Hayat photoID copy","alt":"Amena Hayat photoID copy","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/sughra-look-2.jpg","title":"sughra look 2","alt":"sughra look 2","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/sughra-look-1.jpg","title":"sughra look 1","alt":"sughra look 1","caption":""}]}