{"student_id":"31","student_name":"Chengtao Yi","student_slug":"chengtao-yi","advisor_name":"Gregory Shakar","title":"Chengtao designed by Chengtao","thesis_statement":"My Thesis is a life-size replica of my upper body that has multiple functional parts , imagine a human version of Swiss army knife, with my face on it.","abstract":"I am literally making myself. By replicating myself and combining various functionalities with my body parts I tried to investigate the boundary and connections between utilitarian objects, critical sculptures and human bodies. Trying to answer the question: \"What is the ultimate product?” and \"What is the ultimate role for designers?\" <br><br>\r\nThe goal for product design in the modern consumer age has been always about being as friendly and humanistic as possible. Hardware, software are trying to become as intelligent and empathetic as us human. New breakthroughs in artificial intelligence has pushed this idea even more. We might have an ultimate product that can handle all the things at requests, and understands all our orders, even feel what we feel. That make me wonder what if, essentially, all we want to have is just another human that serves us and obeys us unconditionally. Products are becoming humans, and at the same time, we are morphing into products. My thesis is an art installation/sculpture that attempsa to illustrate this state and answer the questions. ","context_research":"Part 1: Major influence, Similar projectsMovie - Swiss Army Man https://www.imdb.com/title/tt4034354/<br>\r\nArtists: Urs Fischer, Tom Sachs, Damian Ortega, Pierre Huyghe, kelly knox, Omkaar Kotediaork<br>\r\n\r\nhttp://kotedia.com/Melting statue replica <br>\r\nhttps://www.vogue.it/en/news/vogue-arts/2017/09/06/interview-urs-fischer-vogue-italia-september-2017/?refresh_ce=\r\n<br>\r\nCosmic Thing<br>\r\nhttps://petrolicious.com/articles/damien-ortega","technical_details":"Production Process:<br>\r\n- The face is produced using Spyder 3D scan technology and then meticulously 3D printed. All colors are embedded in the material. <br>\r\n- Several body parts are casted using silicone and resin. ","further_reading":"<p>A toothbrush knows the health of your teeth. It notifies you when you should brush your teeth and when to stop. It can update all your teeth data to your dentist. And send you warm tips for dental care. It updates itself every week and it is getting smarter day by day. Your toothbrush is your dentist.</p>\n<p>The goal for product design in the modern consumer age has been always about being as friendly and humanistic as possible. Hardware, software，all kinds of services are trying to become as intelligent and empathetic as us human. New breakthrough in artificial intelligence has pushed this idea even more. Computer being just fast is far from enough. Now it has to become us.</p>\n<p>In the future, we might have an ultimate product that can handle all the things at requests, and understands all our orders, even feel what we feel. That make me wonder what if, essentially, all we want to have is just another human servant that serves and obeys us unconditionally. Products are becoming humans, just as humans are becoming products. My thesis goal is trying to investigate this tendency of the idea: “the ultimate product is human”. Trying to explore a new type of tactility for the future of objects.</p>\n<p>And my thesis will also ask the question: “what’s the end goal for designers?” Are designers merely servants of the ever growing consumer culture? Can designers be artists?(Bruno Munari ‘Design as Art’) How can a designer and his idea be present all the time through his work? Or is it totally selfish and unnecessary. The conflict nature (Applied art but not art, engineers but not engineers)the designer resides in is fascinating, and I hope my thesis can address this point.</p>\n","tags":[{"name":"Art","slug":"art"},{"name":"Design","slug":"design"},{"name":"Installation","slug":"installation"},{"name":"Product Design","slug":"product-design"},{"name":"Speculation","slug":"speculation"}],"video_presentation_url":"https://vimeo.com/336825795","video_documentation_url":"https://www.chengtaoyi.com/#/chengtao-designed-by-chengtao/","project_url":"https://www.chengtaoyi.com/#/chengtao-designed-by-chengtao/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/chian.jpg","title":"chian","alt":"chengtao","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/TN-1024x576.jpg","title":"TN","alt":"1","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/91low-1024x576.jpg","title":"91low","alt":"1","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/61low-1024x576.jpg","title":"61low","alt":"chengtao","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/ARCHIVE2-1024x576.jpg","title":"ARCHIVE2","alt":"chengtao arm","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/ARCHIVE4-1024x576.jpg","title":"ARCHIVE4","alt":"chengtao4","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/ARCHIVE5-1024x576.jpg","title":"ARCHIVE5","alt":"ARCHIVE5","caption":""}]}