{"student_id":"32","student_name":"Chengchao Zhu","student_slug":"chengchao-zhu","advisor_name":"Gabriel Barcia-Colombo","title":"Winding Time","thesis_statement":"Is time absolute? Why do people perceive time differently? Is your time the same as mine? Inspired by Einstein’s theory of relativity, Winding Time is an experimental installation that investigates personal time and relative speed. How do speed and movement affect our individual timeline? What're the differences between others' timeline and yours?","abstract":"We think of time as a measurement because of its absoluteness. Consequently, we let time decide our life choices; we encounter endless deadlines; we are busy fighting with time. While Einstein’s theory of relativity has given us a new perspective to consider time as a changing element around us, our perception of time is not only dynamic but personal. People have their personal timelines because of their relative speed to others and different interactions within space.\r\n\r\nWinding Time is an experimental interactive installation trying to visualize how people with different speed have different timelines and how their timelines demonstrate their movements spread in a particular space. What the installation showed could consider as a short recent personal timeline trace which was affected by their movement and speed. \r\n\r\nWinding Time invites people to wind up a clockwork motor to reveal a stretched personal timeline that will be generated on video gradually. People will be able to observe their past timeline and also could compare theirs to others.","context_research":"During my research, I was introduced to Einstein's theory of relativity and learned a new concept - spacetime. In Einstein’s theory, spacetime is a four-dimensional concept where people’s trace would look like a spiral spaghetti. I found this point of view inspiring and started thinking about how to connect people’s movement with time and space in our three- dimensional world in an artistic way. To effectively engage audiences in the installation and help them to concepts of relativity and fluidness of time, I chose the wind-up motor as an input.","technical_details":"Technically, I use a webcam to capture images and always keep the last 1000 frames with a digital time stamp. When people wind up the clockwork motor, the installation will process a certain number of frames depending on how much the motor is winded. The algorithm used to process images is based on slit scan and I’m using PoseNet machine learning to measure individual personal speed. The processed images will be gradually generated over time and projected within the space.","further_reading":"","tags":[{"name":"Art","slug":"art"},{"name":"Experiment","slug":"experiment"},{"name":"Installation","slug":"installation"},{"name":"Machine Learning","slug":"machine-learning"},{"name":"Science","slug":"science"}],"video_presentation_url":"https://vimeo.com/337308723","video_documentation_url":"https://vimeo.com/335302729","project_url":"https://chengchaozz.com/#/winding-time/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/head_shot-768x432-1.jpg","title":"head_shot-768x432","alt":"chengchao headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Thumbnail1-1024x576.jpg","title":"Thumbnail1","alt":"Thumbnail1","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/mainsize44-1024x576.jpg","title":"mainsize44","alt":"44","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/mainsize11-1024x576.jpg","title":"mainsize11","alt":"mainsize11","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/mainsize55-1024x576.jpg","title":"mainsize55","alt":"mainsize55","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/mainsize22-1024x576.jpg","title":"mainsize22","alt":"mainsize22","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/mainsize33-1024x576.jpg","title":"mainsize33","alt":"mainsize33","caption":""}]}