{"student_id":"36","student_name":"Ivy Danxiaomeng Huang","student_slug":"ivy-danxiaomeng-huang","advisor_name":"Kathleen Stevens Wilson","title":"Fisherman's Song","thesis_statement":"Ancient Chinese poetry is a form of art that is imbued with emotion, inexpressive feelings and the heritage of ancient Eastern culture.  \r\nHow can the poetic meaning of ancient Chinese poetry, which transcends literal translation, be conveyed in interactive visual form?\r\n","abstract":"“Fisherman’s Song” is a multidimensional art installation that creates a space for audiences to experience the beautiful story and deep meaning behind an ancient Chinese poem. <br><br>\r\nThis interactive and immersive piece unfolds as users traverse the space.<br><br>\r\nThe selected poem - “Fisherman’s Song” (渔父词) by Zhu Dunru(朱敦儒), describes the poet’s life experience after deciding to quit his life as a dignitary and live a secluded life next in the forest<br><br>\r\nIn the poem, he scorns the greed and desire of people he encountered as a dignitary and expresses his desire for the lifestyle he had always dreamed of, a life connected to nature and the elements. \r\n","context_research":"“Fisherman’s Song” is an interactive art piece that fuses ancient eastern culture with modern technologies, creating an immersive environment that enables users to experience an ancient culture without the feeling of being surrounded by technology.<br><br>\r\n\r\nStylistically, \"Fisherman's Song\" has been Inspired by ancient Chinese ink painting. It visualizes the content and meaning of the poem as a 3D interactive animation with the ink painting style. Combining material and fabric research, I finally decided to use the technique of projection mapping on layers of traditional Chinese fabric - Silk. The transparency of the silk layers creates the illusion of infinite space. The combination of projection, sound, and interactivity to stimulates the audience’s imagination and allows them to experience the poem in a visual way that transcends language. <br><br>\r\nThe ancient Chinese architecture style - Suzhou Garden, inspired me the most with its' unique design principles. First of all, the garden originated from the ancient Chinese intellectuals' desire to harmonize with nature while cultivating their temperament. In addition, the garden contains a series of separate but interconnected parts, to be discovered and enjoyed gradually. The staging design of  \"Fisherman's Song\" use digital visual work tell the story of the poet's life in nature, which is a harmonious fusion between modern technology with nature and ancient culture. In the meantime, Fisherman's Song follows the layout of the Suzhou Garden which allows audiences to have a personal experience and understanding of the poem. \r\n\r\n","technical_details":"The main software I use to create the visual effects and interactivity of the project is TouchDesigner. In order to create a fully immersive experience, I decided to use In-depth camera instead of Kinect, which is physically smaller and invisible in dark. The in-depth tracking of the position of the audience will trigger different visual effects. There is no equipment required for the audience to interact with the visual, which is a fully immersive experience for everyone. \r\nThere are four different projectors involved in the project. I use Map Mapper control each of them projecting different visual effects simultaneously, in order to create the timeline of the story behind the poem. ","further_reading":"<p>Wanna know more about <a href=\"https://www.ivydhuang.com/performance#/fishermans-song/\">Fisherman's song</a> ? Click the link or visit <a href=\"http://www.ivydhuang.com\">Ivy</a>'s website!</p>\n","tags":[{"name":"Art","slug":"art"},{"name":"Culture","slug":"culture"},{"name":"History","slug":"history"},{"name":"Installation","slug":"installation"},{"name":"Visual","slug":"visual"}],"video_presentation_url":"https://vimeo.com/336836286","video_documentation_url":"","project_url":"https://www.ivydhuang.com/performance#/fishermans-song/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/IMG_8063-768x432-1.jpg","title":"IMG_8063-768x432","alt":"ivy","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/YUFUCI-1024x688.png","title":"YUFUCI","alt":"thumbail","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide3-5-1024x576.jpg","title":"slide3","alt":"meimeide222","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide222-1024x576.jpg","title":"slide222","alt":"tdprocess","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide4-4-1024x576.jpg","title":"slide4","alt":"tracking","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide1-2-1024x576.jpg","title":"slide1","alt":"hao!","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide5-3-1024x576.jpg","title":"slide5","alt":"meimeide4","caption":""}]}