{"student_id":"38","student_name":"Dominick Paul Chang","student_slug":"dominick-paul-chang","advisor_name":"Kathleen M Sullivan","title":"Linear Harmony","thesis_statement":"Linear Harmony is an interactive audiovisual installation that prompts exploration and discovery by connecting light, sound, and space through the mechanics of music theory. ","abstract":"Linear Harmony is an interactive audiovisual installation that aims to instill a sense of discovery, using simple forms of sound, light, and space. The piece is initially at rest, and requires input from the viewer in order for it to begin and continue progressing. No instruction is given, other than it is intended for a single user at a time. \r\n<br><br>\r\nInspired by choose-your-own-adventure stories and the concept of multverses, Linear Harmony assigns the twelve notes used in modern Western music to a “timeline”. Each timeline has slightly different rules for how it operates, based on different ideas in musical harmony. These rules dictate what pathways are available. \r\n<br><br>\r\nTwelve points of light will be projected onto the floor at equidistant points along a circle. Each of these points of light represent one of the twelve notes and will be the points of interaction for viewers. Haze will be used so the beams of light are visible in the air. Breaking the beam of light acts as a selection. \r\n<br><br>\r\nThe first selection made from the piece's resting states establishes that specific note as a tonal center and applies that timeline's rules. A four-note chord based on that note is played. Four speakers setup around the projected area allow for the sound to be spatialized as if it is coming from the selected point's direction. Pathways are then drawn to other points along the circle, highlighting other chords that make sense in a functional harmonic progression. This creates strong associations between the spatialization of the sound, the geometry of the light, and the physicality of the space. ","context_research":"I wanted to connect my work in music, lighting, visuals, and interactive installation into a strong conceptual piece that explores building complexity from simple structures and creating intuitive, discoverable interactions. \r\n<br><br>\r\nWhen I began working with lighting, I experimented with using projectors and haze to create aerial and beam effects, as opposed to projecting onto a screen or other surface. I found lighting artists such as Guillaume Marmin, Anthony McCall, and Joanie Lemercier, whose similar use of volumetric projections to create these immersive spaces inspired the aesthetics of this piece.  In terms of conceptual design and sound design, I was inspired by Ryoji Ikeda and Tristan Perich, who use simple components to build complex and beautiful systems.\r\n<br><br>\r\nI wanted to couple this idea of light sculpture with a sonic element, in such a way that the viewer could manipulate and influence the piece. By using concepts in music theory as rules for the piece, I could create a series of interactions based on these guidelines. The visual layout for the notes is the circle of fifths, which is a common concept in music theory. This allowed me to easily create associations between the visual, sonic, and interactive elements of the piece.","technical_details":"Linear Harmony uses a single projector, four speakers, a camera, a computer, haze, and Max/MSP software. A projector is mounted 10-15' high and faced towards the floor. Twelve points of light are projected and haze (fog) is used to so the beams of light are visible in the air. The camera is set up to monitor each point of light. If the beam of light is broken, Max/MSP can detect the change in brightness at that point and activate the appropriate interaction. Four speakers are set up around the projection area to allow for spatialization of sound. ","further_reading":"","tags":[{"name":"Art","slug":"art"},{"name":"Experiment","slug":"experiment"},{"name":"Installation","slug":"installation"},{"name":"Music","slug":"music"},{"name":"Play/Games","slug":"play-games"},{"name":"Sculpture","slug":"sculpture"},{"name":"Sound","slug":"sound"},{"name":"Spatial Audio","slug":"spatial-audio"},{"name":"Visual","slug":"visual"}],"video_presentation_url":"https://vimeo.com/336825868","video_documentation_url":"https://youtu.be/NorhZVCQvh0","project_url":"","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/05/admin-ajax.php_.jpeg","title":"admin-ajax.php","alt":"Dom and Ellena","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Thesis-Cover-1024x576.jpg","title":"Thesis-Cover","alt":"Thesis Cover","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Resting-State.jpg","title":"Resting State","alt":"Resting State","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Kat-Beam-1024x683.jpg","title":"Kat-Beam","alt":"Kat in the beams","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Andy-Beam-683x1024.jpg","title":"Andy-Beam","alt":"Andy Beam","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Shiny-Sequins-1024x683.jpg","title":"Shiny-Sequins","alt":"For the children","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Hand-Beam-1024x576.jpg","title":"Hand Beam","alt":"Hand Beam","caption":""}]}