{"student_id":"4","student_name":"Anthony Bui","student_slug":"anthony-bui","advisor_name":"Nancy Hechinger","title":"Overcoming Play Inertia","thesis_statement":"My goal is to make the listless heart wiggle with joy again. In this effort, I explore imbuing my environment with critical interventions, reimagining objects so that they encourage me to play -- freely, intentionally, and with a renewed sense of urgency.","abstract":"I believe that in our ever-increasing desire to become more efficient adults, we sacrifice our imagination, stop playing, overestimate the time we have, and lose sight of who’s important. Under the guise of self-intervention, I reimagine objects so that they encourage me to play again – freely, intentionally, and with a renewed sense of urgency.\r\n<br><br>\r\nFirst, I explore ways to encourage play in our everyday life. In a suite of “intervention toys”, I imbue everyday adult objects with toyish characteristics. The intent is to create cognitive dissonance between the stoic adult and playful youth within each of us. These “intervention toys” give us doses of small play, opening us up to flow into larger play more easily.\r\n<br><br>\r\nNext, I reimagine our broken social networks, making the case that in giving up our agency to social networks, we lose sight of the people who matter in our lives. I set out to build a tool that helps me connect to the people I want to connect with in my life; a tool that is more a rolodex and less a social network, highlighting intentionality.\r\n<br><br>\r\nLastly, understanding that intentionality requires work — I aim to increase our sense of urgency so that we’re inspired to do that work. Channeling the spirit of memento mori, I challenge us to see time in its entirety, encouraging us to live our lives with more playful tenderness and urgency.\r\n<br><br>\r\nI want to acknowledge that we have to balance our lives: the carpets still need to be vacuumed and the dishes still need to get washed. I’m not suggesting we stop working or neglect our responsibilities. Rather, I want to highlight play as the catalyst to a joyful life. We don’t need it all the time, but we do need it. After all, as Stuart Brown solemnly reminds us, “The opposite of play is not work — it is depression”.\r\n","context_research":"In Play: How it Shapes the Brain, Opens the Imagination, and Invigorates the Soul, Stuart Brown tells us that play is a part of our DNA. Highlighting the evolutionary advantages of play, he claims that “those who missed out on play coudn’t tell friend from foe, misread gestures, got rejected by potential mates, and floundered.”\r\n<br><br>\r\nFurther, Dr. Brown hints at play’s health benefits, describing it as “invigorating, opening” and a deep part of how we create “social connection”. Play’s effects are lasting, giving us a lightness and ease, renewing our natural sense of optimism, and opening us up to new possibilities.\r\n<br><br>\r\nDespite these benefits, adults forget to play. While I’ve lived this first hand, my experience isn’t uncommon. In Play It Away: A Workaholic’s Cure for Anxiety, Charlie Hoehn describes his epiphany at a bar, “participating in the weekly ritual of poisoning myself with alcohol, just so I could have superficial interactions with people I’d probably never see again”, finally admitting that he made the mistake of constantly choosing work over guilt-free play with friends.\r\n<br><br>\r\nWe see this ailment even in fiction. In The Little Prince, Antoine de Saint-Exupéry hints at the decline of playful imagination in adulthood: “Grown-ups love figures… When you tell them you’ve made a new friend they never ask you any questions about essential matters. They never say to you “What does his voice sound like? What games does he love best? Does he collect butterflies?” Instead they demand “How old is he?\"\r\n<br><br>\r\nThere are existing artists in this space. Of note, Carsten Höller, who’s exploratory sculptures include massive slides, describes the perception of fun as “something unintellectual or dirty”, but makes the case that “our attitude to it needs to be revisited.”\r\n<br><br>\r\nOf recent interest, a plethora of articles point out growing millennial ailments: burnout is inevitable because we’re optimizing ourselves to death, we’re more anxious than ever before, and we’re struggling with social isolation and loneliness.\r\n<br><br>\r\nI also research intentionality and urgency in our play lives. Tim Urban, in his visual essay \"The Tail End\", cautions us to choose our connections intentionally, and “not by unconscious inertia.” And Brian Brewington, in his essay \"At Some Point\", beckons us to cherish our moments “for just ten more minutes before going back in.”","technical_details":"Coffee-theque: Teensy, MAX/MSP, Ableton<br>\r\nLossy Moss: Raspberry Pi 3, Touchscreen, p5.js<br>\r\ntwohandtouch.me: React &amp; Firebase<br>\r\nConnective Luminescence: Teensy / Octows2811 / lots of RGB LEDs; powered via the Ethereum blockchain<br>\r\nCollective Obsolescence: Teensy / Octows2811 / lots of RGB LEDs; powered via the Ethereum blockchain<br>","further_reading":"<p>In my past life, before I became the handsome &amp; youthful old man that I am now, I was actually a grumpy adult. I was working as an engineer and my days consisted of the adult activities of work, gym, dinner, and sleep. I wasn’t miserable but rather incredibly, comfortably bored. In this time a lot of mental illnesses started to reveal themselves — I struggled with anxiety, depression, and loneliness.</p>\n<p>As my outlook on life grew pessimistic, I desperately sought answers. I tried pills. I tried exercise. I tried yoga and meditation. I tried long vacations. I tried seemingly everything. It took me a while, but eventually, I found that the best answers started with play.</p>\n<p>In my thesis, I’m interested in rediscovering the playful spirit that is lost as we transition from childhood to adulthood. I believe that in our ever-increasing desire to become more efficient adults, we sacrifice our imagination, stop playing, overestimate the time we have, and lose sight of who’s important.</p>\n<p>My thesis recognizes the importance of play and aims to encourage more of it. Under the guise of self-intervention, I reimagine objects so that they encourage me to play – freely, intentionally, and with a renewed sense of urgency.</p>\n<p>In the first part of my journey, I explore ways to encourage play in our everyday life. In a suite of “intervention toys”, I imbue everyday adult objects with toyish characteristics. The intent is to create cognitive dissonance between the stoic adult and playful youth within each of us. I reason that small acts of play can decrease our “play inertia”. They serve as tiny activations that open us to flow into play more easily.</p>\n<p>In doing so, we soften our adult tendencies and begin to reap the lasting benefits of play, which Stuart Brown summarizes as a lightness and ease, renewing our natural sense of optimism, and opening us up to new possibilities.</p>\n<div>\n<p>COFFEE-THEQUE:</p>\n<p>Coffee has come to be synonymous with the grind of adulthood. Often, we’ll wake up in a rush and even then we’ll make time for a quick coffee, reasoning that coffee is more productive than not-coffee. The differing narratives of coffee are fascinating – $5 lattes signify that you’ve found enough success (in disposable income) to treat yourself, the new performance ritual of stopping to smell the roses; whereas a $1 deli roast symbolizes a knucklescraper attitude, an efficient, no-frills, get-shit-done-and-can-do work ethic.</p>\n<p>Ritualized in adulthood, coffee consumption is an excellent touch point for an intervention. The coffee pourover stand is slow and laborious, but not too slow that you leave it alone the way you would an automatic coffee maker. This makes it an attentive object, and in that time attention I thought… could this also be a musical instrument for tiny doses of playful expression?</p>\n</div>\n<p>Increasing our openness to play is a great start to joyful living, but I also wanted to focus on playing the right way.</p>\n<p>Our social networks are broken, our sense of time is skewed, and the digital innovations that we thought would make us more connected are failing us. As adults, we tend to pick up responsibilities and chase efficiency. In that chase, I find that we give up agency in our social lives. For example, I’ve unconsciously allowed Facebook to be my source of friends’ birthdays and a quick analysis reveals that I’ve wished “Happy Birthday” not to the people I care about most, but instead to the people whose birthdays happen to align with days I choose to check Facebook.</p>\n<p>“Your remaining face time with any person depends largely on where that person falls on your list of life priorities. Make sure this list is set by you—not by unconscious inertia.” – WaitButWhy: The Tail End</p>\n<p>In the second part of my journey, I explore interventions to help us play with the people we actually care about.</p>\n<p>I set out to build a tool that would help me connect to the people I want to connect with in my life; a tool that was more a rolodex, and less a social network. In fact, I don’t want there to be actual connections made through the tool itself because I believe that would then encourage passivity.</p>\n<div>\n<p><a href=\"http://twohandtouch.me/\">TWOHANDTOUCH.ME</a>:<br />\nA Friend Relationship Manager that enables you to record your quality friendships and then encourages you to connect even more.</p>\n<p>Features:</p>\n<ul>\n<li>A simple contact book of people you actually care about. No friend requests needed.</li>\n<li>“Cake Day” birthday tracker – because birthdays are important and they shouldn’t be managed by Facebook.</li>\n<li>An “Office Hours” calendar that lets you set and publicize your available hours to play, easing the coordination to be involved in a friend’s life or give them an opening to be a part of yours.</li>\n<li>A “Touch System” to record connections coupled with a “dumb algorithm” to give you a sense of how many times you will connect with each individual before they are expected to die. A memento mori approach at inspiring urgency and intent.</li>\n</ul>\n<p>The cradle rocks above an abyss, and common sense tells us that our existence is but a brief crack of light between two eternities of darkness.</p>\n</div>\n<p>– Vladimir Nabokov</p>\n<p>Encouraging quality touches with a renewed sense of consciousness is crucial, but intentionality requires work. In the last exploration of my journey, I wanted to truly inspire action by heightening our sense of urgency. I wanted to expand on our false perception of time, thinking again about memento mori. If we can create a cognitive shift and start seeing time in its entirety, perhaps we can live our lives with more playful tenderness and urgency.</p>\n<p>“If only someone had let us know the last time we went out to play, was the last time we’d ever go out to play again, perhaps we would have asked our parents for just ten more minutes before going back in.” – At Some Point</p>\n<div>\n<p>COLLECTIVE OBSOLESCENCE:</p>\n<p>Collective Obsolescence is a light fixture that derives its luminescence from its members, and slowly becomes dimmer as it is neglected. At it’s natural end, when no members are “digitally heartbeating”, it is fully dark and its own existence becomes beautifully obsolete.</p>\n<p>A digital heartbeat is a simple, timestamped check-in to prove that you are alive. After some x amount of time, if no heartbeat has been received, you are considered dead. I’m romanticizing this idea of a digital check-in because I think it’s a minimal, intentional, and powerfully meaningful exertion one can take to assert presence.</p>\n<p>Obsolescence is the process of becoming obsolete or outdated and no longer used. In this exploration I think about obsolescence with regards to community and continue to explore “digital heartbeats” and luminescence as a metaphor for connection. With this visual binding, I hope to create a feeling of urgency to stay involved and even more, keep others involved.</p>\n</div>\n<p>In the end, I want to acknowledge that we have to balance our lives: the carpets still need to be vacuumed and the dishes still need to get washed. I’m not suggesting we stop working or neglect our responsibilities. Rather I want to highlight play as the catalyst to a joyful life. We don’t need it all the time, but we do need it. After all, as Stuart Brown solemnly reminds us, “The opposite of play is not work — it is depression”.</p>\n","tags":[{"name":"Art","slug":"art"},{"name":"Design","slug":"design"},{"name":"Experiment","slug":"experiment"},{"name":"Meditation","slug":"meditation"},{"name":"Memory","slug":"memory"},{"name":"Play/Games","slug":"play-games"},{"name":"Self-care","slug":"self-care"}],"video_presentation_url":"https://vimeo.com/337313562","video_documentation_url":"https://vimeo.com/331512086","project_url":"https://joyrats.com/anthony","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/me-portrait-768x432-1.jpg","title":"me-portrait-768x432","alt":"me-portrait-768x432","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/connective-presence-1024x576.jpg","title":"Connective Luminescence","alt":"Photo of Connective Luminescence project, a grid of LEDs powered by the ethereum blockchain.","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/coffeetheque-1024x768.jpeg","title":"Coffeetheque","alt":"Coffeetheque","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/mossy-digital-photo-1024x768.jpeg","title":"Moldy Digital Photo","alt":"Photo of moldy digital photo project","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/05/connective-luminescence-1024x768.jpeg","title":"connective-luminescence","alt":"Photo of Connective Luminescence project, a grid of LEDs powered by the ethereum blockchain.","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/collective-obsolescence-1024x768.jpeg","title":"Collective Obsolescence","alt":"Photo of Collective Obsolescence, a blockchain-powered community check-in.","caption":""}]}