{"student_id":"40","student_name":"Dongphil Yoo","student_slug":"dongphil-yoo","advisor_name":"Kathleen Stevens Wilson","title":"Redrum: Collaborative Human-AI Toy Design","thesis_statement":"Redrum explores the possibilities of a Human–AI collaborative effort to create an action figure toy. Machine learning techniques have been used to generate a backstory and inspire the visual design of a series of small, 4-inch, collectible toys.","abstract":"How do we incentivize creativity with cutting-edge technology? What creates an environment that optimizes creative output? What if AI could be used to fuel creativity? Since we have entered the golden age of AI, it seems worthwhile to focus on determining how to work together with AI, instead of just focusing on whether AI will overtake us. In my project, Redrum, I have explored the potential for working collaboratively on creative projects, human and computer together, building on the strengths of each.<br><br>\r\n\r\nAs an indie toymaker, I usually start the concept development process with lengthy background research in order to write a short backstory about each action figure and start to envision the look. However, this process often leads me to feel my creative aptitude is impaired because the cognitive load quickly becomes overwhelmed. As a result, I am less likely to seek out novelty and imagination in the creative process. In order to surmount this, I decided to build a creativity support system incorporating machine learning technology into the early stage of design.<br><br>\r\n\r\nThe computer, with its amazing capability to handle repetitive and deterministic activities, can generate endless story passages based on the input of enormous amounts of text data. Since my goal was to create horror action figures, the text I used for input was primarily criminal records, fictional narratives, movie scripts, etc. Together, the computer and I summarized and revised the outputs repeatedly in a tight feedback loop to obtain backstories, many nonsensical, some quite whimsical. Ultimately, I, as the human collaborator, polished the final backstory and used it for the next step – to design and build my action figures.<br><br>\r\n\r\nI hope future collaboration with AI will mentally liberate me to engage in creative pursuits and will amplify my creative potential in ever more productive ways.","context_research":"I first looked at previous creative projects that have used artificial intelligence in the process of art and design, art toy design in particular. I found the New York-based artist Adam Ellis who has created exceptional cartoon characters with machine learning techniques. His working process is similar to mine in terms of making a character from an AI-generated story. I then got down to using several neural network models for text generation.<br><br>\r\n\r\nMore specifically, I started reading the latest machine learning papers to try to better understand the concept behind each model I tried to use and the practical implementations. The main consideration in terms of the AI part was making the text generator as simple and fast as possible with decent text generation models. I focused on acquiring functionality such as summarization, prediction, and determining the sentimental similarity.<br><br>\r\n\r\nLast but not least, for the toy design, I read a couple of books about indie toy design. These books describe the process of toy design and production in detail and gave me a general sense of toy making. Furthermore, I interviewed toy experts through social media, and I got some know-how and insightful feedback - use a putty mold for the small part, a story to tell is the key in toy bootlegging subculture. I chose resin as a default material because it is used conventionally and is easy to deal with as well. I also settled on a 4-inch sized toy since that size is highly collectible in the community.","technical_details":"All the neural text generation models and packages I used worked locally and remotely as well with CLI. I used textgenrnn, pt-voicebox, gensim, gpt-2 and universal sentence encoder for the particular functions. Training my own models was relatively simple and efficient. Serving the trained model on the web to build an interactive application is expected in the near future.<br><br>\r\n\r\nCurrent silicone mold, resin cast, and polymer clay sculpting techniques were used for toy modeling. Each action figure has at least five points of articulations so they are fully poseable. The appearance of collectibles is completed with handmade costumes and accessories.","further_reading":"","tags":[{"name":"Art","slug":"art"},{"name":"Culture","slug":"culture"},{"name":"Machine Learning","slug":"machine-learning"},{"name":"Narrative/Storytelling","slug":"narrative-storytelling"},{"name":"Product Design","slug":"product-design"},{"name":"Sculpture","slug":"sculpture"},{"name":"Toy","slug":"toy"}],"video_presentation_url":"https://vimeo.com/336836340","video_documentation_url":"https://vimeo.com/331474024","project_url":"https://www.dongphilyoo.com/redrum","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/me-768x432-1.jpg","title":"me-768x432","alt":"dongphil headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thumbnail-13-1024x576.jpg","title":"thumbnail","alt":"thumbnail image","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide1-1024x576.jpg","title":"slide1","alt":"slide show image","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide2-2-1024x576.jpg","title":"slide2","alt":"slide show image","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide3-3-1024x576.jpg","title":"slide3","alt":"slide show image","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide4-3-1024x576.jpg","title":"slide4","alt":"slide show image","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide5-2-1024x576.jpg","title":"slide5","alt":"slide show image","caption":""}]}