{"student_id":"42","student_name":"Daniel S Castano","student_slug":"daniel-s-castano","advisor_name":"Kathleen M Sullivan","title":"OSCAR: Create beautiful and responsive graphical user interfaces to control interactive installations","thesis_statement":"Imagine you are a maker who needs the client to trigger something with a touch screen. One button that controls a video, sound, light or a whole experience. If you are not a coder, the solution is to hire a developer who will make an entire app just to display a custom button with the logo or image that you want. OSCAR is a GUI creator to control interactive installations without coding, making this process faster, cheaper and scalable.","abstract":"With the rise of the capacitive screens market since 2007 due to the arrival of smartphones, many products, and their uses have changed. We are now used to press virtual buttons and slide virtual faders on touchscreens that control features on our computers, thermostats, media players, and more.<br><br>\r\nVirtual interfaces have increased in number in the last 10 years, evolving, and generating specialized concepts and roles we didn’t consider before, as UI/UX design, responsiveness, and front-development. Also, multiple tools have been designed to facilitate their design and implementation, spreading their use across industries.<br><br>\r\nMuseums, galleries, AV companies, and marketing agencies are implementing more multimedia installations to communicate concepts in engaging ways to their audiences. Many of these interactive installations have decided to rely on touchscreens to display and trigger their content, asking for the user to include their input to control the outcome and personalize the experience.\r\n<br><br>\r\nHowever, the process to create one of these interfaces of control is still complicated even if it is a simple button with an image, and not many people are able to implement it. Let’s take for example:\r\n<br>\r\nImagine you are part of an exhibit design company. You and your team are in charge of designing a piece to explain the states of matter to children. You have three animations explaining the concepts and just one screen to display the content. You want the kids to control what they watch and allow them to participate actively in the installation. Your team is able to manage the video clips but the problem comes when you have to design a friendly graphical interface for the children to trigger the videos they want to play. In the current industry, this interface would have to be outsourced no matter how simple it is, because it will require producers, designers, and developers.<br><br>\r\nOSCAR is intended to simplify the process of implementation of these interfaces for end users, in this case, children and visitors.","context_research":"Some examples of these touch interfaces and installations are:<br><br>\r\nZaha Hadar sales gallery by HUSH:<br>\r\nThe possible buyers are called to use an app to navigate the sales gallery and its products. The buyer or host triggers different videos and light on an architectural model to display what apartment they are visualizing.<br><br>\r\nColombia Pavilion at EXPO MILANO 2015 by Sonic Design:<br>\r\nThe pavilion used touch screens to trigger videos and control video games around the theme \"Thermal floors\"<br><br>\r\nPNC Beacon by AV&amp;C:<br>\r\nThe tower and its installation implemented an iPad with a beautiful interface to control and trigger the illumination cues on the interactive cylinder. This app was used just for the client who was in backstage taking care of the light environment.<br><br>\r\n\r\nNote that there are several systems involved in the experiences. There are sound, lighting, video systems and software elements that are talking and synchronizing between each other depending on the user interaction. The high-end industry uses specialized software and hardware to run their installations, meanwhile, the low-end and little exhibition producers rely on open source and rapid-prototyping tools.\r\n<br><br>\r\nSpecialized tools:<br>\r\nPandoras box / Desguise for Video management<br>\r\nAbleton Live for Audio control<br>\r\nDMX consoles for Light programming\r\n<br><br>\r\nOpen source tools:<br>\r\nProcessing/openFrameworks for visual programming<br>\r\nReaper for Audio Control<br>\r\nPure Data for visual programming<br><br>\r\n\r\nFortunately, most of these tools were designed to work with more applications at the same time and they are open to being controlled by well-documented protocols such as MIDI, OSC, KEYBOARD, Serial, TCP/UDP, and more.\r\n<br><br>\r\nThere are some companies and products designed to control this type of installations. TouchOSC, Lemur, OSC Open Stage Control are some of the tools you can find to implement interfaces of control over OSC to drive this exhibits. However, all these tools come with a built-in style that limits customization. On the other hand, most of them are not multiplatform and are not able to communicate with multiple devices at the same time. These features weren’t included because these tools were designed for another target: people interested in controlling an exhibit from the backstage.\r\n<br><br>\r\nHowever, if the exhibition needs to deliver control to the final users at the front stage, it has to implement beautiful and intuitive interfaces for them to control. This is the identified problem and opportunity of design.\r\n","technical_details":"OSCAR is a web editor with communication capabilities over the network. This way we take advantage of web technologies to create multi-platform, responsive and dynamic content. Almost like web page editors like Wix, or Squarespace, OSCAR can implement templates to build beautiful appealing menus that invite the user to scroll and navigate meanwhile controls something else.\r\n<br><br>\r\nOn the other hand, OSCAR uses OSC (Open Sound Control) messages to communicate with external devices or software over the same network. This protocol is well documented and has been implemented in several creative software such as Resolume Arena, Ableton, Pandoras box, Desguise, TouchDesigner, Processing, MAX, PureData, etc.\r\n","further_reading":"","tags":[{"name":"Business","slug":"business"},{"name":"Data","slug":"data"},{"name":"Design","slug":"design"},{"name":"Installation","slug":"installation"},{"name":"Networks","slug":"networks"},{"name":"Product Design","slug":"product-design"},{"name":"Software","slug":"software"},{"name":"Tool","slug":"tool"},{"name":"Visual","slug":"visual"}],"video_presentation_url":"https://vimeo.com/336825916","video_documentation_url":"https://trafalmejo.github.io/OSCar/","project_url":"https://trafalmejo.github.io/OSCar/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/2H6A9781-768x512-1.jpg","title":"2H6A9781-768x512","alt":"daniel headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thumbnailImage-1-1024x576.png","title":"OSCAR thumbnail Image","alt":"OSCAR logo. Friendly jellyfish","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/OSCAR-fruit-1024x576.jpg","title":"OSCAR fruit","alt":"Interface designed with OSCAR","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/sending-OSC-to-TouchDesigner-1024x576.jpg","title":"Send OSC to TD","alt":"Sending OSC to TouchDesigner","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/EditMode-1024x500.jpg","title":"EditMode","alt":"OSCAR in edit mode","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/bananaTouch-1024x573.jpg","title":"live Setup","alt":"GUI designed by OSCAR in live setup","caption":"OSCAR is controlling MADMAPPER to trigger different videos with a simple press"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/workshop-1024x683.jpg","title":"OSCAR Workshop","alt":"Workshops about OSCAR and OSC communication","caption":""}]}