{"student_id":"44","student_name":"Elizabeth Ferguson","student_slug":"elizabeth-ferguson","advisor_name":"Kathleen Stevens Wilson","title":"SpeakOut","thesis_statement":"SpeakOut is a protest tool that uses the devices we already have in our pockets. One person speaks into their smartphone, and others can receive and amplify that live audio over a wider space. SpeakOut is a web app that runs in the browser, with no need to download a native app.","abstract":"Origin Story<br><br>\r\nSpeakOut is an answer to a question I asked a year ago. I was at a protest where a group of us could not hear the speeches being given to the crowd.  I wondered: how might protesters amplify speeches themselves with the devices we already have, and in the process hear better and be more empowered? <br><br>\r\n\r\nImmediate Use Case<br><br>\r\nI built SpeakOut to be tested in a tight use case with Transportation Alternatives, a New York City advocacy group for safer streets for cyclists, pedestrians and public transit.  \r\n<br><br>\r\nOn a rainy Sunday in March, TransAlt members and I tested SpeakOut at a rally to #FinishQueensBlvd in Queens. In a crowd of 50, people gave speeches into a smartphone on a mic stand that streamed live audio using the SpeakOut web app in the browser. Slowly, a light echo of amplification accumulated in the air as five to ten people chose to amplify that live audio with their smartphones, surrounding the crowd in the message of the speakers. \r\n<br><br>\r\nNext Steps<br><br>\r\nI am now in a place where I wonder what role SpeakOut can play in the organization of social movements, and what my perspective is on ethical or moral technology. \r\n<br><br>\r\nCan a web app similar to SpeakOut give people options to take action after a protest, therefore facilitating the growth and persistence of long-term group structures?<br><br>\r\n\r\nWhat does it mean to build ethical requirements into design, so that there is a coherence between the project’s goals, chosen materials, affordances, and consequences in the world? <br><br>\r\n\r\nIs design even a strong enough tool on its own, or what other frameworks, such as corporate structures, legislation and policy, need to be in place to limit harm and protect rights?","context_research":"As I conducted design research and read relevant books and articles, I learned two major things that influenced SpeakOut’s design and my thoughts on its potential impact.<br><br>\r\n\r\nDesign Research<br><br>\r\nFirst, SpeakOut’s interaction design needed to match the temporary group structure of the rally, and not necessarily the more flat structure of the group running it. For example, rallies are strategized events with pre-decided roles, physical placement and coordination with press and police. Understandably, my partners at TransAlt did not want listeners to see the speak button to make it harder for another well-intentioned or rogue broadcast to disrupt plans. They also did not want to share out the listen page’s URL until the event began, so that people attended the rally and did not stay at home to listen remotely. These conversations shaped the design of the web app.<br><br>\r\n\r\nContext Research<br><br>\r\nSecond, my readings reminded me that the U.S. constitution protects citizen activists’ rights to public assembly and free speech. Yet digital actions can still be targeted by surveillance deployed by powerholders or adversaries. The most useful reading was Zeynep Tufekci’s book Twitter and Tear Gas about technology and social movements. As Tufekci writes: “People make technology, but technology also has structuring power.” What structuring power does SpeakOut’s technology have on people who use it, and what unintended consequences might there be?<br><br>\r\n\r\nThis question has driven me to seek out examples of frameworks for ethical technology, potentially build my own, and begin to test the implementation of them.","technical_details":"Software<br>\r\n+ WebRTC, an open project for real time communication in the browser.<br>\r\n+ Sockets, a framework for real-time client and server communication.<br>\r\n+ Javascript, HTML, CSS, coding languages to add dynamic behavior, structure and styling to webpages.<br>\r\n+ Node.js, a coding environment that allows server-side javascript.<br>\r\n+ Open Source code by Muaz Khan written for WebRTC applications<br>\r\n<br>\r\nHardware<br>\r\n+ Smartphones<br>\r\n+ Mic stand to hold speaker’s smartphone<br>\r\n+ Groups can provide their own burner phones, bluetooth speaker sets, etc. to make the tool fit within their strategy and needs.<br>","further_reading":"<p>User Testing</p>\n<p>The live test with TransAlt demonstrated that SpeakOut successfully offers a solution to the problem it set out to solve: not being able to hear speeches at protests. At regular protests without a sound system, people beyond the first couple rows often cannot hear speeches. With SpeakOut, people can amplify the speech themselves using the devices in our pockets. People I spoke with could vividly remember attending protests where they could not hear speeches, and agreed this tool would solve this problem.</p>\n<p>Granted, a portion of speakers commented that the echo was disorienting. This could be resolved by asking that people near the speaker not use the web app, and this instruction is now in the onboarding copy in the web app. In addition, some listeners could not stream the live audio due to limited data connectivity. With a data hotspot or private wifi network, more people in the future could stream the audio.</p>\n<p>One protest attendee even said that “the echo made the event feel special. Like something was happening.” To me, this suggests that SpeakOut can contribute positively to the energy and mood of protests. People go to protests for many reasons, among them being the desire for camaraderie and connection. The surrounding echo of SpeakOut could enhance these group benefits, and be provided by groups themselves, no less.</p>\n<p>Future Phases</p>\n<p>Technology and Social Movements</p>\n<p>Technology has changed what social movements mean today. According to Zeynep Tufekci, today’s marches and protests do not signify the same power as they did before digital tools. Now, large protests can come together quickly thanks to social media, but their significance to a larger social movement is still being defined. Said simply, not everyone who shows up to a protest is part of the group organizing the protest and plans to take actions on the issue afterwards. Could a sister tool to SpeakOut allow people to sign up for more actions after a protest, or stay in touch with each other?</p>\n<p>Ethical Technology Frameworks</p>\n<p>The more I became attuned to the design requirements for SpeakOut, the more I found a tension between needs for publicity and privacy. For example, protests intend to be public and attract attention. Therefore it should be easy to share the web app’s live audio. However, activists in disempowered contexts or practicing disruptive tactics can be surveilled when using digital tools - therefore creating an opposing need for privacy and obfuscation.</p>\n<p>This tension made its way into the structure and affordances of the app. On one hand, using the browser and smartphones makes it easy to use SpeakOut and share live audio with others. On the other, SpeakOut does not ask for a phone number or log on information and does not use cookies or trackers, therefore not saving any data on users that could be found. Lastly, SpeakOut also uses HTTPS for a more secure connection.</p>\n<p>In this next phase of my thesis, this confluence of real people’s needs made me wonder what kind of framework I can use to design SpeakOut. At ITP, there is the start of a Tech + Society club at which the phrase “ethical tech” is used often.</p>\n<p>I have used this lens to begin searching for frameworks. I am most interested in principles that can actually be practiced day to day, and change as they are tested in real life.</p>\n<p>I also want a way to check for coherence between a product or work and its infrastructures, materials, affordances, and impacts on people and the environment. The alternative is a disconnect that suggests insincerity or even hypocrisy. A parallel would be: how can a food label say it is good for you if the nutrition facts show questionable ingredients, it was shipped on an airplane, picked by people who can’t unionize, and came from land converted from forests to now unusable fields?  Maybe we should get better at knowing not just where our food comes from, but where our technology comes from.</p>\n<p>In addition, I would want a product’s technology to be explainable and understandable to the extent that regular people can decide whether and how to use it, and lawmakers can write and pass laws that sensibly limit and enable technology.</p>\n<p>Of course, it is possible for well-intended goals to conflict with one another, or it is impossible to work within an ideal situation. But adding systems thinking into existing frameworks such as human centered design, art practices, or business plans would be of use both makers and users.</p>\n<p>To this end, the best framework in the United States that I have found so far are the <a href=\"https://www.w3.org/TR/UNDERSTANDING-WCAG20/intro.html#introduction-fourprincs-head\">Web Accessibility Principles</a> put forth by the Web Wide Web’s Consortium’s Web Content Accessibility Guidelines. The four principles ensure that the web is Perceivable, Operable, Understandable, and Robust for people who are low-vision or non-sighted.  To me, these principles could be applied to many applications of technologies we use today, not just the internet. Also, it’s the law. I look forward to exploring frameworks in European countries and elsewhere.</p>\n","tags":[{"name":"Mobile","slug":"mobile"},{"name":"Networks","slug":"networks"},{"name":"Privacy/Security","slug":"privacy-security"},{"name":"Product Design","slug":"product-design"},{"name":"Social Good/Activism","slug":"social-good-activism"}],"video_presentation_url":"https://vimeo.com/336836393","video_documentation_url":"https://www.youtube.com/watch?v=IU4wfKYcPqQ&t=","project_url":"https://www.elizabethjeaneferguson.com/speakout","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/ProfilePic69ratio-768x432-1.jpg","title":"ProfilePic69ratio-768x432","alt":"elizabeth headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/GroupPhoto3-1024x576.jpg","title":"Demo of SpeakOut at Transportation Alternatives Rally","alt":"Demo of SpeakOut at Transportation Alternatives Rally","caption":"Demo of SpeakOut at Transportation Alternatives Rally"},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/speakouthomepage2-2-1024x576.png","title":"SpeakOut web app","alt":"Picture of SpeakOut web app","caption":"SpeakOut"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/DemoTransAltRally23ratio-1024x683.jpg","title":"Demo of SpeakOut at TransAlt Rally","alt":"A crowd of people at a rally test SpeakOut","caption":"Demo of SpeakOut at TransAlt Rally"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/UserTestingJuanRestrepo23ratio-1024x683.jpg","title":"UserTestingJuanRestrepo23ratio","alt":"User Testing with TransAlt organizer, Juan Restrepo","caption":"User Testing with TransAlt organizer, Juan Restrepo"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/UserTestingTransAltMeeting23ratio-1024x682.jpg","title":"UserTestingTransAltMeeting23ratio","alt":"User Testing at TransAlt Queens Committee Meeting","caption":"User Testing at TransAlt Queens Committee Meeting"}]}