{"student_id":"45","student_name":"Ellen Nickles","student_slug":"ellen-nickles","advisor_name":"Gabriel Barcia-Colombo","title":"Gotcha! Sincere Competitive Chitchat","thesis_statement":"Ever wanted to win a conversation? Here's a game to keep score!","abstract":"This is a party game in which players try to sneak secret words into a discussion without getting caught. It’s like an icebreaker but with a competitive twist: you win points by hiding specific words in your responses or by catching your fellow opponents in the act.  \r\n<br><br>\r\nThe game challenges you to productively converse with others--to listen and to contribute--all the while planning how to surreptitiously work in your words. But how can you talk naturally if you’re suspicious of others’ word choices and vice versa? Sneakiness and constant questioning defies the implicit rules of cooperation in a conversation. To win you must manage these opposing goals and conceal your words within the context of constructively moving the dialogue forward. \r\n","context_research":"There are many ways to play! In one version of the game, the round begins with a prompt to direct the conversation: players choose from either a hypothetical, a debate topic, or a personal experience question. Each player then draws one card with a secret word to keep until they use it in a response. Snuck words are placed face down within a certain amount of time after they are spoken to indicate a play. Players call gotcha on each other by naming suspect words out loud. Don’t get caught or correctly guess others’ words to win points.\r\n<br><br>\r\nTo develop the game, I researched traditional icebreakers as well as word games from the mid-1800s to the present that incorporate guessing, bluffing, narrative, and role playing. It’s a little like Taboo in that players guess words and gain points from successful attempts. It also overlaps with Balderdash considering that players’ contributions need to sound convincing especially if they were completely fabricated to slip in words. Unlike both of those games, however, this one finds structure in the familiar back and forth of everyday dialogue. \r\n<br><br>\r\nThe mechanics and content emerged through iterative design and multiple playtests with a range of people including old friends, new pals, acquaintances, complete strangers, other game developers, avid game players, folks not particularly interested in playing, repeat players of the game, members of the same family, high school students, retirees, and everyone in between, and in a variety of settings such as game developer events, classrooms, homes, and bars. Through this process, I discovered that this game appeals to several audiences for different reasons: family and friends play to enjoy their company at home or at a social venue, party guests play this game to get to know each other in unexpected ways, and native and non-native English-language learners play to practice their vocabulary at home or at school.\r\n<br><br>\r\nThis game is for all the many talented storytellers in my life. Originally inspired by Word Sneak on The Tonight Show Starring Jimmy Fallon, I created this version for us to share old stories, invent new ones, and laugh a lot along the way. ","technical_details":"","further_reading":"","tags":[{"name":"Design","slug":"design"},{"name":"Education","slug":"education"},{"name":"Narrative/Storytelling","slug":"narrative-storytelling"},{"name":"Play/Games","slug":"play-games"}],"video_presentation_url":"https://vimeo.com/337308893","video_documentation_url":"","project_url":"https://ellennickles.site/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thesisJournalApr2019-199x300-1.jpg","title":"thesisJournalApr2019-199x300","alt":"ellen headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/3_image_1280_720_thumbnail-1024x576.jpg","title":"3_image_1280_720_thumbnail","alt":"gotcha game!","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/3_image_1080_1920_slideshow-1024x576.jpg","title":"3_image_1080_1920_slideshow","alt":"gotcha! sincere competitive chitcat","caption":""}]}