{"student_id":"47","student_name":"Erin Cooney","student_slug":"erin-cooney","advisor_name":"Stefani Bardin","title":"Podscape","thesis_statement":"“Podscape” is a story/processing network, consisting of a system of pods that represent stories from plants, animals, humans, fungus and things, set in the Capital/Anthropocene. They are a collection from humans that were co-created with nonhumans via a workshop ritual.  The co-creation between human and nonhuman manifests in a machine-learning model trained on extinct bird sounds. All these elements contribute to an audio-sensory and interactive installation.","abstract":"             Podscape co-creators participate in a workshop ritual “Embodied Storytelling/’Nature’ Portal”, that generates pod stories and simultaneously creates the world communally. Participants create stories through somatic exercises that attune participants to non-dominant forms of sensing/information receiving from nonhumans, accompanied with writing exercises. The workshop looks at the binary of fiction &amp; non-fiction, natureculture divide, animism, perspectivism, nonhuman communication and vital materiality. Additionally, the ritual is a reproducible experience that can exist separately from the podscape. \r\n<br><br>\r\n            I’m also training a machine learning model trained on collected extinct bird recordings using WaveGAN. WaveGAN is a machine learning algorithm which learns to generate raw audio waveforms. This is a celebrating their existence along with mourning their extinction. The model explores the queering of dead and living, a liminal chimera of species that normally wouldn’t interact in close physical proximity. It interacts with something “dead” regeneratively. \r\n","context_research":"           My thesis is situated in art and spiritual praxis, and research theorizing our current state in the Anthropo/Capitalocene, a vast and varied experience. This project examines multispecies worldings and explores perceived binaries of: nature &amp; culture, human &amp; nonhuman, organism &amp; machine, fiction &amp; non-fiction speaking to the western experience I grew up in, and the body as non-linear archive.<br><br>\r\nMy research includes authors whose work explores the decentering of human exceptionalism, with an emphasis on multi-species entanglements and re-thinkings of the hyper-segmentation of human and nonhumans inherent in capitalism. Although some of my research includes thinkers that work within the institution of academia and therefore participate in a western legacy, their inquiries engage with decolonization, namely, Donna Haraway, Kim TallBear, Anna Tsing, Karen Barad and Jane Bennett amongst many. <br><br>\r\n         I’m influenced by speculative fiction for its ability to hold space for non-dominant voices. I see the workshop as a potential compositional healing vehicle via tuning into the body using various somatic exercises. The energetic temporality of the body is a nonlinear archive. Aside from the linear aging process, experiences of past and future are compressed into the present that can be accessed in various ways, similar to temporalities of stories. Inspiring work in these veins are: Octavia Butler, Ursula K Le Guin, CAConrad, Alexis Pauline Gumbs, Eliza Swann, Laura Stinger, Edgar Fabian Frias, Iele Paloumpis, Pauline Oliveros, Ruth Zaporah, PsychoMagic and work I’ve done with various healers.\r\n","technical_details":"The installation consisted of pods representing the material we worked with during two workshops including but not limited to: homemade bioplastic, ecopoxy, discarded communication hardware (pagers &amp; old cell phones), rocks, fungus, plants. I plan to continue the project and running the workshop in different iterations and make a zine that is part instructional, part sharing the stories.  I collected extinct bird recordings from databases globally, but mostly from Macaulay Library at Cornell. None of the data bases had an extinct animal search feature, so I had to research birds that went extinct after audio recording technology was available and compare those lists to the databases. I trained the extinct bird sound generator using Chris Donahue’s WaveGAN, running it on Google Colaboratory and monitoring it with TensorBoard.\r\n","further_reading":"<p>See further writing and documentation on project website</p>\n<p>Theorists: Donna Haraway, Kim TallBear, Anna Tsing, Karen Barad, Mel Chen, Eduardo Viveiro de Castro, Rosi Braidotti, Cary Wolfe, Jane Bennett and Timothy Morton.</p>\n<p>Inspiring work: Octavia Butler, Ursula K Le Guin, CAConrad, Alexis Pauline Gumbs, Eliza Swann, Laura Stinger, Edgar Fabian Frias, Iele Paloumpis, Pauline Oliveros, Ruth Zaporah, PsychoMagic and work I’ve done with various healers.</p>\n","tags":[{"name":"Art","slug":"art"},{"name":"Machine Learning","slug":"machine-learning"},{"name":"Narrative/Storytelling","slug":"narrative-storytelling"},{"name":"social practice","slug":"social-practice"},{"name":"Speculation","slug":"speculation"}],"video_presentation_url":"https://vimeo.com/336814705","video_documentation_url":"https://vimeo.com/335303739","project_url":"www.hystericascetic.com","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/admin-ajax.jpeg","title":"admin-ajax","alt":"erin headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/podmap-bare-1024x576.jpg","title":"podmap bare","alt":"pod illustration","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Untitled-3-1024x576.jpg","title":"Untitled-3","alt":"workshop","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/workshop1-1024x576.jpg","title":"workshop1","alt":"workshop photo","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/workshop2-1024x576.jpg","title":"workshop2","alt":"workshop photo","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/molly-1024x576.jpg","title":"molly","alt":"installation","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/close-up-1024x576.jpg","title":"close up","alt":"materials","caption":""}]}