{"student_id":"48","student_name":"Fanni Katalin Fazakas","student_slug":"fanni-katalin-fazakas","advisor_name":"Adaora Udoji","title":"Jamie &amp; Jamie","thesis_statement":"“Jamie &amp; Jamie” is an exploration of gender dynamics through transforming a traditional shooting game in VR into a mission to complete a domestic task. Two players are armed with an iron against a flying barrage of dirty clothes and must work together to get the house in order. \r\n","abstract":"“Jamie &amp; Jamie” is a whimsical, multiplayer VR game based on stories collected from a wide range of New Yorkers about their personal experiences of gender roles, pay gap and domestic work. The game invites people of all genders to do laundry together in a bizarre virtual setting. Subverting the typical shooting game format, participants are instead armed with an iron as a “gun”, and clothes as their “targets”. The game itself is rigged to allocate more points for one of the players, ultimately encouraging collaboration in order to complete the challenge. <br><br>\r\n\r\nI grew up in Budapest, Hungary where everyone I know in their 20’s, including myself, is married. I am, by Hungarian standards, considered quite lucky for having a “progressive” husband who shares household duties equally with me. In fact, my childhood was also unique in that I grew up in a family where my mother worked and my father took on the bulk of homemaking and childcare duties. Yet, even in the privilege of my own relatively equal marriage and upbringing, the issues around feminism and gender dynamics is a difficult conversation to be had.<br><br>\r\n\r\nI decided to focus on domestic chores, and specifically the task of ironing because to me, it is a concrete representation of gender dynamics within relationships and behind closed doors. Through conducting interviews in Washington Square Park with over 50 people, I realized that the topic of ironing naturally brought into question gender roles around the task. \r\n\r\nI investigated how and which technology would facilitate an experience that might encourage participation across all genders. Since video games are typically a familiar format for male players, I juxtaposed the medium with a historically feminine task in order to bring up a heavy subject in a playful way. <br><br>\r\n\r\nThrough the multiplayer experience, I hope to spark inclusive conversations that affect both Eastern Europeans and New Yorkers alike and encourage participants to reconsider their own association and approach to everyday responsibilities.\r\n","context_research":"As part of my research, I investigated how feminist artists used their art practice to draw attention to the problems women were facing in their times. The idea behind the “Manifesto for Maintenance Art” by Mierle Laderman Ukeles heavily affected the series of experiments I was doing in public spaces. Similarly to Ukeles, I was bringing daily housework to the streets while I was wearing a VR headset. After the performance, I invited people to join me and share their own experiences, which later served as a base of the VR game. Tom Finkelpearl’s book - “What We Made: Conversations on Art and Social Cooperation” - gave me a solid understanding of the history of collaborative art practice, which helped me integrate my collection of interviews into the game.\r\nDesigning the experience in a way that doesn’t make men feel attacked or blamed was very important for me. I started this part of the research by looking at the HeForShe campaign where men are not only treated as part of the conversation on gender equality but as the solution itself. Following this approach, I built up the structure of the game so that while it starts as a competition between the two players, they can win only by collectively coming up with a solution. \r\nAdditionally, I wanted to make the experience accessible to the general public. A majority of VR experiences are only within reach for festival-going audiences. I was inspired by the format of “Tidal Wave” by MarshMallowLaserFeast, which is a VR installation located outdoors. Since my interviews and content were sourced on the streets of New York, I am showcasing the final project at its origin, in Washington Square Park. I’m in contact with each person I interviewed, as they will receive personal invites to the “premiere”. \r\n","technical_details":"During the game, two players are both wearing a VR headset and holding a custom-built controller in the shape of an iron. They can be located in two different physical spaces while seeing each other’s avatars in a shared virtual laundry room space. I tested two multiplayer platforms (Proteus and UE4) on Oculus Home and also on LAN. I designed all assets in Maya and built the game itself using Unreal Engine 4.21. For the controller, I fabricated an actual iron into which I hid an Oculus Touch controller, which also appears in the virtual space with special features.","further_reading":"<p>https://www.youtube.com/watch?v=zcggaR5It4U</p>\n<p>INSPIRATION FROM OTHER FEMINIST ARTISTS</p>\n<p>Suzanne Lacy :: <a href=\"http://www.suzannelacy.com/early-works#/storying-rape/\">ALL WORKS  </a></p>\n<p>Mierle Laderman Ukeles :: <a href=\"https://hyperallergic.com/355255/how-mierle-laderman-ukeles-turned-maintenance-work-into-art/\">“Manifesto For Maintenance Art”</a></p>\n<p>Judy Chicago ::  <a href=\"http://www.womanhouse.net/\">\"Womanhouse\" </a></p>\n<p>READINGS</p>\n<p>Rebecca Solnit - <a href=\"https://www.guernicamag.com/rebecca-solnit-men-explain-things-to-me/\">“Men explain things to me”</a></p>\n<p>Tom Finkelpearl - <a href=\"https://read.dukeupress.edu/books/book/2210/What-We-MadeConversations-on-Art-and-Social\">“What We Made: Conversations on Art and Social Cooperation”</a></p>\n<p>Maggie Andrews, Janis Lomas - <a href=\"https://www.scribd.com/book/386925590/A-History-of-Women-in-100-Objects\">“A History of Women in 100 Objects”</a></p>\n<p>Peter Rubin - <a href=\"http://ptrrbn.com/book/\">“Future Presence”</a> -  “How Virtual Reality is changing human connection”</p>\n<p>VISUAL STYLE</p>\n<p>Jakob Steensen :: <a href=\"http://www.jakobsteensen.com/#/reanimated/\">“Re-animated”</a></p>\n<p>WeareAnagram :: <a href=\"https://www.idfa.nl/en/film/a55fd9a8-7c57-4af8-beb3-1cd4d3e00197/the-collider-chapter-one\">\"The Collider\"</a></p>\n<p>MarshmallowLaserFeast :: <a href=\"https://www.youtube.com/watch?v=D9ddQm-yauM\">\"Colossal Wave\"</a></p>\n<p>TenderClaws :: <a href=\"https://tenderclaws.com/vvr\">\"Virtual Virtual Reality\"</a></p>\n<p>SPECIAL THANKS</p>\n<p>Daniel Benyi</p>\n<p>Todd Bryant</p>\n<p>Adaora Udoji</p>\n<p>Mathieu Beaulieu - Proteus</p>\n<p>Melinda Miklós - WeAreOpen, Hungary</p>\n<p>Sarah Rothberg</p>\n<p>Vincent Warmerdam</p>\n","tags":[{"name":"Justice","slug":"justice"},{"name":"Narrative/Storytelling","slug":"narrative-storytelling"},{"name":"Performance","slug":"performance"},{"name":"social practice","slug":"social-practice"},{"name":"VR/AR/Immersive","slug":"vr-ar-immersive"}],"video_presentation_url":"https://vimeo.com/336814726","video_documentation_url":"https://vimeo.com/331455667","project_url":"https://rumexinaction.com/immersive#/jamie-and-ja/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thesis_profile_fannifazakas-768x432-1.jpg","title":"thesis_profile_fannifazakas-768x432","alt":"fanni headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thesis_thumbnail-1024x576.jpg","title":"Jamie &amp; Jamie the fight of the irons","alt":"Jamie & Jamie the fight of the irons","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thesis_slide1-1024x576.jpg","title":"Unreal Engine - Virtual Laundry Room","alt":"3D Environment - Laundry Room","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thesis_slide_new1small-1024x576.jpg","title":"Jamie &amp; Jamie - controller settings and interaction design","alt":"physical and virtual settings. controllers and their mappings in vr","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thesis_slide5-1024x576.jpg","title":"Jamie &amp; Jamie Custom Made Oculus Controller","alt":"Jamie & Jamie Custom Made Oculus Controller built into an actual iron","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thesis_slide_new2-1024x576.jpg","title":"Outdoor VR session","alt":"All together 32 people tried out my Thesis on Washington Square Park.","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thesis_slide_new3-1024x576.jpg","title":"ironing board with two Oculus Rifts set up on it","alt":"ironing board with two Oculus Rifts set up on it","caption":""}]}