{"student_id":"5","student_name":"Assel Dmitriyeva","student_slug":"assel-dmitriyeva","advisor_name":"Stefani Bardin","title":"ML for Social Good: Pedestrian Movement","thesis_statement":"The purpose of this study is to model pedestrian movement on microlevel. In Social Sciences, where particles treated as individual agents, numerous attempts have been done to build Agent Based Models. I am interested in investigating underlying behavioral rules that pedestrians follow. Ultimate goal is to conduct empirical research of pedestrian movement on and near intersections in Downtown Brooklyn area. ","abstract":"Empirical study on human crowd movement have started over 50 years ago. But the field of pedestrian movement on intersections have not been studied extensively. With the rise of technologies such as Connected and Autonomous vehicles, IoT and Smart cities it is essential to build models of pedestrian movement and increase safety in urban areas. ","context_research":"Simulation modeling of pedestrian movement can solve real-world problems safely and efficiently. Inspecting processes and interacting with simulation model in action builds both understanding and trust. Empirical study on human crowd movement have started over 50 years ago. But the field of pedestrian movement on intersections have not been studied extensively. <br><br>\r\nWith the rise of technologies such as Connected and Autonomous vehicles, IoT and Smart cities it is essential to build models of pedestrian movement and increase safety in urban areas. However, building an accurate model by obtaining patterns from the crowd movement requires big amounts of primary data. <br><br>\r\nTo overcome these difficulties, Machine Learning techniques can be utilized. Using unsupervised learning techniques, simulated agents can learn and adjust their behaviour without knowing the scenario’s layout, based in learnt patterns around environment features. ","technical_details":"Currently existing behavior cognitive models for pedestrians are very specific to the domain, not scalable and assume the reward or utility functions as a given. But in complex scenatios, like intersection crossing, agent's utility function is often unknown. To solve this problem, it is reasonable to use Inverse Reinforcement Learning (IRL). IRL methods work on cases when the reward function is hidden. Therefore, it is ideal for modeling humans behavior. Given that we do not have much information about the solution space in urban environments, maximum entropy approach is expected to perform well.","further_reading":"","tags":[{"name":"Data","slug":"data"},{"name":"Experiment","slug":"experiment"},{"name":"Machine Learning","slug":"machine-learning"},{"name":"Science","slug":"science"},{"name":"Tool","slug":"tool"}],"video_presentation_url":"https://vimeo.com/336812906","video_documentation_url":"","project_url":"http://github.com/xoxoaseka/swarming","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/20190327_154923_280-01-768x432-1.jpeg","title":"20190327_154923_280-01-768x432","alt":"assel","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thumbnail-3-1024x576.jpg","title":"thumbnail","alt":"thumbnail picture","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thumbnail-3-1024x576.jpg","title":"thumbnail","alt":"thumbnail picture","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/poster32.jpg","title":"poster 32","alt":"poster 32","caption":""}]}