{"student_id":"51","student_name":"Gabriel Brasil","student_slug":"gabriel-brasil","advisor_name":"Adaora Udoji","title":"HyperCarnaval","thesis_statement":"HyperCarnaval is a virtual reality experience that imagines an alternative future for our digital selves: one inspired by the rhythms, colors, and spirit of Carnaval.","abstract":"HyperCarnaval chronicles how I've found my artistic voice by creating a VR studio while having Carnaval as my inspiration. It started with the question \"where does creativity happen\" and \"what makes for an inspiring environment\" in VR and grew up naturally into a journey of self-discovery. As I created the tools to immerse myself on my own creations, I've found parallels between the embodiment of VR and the roots of Carnaval culture.\r\n<br><br>\r\nAs my collection of references and 3D creations grew, I've felt that browsing through file icons and static images on a 2D interface were not giving me a full picture of my research and weren't reflecting the multi-media VR nature of these objects. I was looking for ways to be with these characters; dance and sing with them; be inspired by my virtual environments. Then it hit me: As the project developed, I figured out that what I looking for was a Carnaval party.<br><br>\r\nThe culture of my home country Brazil was starting to resonate with the original research on \"what makes for a truly creative environment\" until I realized that what I was creating was a Carnaval Party with my own identity.  My design choices were reflecting urges in my understanding of my own culture and my interest in virtual reality; making parallels between Carnaval and Virtuality more apparent as I became immersed in my own research on immersion itself. <br><br>\r\nCarnaval is a social virtual environment that happens on specific moments where everybody can become avatars of their own creation. It is a hand-crafted reality shared by a community under the rhythm of drums and dance. The realization that I had a \"Virtual Reality\" system already embedded deep in my cultural identity was a revelation that is still growing on me; I've become the answer to my own question on the inspiring power of VR.  By sharing this personal experience I look forward to inspiring an alternative vision for VR as a path toward self-discovery and empowered creativity. A shared virtual Carnaval party: a HyperCarnaval","context_research":"My research had two main subjects: The first was user experience in creative interfaces for VR. The second was the Brazilian carnaval culture.\r\n<br><br>\r\nThe interface research concentrated mostly on figuring out the pipeline necessary to turn assets created in VR tools back into interactive VR characters or environments. During the \"100 days of making\" class I started a \"100 days of VR\" project. For months I've worked on becoming proficient on using Oculus Medium and Quill, two of the most popular and flashed out VR art tools available and generated dozens of original 3D content. The process of exporting my VR creations demanded the use of traditional 3D modeling programs (Maya) and game development engines (Unity3D), thus generating insights on the different philosophies behind established 2D user experience and the emerging 3D immersive work environments.\r\n<br><br>\r\nThe cultural research coalesced into Carnaval culture, more specifically artists and aesthetics that interfaced with technology and used its roots to imagine an alternative vision of the future. \r\nOne of the main references was the profoundly influential Chico Science and his band Nação Zumbi. His \"AfroCyberdelic\" vision of the future is both grim and full of colors and inspired a tropical tomorrow unbounded by the often harsh and totalitarian vision of the future traditionally preached in Latin America.<br><br>\r\nBoth research paths coalesced when combined with dance and music. I used motion capture equipment to record my spouse and I dancing different Brazilian styles and added them to the characters and environments from the interface research. \r\n","technical_details":"List of software and hardware solutions used for the development of HyperCarnaval:\r\n- Oculus Rift Head Mounted Display\r\n- Oculus Medium\r\n- Quill\r\n- Unity 3D\r\n- Autodesk Maya\r\n- Allegorithmic Substance Painter\r\n- Adobe Graphics Suite\r\n-15 Camera Optitrack Motion Capture Studio\r\n","further_reading":"<p><iframe src=\"https://giphy.com/embed/hR5dTUmBGag7hlBHUR\" width=\"480\" height=\"317\"></iframe></p>\n<p>Recording Franey Nogueira doing the choreography for the \"Monstera Deliciosa\" character at Magnet Mocap Studio.</p>\n<p><iframe src=\"https://giphy.com/embed/fVzJIMb7y9WJIx7aBf\" width=\"480\" height=\"332\"></iframe>`</p>\n<p>\"Rainha/Queen\" character modeled in Medium VR and animated using motion capture data.</p>\n<p><iframe src=\"https://giphy.com/embed/Yqc96lORID3FzKbQ6D\" width=\"480\" height=\"292\"></iframe></p>\n<p>Interface coded in Unity/C# that allows the user to select and populate the VR world with dancers.</p>\n<p><iframe src=\"https://giphy.com/embed/LMPOWL699uNc1obFg8\" width=\"480\" height=\"292\"></iframe></p>\n<p>Carnaval is a collective painting made of dancing humans.</p>\n<p>Concept behind HyperCarnaval</p>\n<p>While there is a lot of discussion about what kind of content should VR have, I've been most interested in what can be created while immersed in digital space. The current generation of 3D modeling and animation tools, like Oculus Medium and Quill, might be in their infancy, but they are, in my opinion, roadmaps towards a fully immersive user interface. For months I've gained experience sculpting and animating in VR and for the first time, I saw VR, not only as a storytelling device but also as a powerful creative tool for professionals. Though I wanted to discover what \"efficiency\" means in a VR user experience, what I ended up learning was much deeper and personal then I imagined: I saw that Brazilian Carnaval culture, with it's naturally creative, emergent, multi-media and communal spirit, had the hallmarks of an \"ur-virtual reality\".</p>\n<p>I realized that I had already experienced something similar while growing up in a country where virtuality was the core of our identity. I was having the embodied experience of \"being there\" (dasein) together with sculptures I've modeled with my own (VR) hands, dancing choreographies captured from my body, playing sounds from my country. What I imagined as a tool became a Carnaval party that shined a light on a part of my self I've sidelined for so long. HyperCarnaval is how virtual reality provided me with inspiration and identity.</p>\n<p>The creative process from basic research to HyperCarnaval</p>\n<p>First Oculus Medium Art object<br />\nhttps://vimeo.com/299535065</p>\n<p>“At the gates with the DogBeast” was my first art piece using only assets created in Oculus Medium VR and original music using VCV Rack. It was here that I started really experimenting with the organic and intuitive aesthetic made possible with VR creative tools.<br />\nRediscovering my Carnaval roots in New York<br />\nhttps://vimeo.com/254692506</p>\n<p>This video was originally created to promote ITPs Carnaval themed Thursday Night’s Out (TNO). It features Dan Oved and myself dancing around NYU during a cold February morning. I approached it as a funny take on my Brazilian roots, but the theme started to grow on me and resurfaced spontaneously on different projects until I finally embraced it in HyperCarnaval.<br />\nRecreating real-world environments using Quill<br />\nhttps://vimeo.com/316187059</p>\n<p>Quill VR allows for a 3D modeling experience, unlike anything I’ve experienced. It more closely resembles freehand drawing. I’ve become obsessed with it and how quickly I could create engaging experiences. This animation was fully created while inside VR and it proved me the potential of VR based art tools. Not only I could create, but also experience my own creation as I was creating it without any breaks for rendering. Drawing in Quill seemed natural and one of my favorite all-time VR experiences. It made me question why couldn’t all of my apps be in VR.</p>\n<p>Motion Capture – Recording first dance moves<br />\nhttps://vimeo.com/291914230</p>\n<p>First motion capture studio sessions at Magnet NYU during the “Bodies in Motion” classes with Todd Bryant and Kat Sullivan. There I learned how to operate the Opti Track system, as well as direct and act for motion capture. There I decided to record my own choreographies for future use, which were then used to animate my HyperCarnaval characters.<br />\n100 Days of VR – Homepage<br />\nhttps://www.ejectnow.com/100daysvr</p>\n<p>The “100 days of making” class proves invaluable to the development of this project. I set the goal to make 100 VR creations. The daily practice made me learn different tools and figure out experimental pipelines between VR art tools like Quill and Medium into fully interactive VR experiences in Unity. It was also during my “100 days of VR” that I became part of the burgeoning VR art movement in New York. This gave me the opportunity to meet with other VR artists, interview them and to take part in industry events at Facebook’s New York HQ, art talks and community events.<br />\nFirst HyperCarnaval environment with dancing character<br />\nhttps://vimeo.com/310425096</p>\n<p>The “Mulambo” was the first character I added animation to. It was modeled in Medium, textured in Substance Painter, Rigged in Maya and sent back to VR in Unity 3D. The animation is from my motion capture sessions and it was very exciting – as well as disconcerting – seeing him do my dance while I shared the same world in VR. The environment was also created in Medium, giving it a hand made organic aesthetic that ended up becoming a key part of my artistic narrative with HyperCarnaval.<br />\nExpanded virtual environment<br />\nhttps://vimeo.com/314794033</p>\n<p>The “Sundancer” is my second fully developed character. I wanted to generate an impressionist virtual experience where sound, color, and movement carried a sense of earthy materiality while the events and shapes had a dreamy haze. I’ve spent a long time just ‘standing’ in this environment, trying to figure out why it resonated with me so much.<br />\n“Little House” environment: First VR Studio Prototype<br />\nhttps://vimeo.com/316204187</p>\n<p>“Nightly drums by the little house” was my first take on creating a “studio environment” – a place that I could share with all of my creations; see them dance and interact with them. But I didn’t want this environment to be “neutral” or slick like a white cube gallery. For me to feel immersed in it I had to almost smell the world I was trying to materialize – the dirt and sweat. Before moving to New York I would often hear the sounds of drums in the middle of dark summer nights in Rio de Janeiro. The drums were harbingers of something spiritual, fun, scary and very human coming through the window. I don’t hear drums in New York. I can hear them in VR.</p>\n<p>Real-time high definition rendering dance in Unity<br />\nhttps://vimeo.com/325938995</p>\n<p>The “Glimmering Cave” was created using Unity’s new high-quality rendering pipeline, which allowed me to push the visual experience further than before, although not necessarily in VR. From this scene, I created several high-resolution prints which brought more attention to the aesthetic universe I was creating. This was probably the moment the HyperCarnaval experience took the front in my previously purely technical research.<br />\nDance and Choreography by ITP dance &amp; Technology alumn Sarah Amores.<br />\nCharacter sculpting using Oculus Medium<br />\nhttps://www.youtube.com/watch?v=Q0gH5-trxqs&amp;feature=youtu.be</p>\n<p>&nbsp;</p>\n<p>Motion Capture Session</p>\n<p>https://vimeo.com/335300199</p>\n<p>Footage from the motion capture session for the Monstera Deliciosa character choreographed and performed by Franey Nogueira. Part of my HyperCarnaval Virtual Reality thesis.<br />\nUsed 15 camera Optitrack studio at NYUs Magnet Center.<br />\nCharacter modeled in oculus medium and made interactive in Unity 3d</p>\n<p>When I modeled “Rainha” (Queen) using Oculus Medium, I was finally aware of the narrative goals of HyperCarnaval, which were to further create and polish my interpretation of Carnaval in a virtual environment. Until then I would still experiment with random sketches or applications, but the last models and the reactions towards my work showed me I had something much more valuable in my hands than I wanted to admit. With “Rainha” I could fully commit to a cohesive artistic voice. But I still didn’t know how it fitted with my original Thesis statement.</p>\n<p>Quick &amp; Dirty Demo Day – User Testing<br />\nhttps://www.youtube.com/watch?v=Ywvpj9ZB5Do</p>\n<p>For the Quick &amp; Dirty Demo day I had the chance to show users my first prototype. I recorded audio and video of 6 users with different levels of experience in VR. The VR station was located in the corner of the room, with my HyperCarnaval prints hanging on the wall. I used this to set the theme of a creative environment. After each user, I interviewed them on their experience and their views on what makes for a creative environment. There was a wide range of answers on the interface question, but then they all agreed that my world and my characters were engaging and they wanted to see more of it.</p>\n<p>Interview with Sarah Rothberg</p>\n<p><a href=\"https://soundcloud.com/brasuka/zoom0046-sarahrothber-04092019mp3/s-A3hwH\">https://soundcloud.com/brasuka/zoom0046-sarahrothber-04092019mp3</a></p>\n<p>This office hour with ITP faculty Sarah Rothberg on April 9th, 2019, became an important turning point into the whole project. The takeaway of this conversation is that my project was becoming something different than I initially have imagined it. Sarah pointed out that the artistic narrative emerging from my research was becoming bigger than my goal of creating an ideation tool. She recommended choosing either framing it as a tool or as an art piece, with the caveat that the art piece was already engaging enough. Maybe I should focus on this futuristic Carnaval aesthetic and leave my questions about VR and the future of interfaces as a future result of engaging with my art.</p>\n<p>I’ve left the meeting deeply distressed but came back later with the realization that I’ve found my artistic voice. Special Thanks to ITP resident Ari Melenciano, who further reiterated the value of embracing art in a tech project.</p>\n<p>Further References</p>\n<p>Museum Exhibition - Hand Made Carnaval</p>\n<p>I attended this exhibition at the museum of arts and crafts in Rio de Janeiro back in 2016 and It had a deep influence in me.  It depicted traditional hand made Carnaval costumes still being created in different parts of Brazil.</p>\n<p><a href=\"https://www.flickr.com/photos/157779791@N04/albums/72157704674868172\"><img src=\"https://live.staticflickr.com/65535/46740308105_9af9d2d5e9_z.jpg\" /></a></p>\n<p>Notebook Sketches 2017-2019</p>\n<p>Since I started this program in August 2017, I have filled 12 notebooks with notes and sketches. These are some related to the current project. It includes my first sketch of a fully immersive work environment based on artists studios as well as my first note on the parallels of Carnaval with our future digital selves.<br />\n<a href=\"https://www.flickr.com/photos/157779791@N04/albums/72157708001247755\"><img src=\"https://live.staticflickr.com/65535/47655968451_4faa33e9d3_z.jpg\" /></a></p>\n","tags":[{"name":"3D","slug":"3d"},{"name":"Art","slug":"art"},{"name":"Culture","slug":"culture"},{"name":"Identity","slug":"identity"},{"name":"VR/AR/Immersive","slug":"vr-ar-immersive"}],"video_presentation_url":"https://vimeo.com/336708075","video_documentation_url":"https://vimeo.com/331464075","project_url":"http://hypercarnaval.com/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Gabriel_Portrait_April2019.jpg","title":"Gabriel_Portrait_April2019","alt":"Gabriel_Portrait_April2019","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Artboard-2-1-1024x576.jpg","title":"HiperCarnaval Project","alt":"HiperCarnaval Project","caption":"HiperCarnaval Project"},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Artboard-4-1024x576.jpg","title":"HiperCarnaval Slide Show 1","alt":"HiperCarnaval Slide Show 1","caption":"HiperCarnaval Slide Show 1"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Artboard-3-1024x576.jpg","title":"HiperCarnaval Slide Show 2","alt":"HiperCarnaval Slide Show 2","caption":"HiperCarnaval Slide Show 2"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/screen_2049x994_2019-05-09_17-31-25-1024x497.jpg","title":"HyperCarnaval","alt":"HyperCarnaval Monstera Deliciosa","caption":"HyperCarnaval Character \"Monstera Deliciosa\" dancing with open arms"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Artboard-6-1024x576.jpg","title":"HiperCarnaval Slide Show 4","alt":"HyperCarnaval Character dancing on top of a mountain while the moor shines behind him.","caption":"HiperCarnaval Slide Show 4"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Artboard-7-1024x576.jpg","title":"HiperCarnaval Slide Show 5","alt":"HiperCarnaval Slide Show 5","caption":"HiperCarnaval Slide Show 5"}]}