{"student_id":"53","student_name":"Hadar Ben-Tzur","student_slug":"hadar-ben-tzur","advisor_name":"Kathleen Stevens Wilson","title":"1968 WSQP – an augmented reality app","thesis_statement":"1968 WSQP, an augmented reality app, invites Washington Square Park visitors to follow the footsteps of Wallace and June – two young activists meeting in the park on a hot spring day in 1968. Download the app for a cinematic experience, which binds past and present into a single moment in space.","abstract":"The fight for civil rights, protests against the Vietnam war, assassinations, the women's rights movement – 1968 was undoubtedly a pivotal year in history, and a unique point in time in downtown Manhattan, NYC. 1968 WSQP, a geo-located augmented reality app, invites Washington Square Park visitors to follow the footsteps of Wallace and June – two young activists meeting in the park on a hot spring day in 1968. In order to bind story and space, we have divided Washington Square Park into the east side and the west side – each side triggers a different character to follow all the way to the meeting point under the arch. Download the app, and Join as Wallace tries to deal with the fact that he’s been drafted, or free-spirit June as she rushes through the park to meet Wallace.","context_research":"Augmented reality as an immersive storytelling medium is almost tailor-made for historical fiction – music, spoken text, periodical videos and sound, geolocation, visual effects, image targets, illustrations, press clippings, interviews, and much more. 1968 WSQP App tells the story of 1968 and provides the necessary historical context to the same challenges we face as a society today. Through the story of Wallace and June, we introduce our audience to same-aged social activists which once stood and waved protest signs at the same place, and often — on behalf of the same values. 1968 WSQP was developed in collaboration with Ilana Bonder. Thanks to playwright Joanna Evans who wrote the spoken text, drummer Roy Ben-Yosef, and guitar player Roberto Trzini, who wrote an original soundtrack.","technical_details":"1968 WSQP is an augmented reality geo-located app, which was developed in Unity using ARKit and MapBox. The experience is accompanied by original soundtrack and script, while around the park appears archival footage sourced from various historical archives. The app is available for download on the AppStore.","further_reading":"<p>Driven by the desire to create a compelling and convincing story in AR – our work on 1968 WSQP started by analyzing both new and long existing storytelling mediums. Podcasts, Instagram stories, script-based apps, immersive theater and dance productions, VR animation and film, installations, and many more. We were able to classify all characteristics into five main pillars: In-depth geohistorical research, overall rhythm and movement, language accuracy, sound design, and reference-based graphic design.</p>\n<p>1968 WSQP development started on January 18’ as part of AR prototyping fellowship by A+E Networks in partnership with NYC Media lab, focused on the 50th anniversary of the year 1968.</p>\n<p>Ilana Bonder took the lead developer role, while I focused on composing the story in space. As NYU students, focusing on Washington Square Park which both then and now functions as a unique convergence point for social initiatives, was an obvious choice.</p>\n<p>To achieve historical accuracy – we conducted research in NYU Bobst Library, NYPL, the New York Historical Society Library and Greenwich Village Society For Historic Preservation, and using online resources.</p>\n<p>Early in our journey, we collaborated with playwright Joanna Evans (Ph.D. Candidate at the</p>\n<p>Department of Performance Studies). Joanna conducted further research and wrote the spoken text which accompanies the app. To complete the experience, the drummer Roy Ben-Yosef (B.F.A in performance from the New School for Jazz and Contemporary Music) and guitar player Roberto Trzini wrote an original soundtrack based on the music scene in New York, 1968.</p>\n<p>And so began a subtle dance between the technological possibilities lays within AR, the story of 1968 and Washington Square Park, archival footage and materials – and Joanna’s writing.</p>\n<p>As creative technologists with a background in both education and marketing, we know that storytelling is a powerful tool (mainly in a raising medium such as AR which has a viral potential). In order to make sure the tech and content work in tandem – we have deliberately created a strong research-based work method, which involves many creators in the process</p>\n<p>with different points of views and voices to be heard. This working method requires often and feedback oriented user testing, iterating fast with minimal attachment to past decisions, keeping historical accuracy and an open mind.</p>\n<p>My role as the content creator and editor often required second, third and forth editing – further research and finding ways to work with the limitations of AR as a new medium. Luckily, Ilana Bonder was a wonderful and skilled working partner. After over a year of development, many user tests and iterations – I’m proud to say we were able to meet the challenge of creating historical fiction in space.</p>\n","tags":[{"name":"History","slug":"history"},{"name":"Mobile","slug":"mobile"},{"name":"Narrative/Storytelling","slug":"narrative-storytelling"},{"name":"UX","slug":"ux"},{"name":"VR/AR/Immersive","slug":"vr-ar-immersive"}],"video_presentation_url":"https://vimeo.com/336836447","video_documentation_url":"","project_url":"www.1968wsqp.com","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Hadar-1-768x432-1.jpg","title":"Hadar-1-768x432","alt":"hadar headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Archive_19687-1024x576.jpg","title":"Archive_19687","alt":"1968WSQP","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Archive_2-1024x576.jpg","title":"Archive_2","alt":"1968WSQP","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Archive_23-1-1024x576.jpg","title":"Archive_23","alt":"1968WSQP","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Archive_24-1024x576.jpg","title":"Archive_24","alt":"1968WSQP","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Archive_22-1024x576.jpg","title":"Archive_22","alt":"1968WSQP","caption":""}]}