{"student_id":"54","student_name":"Huiyi Chen","student_slug":"huiyi-chen","advisor_name":"Kathleen M Sullivan","title":"Today I Will Be a Better Human","thesis_statement":"A performance and a series of wearable installations that transform the artist into a “better” human with algorithmically optimized emotion, empathy, and social interaction. Today I will be a better human is an attempt to understand what it means to be human in the age of automation, with a language of absurdity and vulnerability. ","abstract":"What makes us human? Feelings? Memories? Empathy? Are we still the same human when we outsource our memories, feelings, and empathy to machines?\r\n<br><br>\r\nToday I will be a better human consists of three wearable devices: I Will Never Forget Your Name, a social assistant that helps me impress people by optimizing my memory; Tearing Up, an empathy assistant that optimizes my emotional Intelligence by pumping tears into my eyes when it senses sorrow in other people; Hugger, the sentiment assistant that comforts me and optimizes my negative emotions. Collectively, these devices are my personal reaction to the values and expectations that society puts upon me, and a critical comment on the culture in which we are optimized and evaluated by algorithms. <br><br>\r\nIn a postindustrial society, our value as a human is defined by our economical value and our labor. We aim to be faster, stronger, smarter, prettier, and the list goes on. To produce more value, we create technical devices to extend our abilities and compensate for our weaknesses. We are all cyborgs in some way, and we are incentivized to be more and more so.<br><br>\r\nIn the last few decades, authority has to shift from humans to algorithm and more than ever, our lives are evaluated and optimized by algorithms. For example, what book we read depends on Amazon's algorithm; how we travel to a place depends on Google’s instruction...I ask myself: what are some aspects of us that hasn’t been optimized by algorithms because technology is not there yet, but is likely to be in the future? In Today I will be a Better Human, I envision a future in which we outsource more of ourselves to machines: feelings, emotions, social interactions.<br><br>\r\nBut can these feelings really be improved with the help of algorithms? Or could it nullify the things that makes humans actually human ? In the end, maybe it is exactly our imperfections, our limitation, our weakness that makes us human.","context_research":"The questions I started off with my thesis are: How is technology shaping our modern relationship with others, with ourselves and with it? How does technology change our state of mind, our sense of self, and our social relationships? <br><br>\r\nTo answer these questions, I read a few research papers, Alone Together by Sherry Turkle, Calm Technology by Amber Case. I also interviewed  a couple psychologists. Throughout the course of my research, I have become more convinced that technology has a profound influence on who we are as human beings. However, the influence is not as simple as positive or negative, but rather convoluted. For example, the average IQ in the world has decreased and the autism rate has been increasing in the past few decades, possibly correlating to the popularization of smartphones; Yet on the other hand, the average death rate has also decreased and technological advancement allows improved treatments for the autistics…<br><br>\r\nI have also come to realize that the limits of our algorithms today is the part of our social interaction that we have yet to formalize. To paraphrase what Sherry Turkle wrote, technology tends to take something complicated and promises something simpler. As a result, we stop cultivating the the ability to gather ourselves. <br><br>\r\nA deeper understanding of these problems allows me to have a clearer attitude towards them.  Machines are better at certain tasks and they have  helped us in tremendous ways. We should acknowledge and embrace that. At the same time, we should also acknowledge their limitations, and how they might shape us. This is the message I want to convey through my work. <br><br>\r\n\r\nTechnical Research<br><br>\r\nThe Technical challenge of this project is to build a computer vision and machine learning algorithm on a portable and affordable computer so that I can recognize other people’s faces and emotions as I walk around.  I researched and experimented with various face recognition models including opencv, clmtrackr, and aws rekognition. I ended up implementing the model with raspberry pi + aws because it allowed me to offload all the heavy computation to the cloud instead of running locally on the raspberry pi, which has limited computational power. \r\n ","technical_details":"I will never forget your name is implemented with a raspberry pi, a pi camera, aws rekognition, and google voice. <br>\r\nTearing up is implemented with a raspberry pi, a pi camera, aws rekognition, aws rekognition emotion detection, and a peristaltic pump. <br>\r\nThe Hugger is implemented with Programmable air developed by Amitabh Shrivastava and heat sealable fabric. ","further_reading":"","tags":[{"name":"Art","slug":"art"},{"name":"Identity","slug":"identity"},{"name":"Machine Learning","slug":"machine-learning"},{"name":"Performance","slug":"performance"},{"name":"Speculation","slug":"speculation"},{"name":"Wearables","slug":"wearables"}],"video_presentation_url":"https://vimeo.com/336825976","video_documentation_url":"https://www.youtube.com/watch?v=ywYDmZnJ-Hc","project_url":"https://chenhuiyi.com/today-i-will-be-a-better-human/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/profile-3-768x432-1.jpg","title":"profile-3-768x432","alt":"huiyi headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Huiyi-Chen-120-copy.jpg","title":"Huiyi Chen 120 copy","alt":"picture of Huiyi wearing tearing hat and tear up","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide2-4-1024x706.jpg","title":"slide2","alt":"hat with embedded camera to detect faces","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide3-7.jpg","title":"slide3","alt":"tearing with the tearing device","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slid5-1024x682.jpg","title":"slid5","alt":"back view","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Huiyi-Chen-90-1024x662.jpg","title":"Huiyi Chen 90","alt":"hugging self","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/pineapple-1024x682.jpg","title":"pineapple","alt":"performing as an optimized human at pineapple reality","caption":""}]}