{"student_id":"55","student_name":"Alice Sun","student_slug":"alice-sun","advisor_name":"Kathleen Stevens Wilson","title":"Consistent Doodles","thesis_statement":"An icon is an ideogram that conveys its meaning through its pictorial resemblance. The term “icon aggregator” refers to an icon library that is created through uploads from multiple creators. My thesis has involved redesigning an icon aggregator search engine with the help of machine learning so that it can effectively organize icons by their visual similarities. Its goal is to help users of an icon aggregator service, by reducing the time and effort spent searching for icons, and thereby let them more fully utilize systems of an icon aggregator like Noun Project.","abstract":"Icons vary in their level of detail, scale, weight, and style depending on their themes and purposes. In order to create coherent, digital environments for end users of devices like mobile phones, interface designers strive to ensure visual consistency in the use of icons. Without such consistency, a set of icons falls apart as a visual language and becomes more like a random jumble of doodles. The key to effectively transforming a set of icons into a universal language is consistency. <br><br>\r\n\r\nCurrent icon aggregator systems have some pros and cons. The pros are the high number of collections and the diversity in style. The Noun Project, which is the largest example of an icon aggregator, has over 2 million curated icons created by a global community. The downside to using Noun Project is its lack of consistency throughout different collections and the fact that its tagging-based search system doesn't help solve the problem. Due to this structure, users have to rely on infinite scrolling and bit of luck, in order to find what they're looking for. Icon aggregators like Noun Project not only cost users a lot of time and effort, but also fail to effectively allow users to utilize its amazing number of collections.<br><br>\r\n\r\nMy thesis, which involves the redesign of an icon aggregator search engine, approaches the problem with the use of machine learning. Image feature extraction has been widely used for other types of search engines and has the potential to be applied to icon sorting as well. Organizing icons by their visual similarities, rather than only by tags, makes the icon searching experience easier and quicker, and encourages collaboration within the community of users by effective cross-collection search that is not limited to an individual collection. ","context_research":"My thesis is heavily influenced by machine learning projects as Font Map or existing search platforms powered by machine learning, such as Pinterest and Google Image Search—which both improves the way of searching by analyzing visual patterns of images. Applying deep learning techniques to icons also has been done before (brandmark.io/intro/), but only for the purpose of \"logo maker\". It's great that I have many similar projects, so my research started from studying them.<br><br>\r\n\r\nAfter studying the existing examples, I've learned that it is possible to sort icons. To start, I needed a large source of icons and I decided to use the Noun Project API—attracted by its high number of collections. Hence, my icon searching engine is based on the Noun Project. Involving the Noun Project API into deep learning process is not only for making high-fidelity prototype, but also to avoid arbitrarily picking icons for my user testing.<br><br>\r\n\r\nThe entire process accompanied with two user testings. The very initial user testing was about clarifying the goal and user needs, and the later one was about checking the usability of redesigned wireframe. All icons that were involved in both user testings were pre-analyzed with machine learning.","technical_details":"The overall sorting process of icons uses two coding examples from Gene Kogan: Feature extraction and reverse image search, and Image t-SNE. The image feature extraction works with VGG-16, a previously-trained convolutional neural network, and the t-SNE map gets built based on the results from image feature extraction. \r\n<br><br>\r\nIn order to test usability and present high-fidelity prototype, I'm also using Sketch, a vector graphics editor, along with Principle, a tool to design animated and interactive user interfaces. Those two tools were chosen because it's easy to integrate modules between them.","further_reading":"","tags":[{"name":"Data","slug":"data"},{"name":"Design","slug":"design"},{"name":"IOT","slug":"iot"},{"name":"Machine Learning","slug":"machine-learning"},{"name":"Tool","slug":"tool"},{"name":"UX","slug":"ux"}],"video_presentation_url":"https://vimeo.com/336836504","video_documentation_url":"","project_url":"https://alicehgsun.com/consistent-doodles","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/1280x720-768x432-1.jpg","title":"1280x720-768x432","alt":"alice headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/1280x720_thumb-768x432-1.jpg","title":"1280x720_thumb-768x432","alt":"logo thumbnail","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide-1-768x432-1.jpg","title":"slide-1-768x432","alt":"image 1","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide-2-768x432-1.jpg","title":"slide-2-768x432","alt":"image 2","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide-3-768x432-1.jpg","title":"slide-3-768x432","alt":"image 3","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide-4-768x432-1.jpg","title":"slide-4-768x432","alt":"image 4","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide-5-768x432-1.jpg","title":"slide-5-768x432","alt":"image 5","caption":""}]}