{"student_id":"57","student_name":"Haiyi Huang","student_slug":"haiyi-huang","advisor_name":"Adaora Udoji","title":"The Drawing Booth","thesis_statement":"How can drawing help us “see” ourselves better and empower us through self-discovery? A interactive drawing booth that allows people to “capture” themselves through their drawing process. ","abstract":"Drawing has always been a way for me to process my thoughts. As technology continues to advance and our daily life becomes increasingly digital, I now realize the value drawing is able to offer to me—the freedom and the time for self-reflection. How can drawing help us “see” ourselves better and empower us through self-discovery? I want to design a drawing experience that allow people to capture their own essence ---their inner thoughts, voices, emotions, personalities, and quirks.<br><br>\r\n   \tThe Drawing Booth resembles a photo booth, but instead of taking photos, visitors capture themselves through drawing,by recording and revealing their drawing process. Upon entering the Drawing Booth, the visitor will be guided to randomly select a prompt, for example, “draw something that makes you smile no matter what”. A webcam is placed above the drawing paper to record the drawing process. Once the visitor is done drawing, a time-lapse video showing the visitor’s characteristic process of drawing is generated as a “portrait” of the visitor. ","context_research":"While designing this thesis project, I have looked into the topic of drawing, psychology, and modern-day technology through literature references such as Drawing-The Purpose by Leo Duff and Jo Davies and Drawing/Thinking: Confronting an Electronic Age by Marc Treib. I also interviewed several people with various academic and professional backgrounds to understand what drawing means to them. The takeaways I got from my initial research is that most people draw to communicate something and that the process of drawing is as important as the drawing itself.  As for the final design of my thesis, I drew inspiration from several existing projects such as Face-o-Mat by Tobias Gutmann, Let’s Rethink High School: a touring video booth that collected more than 1,000 stories and ideas about how to improve high school education by Local Projects. ","technical_details":"The booth is enclosed by cardboard and supported by PVC pipes. Inside the booth, there is a touch pad that guides visitors through the experience and prompts the visitors to start recording. A webcam is placed above the table to record visitors' drawing. The digital experience on the touch pad is created using HTML, CSS, and Javascript. ","further_reading":"","tags":[{"name":"Art","slug":"art"},{"name":"Design","slug":"design"},{"name":"Installation","slug":"installation"}],"video_presentation_url":"https://vimeo.com/336814906","video_documentation_url":"https://vimeo.com/331479189","project_url":"https://www.haiyihuang.com/thedrawingbooth","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/haiyi-profile-pic-1024x683.jpg","title":"haiyi profile pic","alt":"haiyi profile pic","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thebooth-1024x683.jpg","title":"The Drawing Booth","alt":"The Drawing Booth","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thebooth-768x512-1.jpg","title":"thebooth-768x512","alt":"drawing booth","caption":""}]}