{"student_id":"58","student_name":"Nathier Fernandez","student_slug":"nathier-fernandez","advisor_name":"Stefani Bardin","title":"Genetically Generated Texts [5’ GGT 3’]","thesis_statement":"5’ GGT 3’ is a series of experimental artifacts that speculate the act of renaming genetics as literature by implementing linguistic rules and computational arts to living organisms. This set of in-vitro inspired fictions focus on the ‘otherness’ of the microbiome that constitutes us; becoming a subversive seed for new [biotech] futures. ","abstract":"Genetically Generated Texts [5’ GGT 3’] is a series of experimental artifacts that speculate the act of renaming genetics as literature. This is created by implementing linguistic rules based on the central dogma of microbiology. <br><br>\r\n\r\nThis dogma of microbiology creates 'gene expression', in which information from a gene is read to build a protein. By mapping these set of rules to parts of speech in English grammar, the gene of a preselected organism [Aichii (Virus) and Escherichia Coli (Bacteria)] builds a text-based fictional output. This is then translated to DNA code in order to be embedded inside the organism that provided the first DNA input.<br><br>\r\n\r\n\"To say that DNA is 'read' or that is a 'program' is to make use of metaphors\" Pablo Schyer\r\n\r\n","context_research":"And every natural being is making communications        \r\nAnd we’re just sparks, tiny parts of a bigger constellation\r\nWe’re minuscules molecules that make up one body.\r\n<br><br>\r\n                                     Tunnel Visions by Kate Tempest\r\n<br><br>\r\n\r\nPoets like Christian Bok, who created the first 'living' poetry, by encoding his poems to bacteria and encouraging mutations that change the poems continuously over time. [The Xenotext]. Or Artists like Neri Oxman and her Mediated Matter Group at MIT;  Eduardo Kac’s concrete poetics and genetic-based media were influential to Genetic Generated Texts.\r\n<br><br>\r\nThe plastic explorations with living organisms that artist like Anika Yi achieves or Alisson Kudla’s interventions between technology and speculative biology not only showed the path but how infinite the metaphors around human and non-human relationships could be.\r\n<br><br>\r\nIf the basic unit of life is sign, and not the molecule as Jesper Hoffmayer said, then one must use the most powerful of all human symbols: language, relying on semiosis to create meaningful scenarios. Then, exploring a connection between language and genetics;\r\nwhich is heavily based on signs and molecules, should allow an intersection between art and biological sciences, even if they only live in the speculative realm. After all, language is a  powerful tool to create relationships with other living things.<br><br>\r\n\r\nBut Molecules themselves are not visible, so are some biological organisms. At some point in history, they didn't 'exist' because we couldn't see them. Until the development of some apparatus [e.g, microscopes], they were only part of speculation, theories and even wild imaginations. Once these objects emerged, an 'apparatus-based vision' appeared. And with any new medium, humankind has always found a way to represent and create things.\r\n<br><br>\r\nExperimental artifacts are in the context of this project, both errors and physical objects, they should be understood by their cultural, scientific and visual meaning. With 'errors' as a particular experimental practice, encouraged and expected. For aesthetic and metaphorical purposes we are gonna call them 'mutations'. \r\n<br><br>\r\n\"Artifacts may emerge from experiments in science, the \"artifact\" is an outlying bit of data-an erroneous often human-induced thing that can be ignored, like the distortion caused by the curvature of a lens. Conversely =, for the artist or designer, the artifacts is the focus of our intention: We are actively making things\". \r\n<br><br>\r\nSynthetic Aesthetics. Alexandra Daisy Ginsberg, Jane Calvert, Pablo Schyfter, Alistair Elfick and Drew Endy. The MIT press.\r\n<br><br>\r\n“The word is now a virus. The flu virus may have once been a healthy lung cell. It is now a parasitic organism that invades and damages the central nervous system. Modern man has lost the option of silence (..) serving no internal function other than to replicate itself” William. S. Burroughs","technical_details":"Genetically Generated Texts [5’ GGT 3’] has three well-defined threads: <br>\r\nThe first follows biological dogmas to create proteins and creates a similar language based structure using python 3. The second creates experimental artifacts [visual sculptures] that speculate the effects of linguistic rules on living organisms and explore the possible aesthetics behind such a symbiotic relationship. The third takes place in the laboratory; where the original text-based fiction goes through experimental rounds, where it is encoded synthetically, embedded in-vitro and sequenced again to confirm the text.\r\n<br><br>\r\n“In the future, a new generation of artists will be writing genomes the way Blake and Byron wrote verses”  Freeman Dyson.","further_reading":"","tags":[{"name":"Art","slug":"art"},{"name":"Experiment","slug":"experiment"},{"name":"Python","slug":"python"},{"name":"Science","slug":"science"},{"name":"Sculpture","slug":"sculpture"},{"name":"Speculation","slug":"speculation"},{"name":"Visual","slug":"visual"}],"video_presentation_url":"https://vimeo.com/336814947","video_documentation_url":"","project_url":"http://www.nathier.com/category/itp/genetically-generated-texts/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/2H6A9918-768x512-1.jpg","title":"2H6A9918-768x512","alt":"nathier headshot","caption":""},"thumbnail_image":{"src":null,"title":"the_virus_is_now_a_word","alt":"WCAG violation: this image will not be displayed due to lack of alternative text.","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/ggt-1024x622.jpg","title":"ggt","alt":"ggt image","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-04-19-at-2.12.13-PM-1024x753.png","title":"Screen Shot 2019-04-19 at 2.12.13 PM","alt":"genetically generated texts","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-04-16-at-8.16.40-PM-1024x749.png","title":"Screen Shot 2019-04-16 at 8.16.40 PM","alt":"project image","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-04-19-at-2.12.34-PM-1024x756.png","title":"Screen Shot 2019-04-19 at 2.12.34 PM","alt":"Screen-Shot-2019-04-19-a","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thevirusdnaencoding-1024x622.jpg","title":"thevirusdnaencoding","alt":"project image","caption":""}]}