{"student_id":"59","student_name":"Heng Tang","student_slug":"heng-tang","advisor_name":"Gregory Shakar","title":"A Farewell to Trolls","thesis_statement":"My thesis is a word game where players type in friendly words or sentences to win and abusive words to lose. It encourages people to have genial attitudes when interacting with people on the Internet. This means less trolling, cyberbullying and a better online community.","abstract":"Let's face it! Internet trolls are ubiquitous nowadays. Just browse through the comment section of YouTube videos, you can find a dictionary of swear words. To fight against the poison of the Internet community the games encourage people to use nice and friendly words to interact with others online.","context_research":"Trolling is an Internet slang which began in early 1990 on forums and Usenet which initially carried no wrong or harmful meaning. At that time, the forum veterans would ask stupid questions to troll the newbies and make fun of their straightforward answers, but it never crossed the line of no insult and abuse.<br><br>\r\n\r\nNowadays, the definition of trolling on the Internet carries more negative meaning than positive. Internet trolls make … remarks to … just for ... There are lots of exciting stories behind the choice of the word “troll”, but for the time’s sake, I am gonna skip the part and jump right to the presentation today.<br><br>\r\n\r\nMany people underestimate internet trolling. No big deal. It is wrong and dangerous. The article The Life and Death Consequences of Cyber Bullying told you the opposite with statistics and interviews. Many teenagers commit suicide because of cyberbullying. Real lives are being destroyed, literally. That is the worst case. In most common occasions, it prevents the rational discussion of things we love.\r\n<br><br>\r\nNow we know it is terrible. Here is another bad news, internet trolls are ubiquitous. We need to fight againstto fight against it.","technical_details":"The game is written in JavaScript which enables it to play across platforms. The Phaser library builds up the interface and logic of this project and word vector is responsible for the categorizing the data.","further_reading":"","tags":[{"name":"Design","slug":"design"},{"name":"Play/Games","slug":"play-games"}],"video_presentation_url":"https://vimeo.com/336826064","video_documentation_url":"","project_url":"","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Snipaste_2019-04-19_16-22-18.png","title":"Snipaste_2019-04-19_16-22-18","alt":"Headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Main-Image.png","title":"Main Image","alt":"Thumbnail","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Assest-1024x576.jpg","title":"Assest","alt":"Scene","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/player.jpg","title":"player","alt":"Keyboard Man","caption":""}]}