{"student_id":"60","student_name":"Hau Yuan","student_slug":"hau-yuan","advisor_name":"Kathleen M Sullivan","title":"Ultimate “Mobile-First” Design","thesis_statement":"What if we save our dying phone like rescuing a patient? What if we commemorate our deprecated phone when we no longer need them? Ultimate “Mobile-First” Design is a whimsical product suite that exaggerates how smartphones have shaped our behavior and mental model.","abstract":"After the paradigm shift of “Mobile-First” design a decade ago, smartphones have gradually become integrated into every facet of our daily life. Our reliance on smartphones has incorporated them as the extensions of our bodies. They empower us to complete the tasks that our bodies are not capable of. Also, they are affecting us physically, perceptually and mentally. We are losing natural wayfinding abilities because of robust GPS navigation. We have more awkwardness in small talk because of our dependency on our phones. Posting Instagram stories is usually prior than having delicious dishes. <br><br>\r\n\r\nIn Ultimate \"Mobile-First\" Design, I created a series of whimsical products playfully to remind people about our entrenched habits and mental models of getting along with those tiny glowing screens. The product suite consists of Smartphone First Aid Kit, Smartphone Heat Stroke Treatment Kit, and i-Coffin. Each of the products talks about one specific behavior regarding the way we use our smartphones.\r\n","context_research":"I've always been interested in speculating our relationships with machines. In Speculative Everything, Anthony Dunne and Fiona Raby propose a kind of design that is a means of speculating about how things could be—to imagine possible futures. In the examples of this book, artists and designers often pose “what if” questions behind the work they created, which are intended to let the audience picture the exaggerated scenario of a specific topic. They inspired me to anchor my thesis as satirical speculation of our firmly established behavior using a phone.<br><br>\r\n\r\nAnother piece that inspired me was Artificial Defence Mechanisms by James Chambers. It is a series of electronic products that could protect themselves from threats in their environment the way animals do in nature. Instead of using practical engineering way to avoid damages, James gave products funny yet well-designed animal-like behavior to make people project stronger emotional ties onto formerly static products. His approach truly opens my mind to think about new ways of talking about the profound issue by reversing the way things typically work. I took this anthropomorphic and humorous approach as my design principle and created three products. ","technical_details":"Ultimate \"Mobile-First\" Design consists of three physical products. I utilized open source electronic components to build the functionalities. Electronic components include Arduino micro-controllers, Peltier plate, neo-pixels, stepper motors, servo motors, and LCD screen. On the fabrication wise, I used CAD software(Adobe Illustrator and Vectorworks) as the fundamental tool to design the structure and appearance of the product and utilized laser cutter and Othermill to create precise material cutting. I manually assembled different parts to create the final product.","further_reading":"<p>Ultimate \"Mobile-First\" Design consists of three products:</p>\n<p><b>Smartphone First Aid Kit</b></p>\n<p>Nomophobia (abbreviation for no-mobile-phone phobia) is one of the most common fears in today’s world. More than half of the mobile phone users are anxious when they “lose their phone,” or “run out of battery,” or “have no network coverage.” I created a medical kit for phones - Smartphone First Aid Kit to exaggerate the fear when our phone is running out of battery. Users can bring their dying phone back to life by doing CPR to their out-of-battery phone.</p>\n<p><b>Smartphone Heat Stroke Treatment Kit</b></p>\n<p>The complexity of cutting-edge smartphones is getting higher in every product cycle, as is their sensitivity to temperature. The systems of modern-day phones are nearly as complicated as our human bodies. When your phone approaches a potentially damaging temperature, the processing speed gets slower and even malfunctions. We can easily overload our phones by oversing demanding app like mobile games, or carelessly leave the phones in a car exposed under sunshine, which would lead to the “heat stroke” of the phones. Smartphone Heat Stroke Treatment Kit is another medical kit designed to cool down your overheating phone rapidly.</p>\n<p><b>i-Coffin</b></p>\n<p>Not everyone has a fancy DSLR to capture the exciting moments of life, but our phones can take care of this task. Phones know our unforgettable party times, serendipities we found on the NYC subway, whether we are a dog or a cat person. However, even if we back up photos onto cloud or computers, we never commemorate this little metal brick that takes charge of preserving our memories. Instead of being electronic waste or recycled, are there any other possibilities of the phone’s “after-life”? i-Coffin is not just a funerary box to keep the corpse of your phone. I designed it as a formal, memorial container for your outdated phone.</p>\n","tags":[{"name":"Design","slug":"design"},{"name":"Speculation","slug":"speculation"}],"video_presentation_url":"https://vimeo.com/336826222","video_documentation_url":"https://vimeo.com/335046717","project_url":"https://hauyuan.myportfolio.com/ultimate-mobile-first-design","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thesisProfilePicture-768x432-1.jpg","title":"thesisProfilePicture-768x432","alt":"hau headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thumbnailImage-1-1024x576.jpg","title":"thumbnailImage","alt":"thumbnailImage","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thesis-slidesShow-1-1024x576.jpg","title":"thesis-slidesShow-1","alt":"thesis-slidesShow-1","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thesis-slidesShow-2-1024x576.jpg","title":"thesis-slidesShow-2","alt":"thesis-slidesShow-2","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thesis-slidesShow-3-1024x576.jpg","title":"thesis-slidesShow-3","alt":"thesis-slidesShow-3","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thesis-slidesShow-4-1024x576.jpg","title":"thesis-slidesShow-4","alt":"thesis-slidesShow-4","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thesis-slidesShow-5-1024x576.jpg","title":"thesis-slidesShow-5","alt":"thesis-slidesShow-5","caption":""}]}