{"student_id":"62","student_name":"Isabella Vento","student_slug":"isabella-vento","advisor_name":"Stefani Bardin","title":"Unearthing Thread","thesis_statement":"Drawing from psychogeography, postnaturalism, and socio-spatial theory, Unearthing Thread is a research-based project that develops methods of engaging with the infrastructure networks of Manhattan. It is the genesis of a speculative and playful action that urges to be reproduced in small slices of any urban landscape.","abstract":"Unearthing Thread is an ongoing collective inquiry of the urban landscape. Through a series of participatory walks, infrastructure space is questioned. With speculative props and tools, groups of attendees become an interdependent entity. And through an archive of documentation &amp; research, the collected data becomes a poetic, digital artifact. The clauses for the happenings that have unfolded are as follows:<br><br>\r\n\r\nThis event is not tourism. <br>\r\nThis event may only be carried out as a group.  <br>\r\nThis event calls to foster attention for material and inanimate things to improve the consideration of human and nonhuman lifeforms. <br>\r\nThis event distills emergence and documents it.<br>\r\nThis event is temporary and fleeting with goals of permanence &amp; intention.<br>\r\n\r\n","context_research":"With a desire to unpack the normative narratives that govern urban dwellers’  regard towards nature, my thesis project began with an academic survey and practical exploration of Manhattan’s environment. These investigations quickly veered towards the infrastructure networks that sustain it and the life forms they govern. Additionally, I acquainted myself with artists, organisations and communities working in this context &amp; took a deep dive into perspectives on space, urbanism and ecology that pull from the humanities and performance studies. There are three practical constituents that have resulted from this research and overlap with each other to frame my inquiry; a series of collective walks, the design and selection of props to support their execution and a digital archive of the documents resulting from them.\r\n<br><br>\r\nThe Theory of the Dérive by Guy Debord has informed solitary and collective walks, and the prompts for the data collected, presented at unearthed.zone. Material elements of systems such as the steam network played as the “attractions of the terrain” that guided the limitations imposed on myself and others to imagine what is invisible and differently encounter the visible. Of particular influence on the practical elements of the thesis have been Sarah Kanouse’s Post-Naturalist Field Kit, Tryst’s Sunk Shore &amp; various works by collective SpaceHiJackers. \r\n","technical_details":"","further_reading":"<p>Having occupied urban environments for the entirety of my life, its spatial qualities have not only influenced my navigational habits but been subject to much of my contemplation. In an effort to combine these speculations with a desire to unpack &amp; dismantle the normative narratives governing humans’  regard towards nature, my thesis began with an investigation of Manhattan’s infrastructure and developed into a process reminiscent of a public art practice. There are three practical constituents that have resulted from this journey and overlap with each other to frame Unearthing Thread; a series of collective walks, the design and selection of tools to support their execution and a digital archive of the documents resulting from them.</p>\n<p>Similarly to Kate Ascher in The Works: Anatomy of the City, as I became acquainted with the infrastructure systems that sustain New York, I questioned how much city inhabitants are abreast of what supplies, routes, governs, allows, obstructs, facilitates their movements and decisions. Most communication, transport, power and waste systems of Western cities are subtly hidden from view or embedded within the margins of the capitalist paraphernalia that structure a metropolis. In addition to Ascher’s book, I assimilated much about these systems, the bodies responsible for their maintenance, and the significant amount of interdependencies that exist between them, in texts such as Ingrid Burrington’s Networks of New York or Shannon Mattern’s and Keller Easterling’s articles in the Places journal. To anchor my research and subsequent pursuits, I focused on a physical network that happens to actually be very visible to the inhabitants of New York and provides power to buildings such as the Empire State Building &amp; the MET. Even if the biggest infrastructural system of its kind in the world, and persistently present, the steam system goes largely unquestioned; I have asked many people if they are aware of its function and have often been responded to with nonchalant ignorance. To me, this is a larger metaphor for the lack of engagement that urban dwellers have with their surrounding ecosystem. I am convinced that to shift the narratives that govern how we think about the environment the notion that nature exists as separate and beyond the peripheries of a big city should be dismantled. Sarah Kanouse developed “A Post-Naturalist Fieldkit” for the urban landscape of a neighborhood in Montreal; in writing about it she states: “...learning new approaches for looking at and inhabiting the city is also necessary for the development of a more connective ecological consciousness.” (p.169) Inspired by this line of thought and practice, Unearthing Thread and the activities it instigates attempts to fulfill this by treating material things  as .</p>\n<p>I turned to the study of psychogeography and <a href=\"https://www.google.co.uk/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=1&amp;ved=2ahUKEwjqnN74sd_hAhUkm-AKHYgmBnIQFjAAegQIBBAC&amp;url=http%3A%2F%2Ftbook.constantvzw.org%2Fwp-content%2Fderivedebord.pdf&amp;usg=AOvVaw0Bc_0Xga0mBBmCvMs9zUe5\">Guy Debord’s “dérive”</a>  to direct the playtesting stage; I executed solitary dérives to learn more about infrastructure and used this practice to contextualize a workshop that functioned as the first iteration of the collective walks. The dérive is a walk, or literally a “drift”, in an urban ‘ambiance’ that may or may not spur an exploration of its spatial traits, guided by psychological impulse and emotional charge. From dérives the creation of critical or alternative maps, subversive acts, or playful investigation manifest; they grant subjective readings of a place to supersede the empirical analysis of its utilitarian nature. It has been of interest to me for two reasons; the mode of drifting as a decelerated form of pedestrian travel in opposition to the minute pace of Manhattan and for its potential to extract subjective data of infrastructure space. While ‘drifting’ I chased after infrastructural elements that in other circumstances would have remained peripheral to my attention. On the <a href=\"http://www.nyc.gov/html/dep/pdf/noise_code_guide.pdf\">NYC.gov website</a> I came across a document that listed the most common sources of noise in the city and set out to single out these auditory occurrences in the Financial District and created a score of my movements. In a previous project I performed a frolicker following prompts from traffic lights in the East Village. I visited the entirety of the perimeter of the ConEd Steam Plant on 14th street multiple times to verify what I could deduce from the perimeter of an industrial hub without actually visiting it. For this workshop I and attendants performed dérives in Astor Place, a pedestrian plaza in the East Village, that lead us to encounter faux rocks on flower beds, idle signage, mysterious vents and the likes. I defamiliarized myself with spaces that I have inhabited many times so much as to view things through another lens, and have an intimate dialogue with them.</p>\n<p>These questions refer to the labor that maintains the city’s anatomy, the decisions behind the design of public and private spaces, the history of the places I was visiting &amp; how their geography perpetuates social hierarchies. In the introduction to Extrastatecraft The Power of Infrastructure Space, Keller Easterling likens “infrastructure space” to a software:</p>\n<p>\"And while we also do not typically think of static objects and volumes in urban space as having agency, infrastructure space is doing something. Like an operating system, the medium of infrastructure space makes certain things possible and other things impossible. It is not the declared content but rather the content manager dictating the rules of the game in the urban milieu.\"</p>\n<p>She supports her claims in a chapter on disposition in which she proposes how an ‘urbanist’ may decode the activity sustained by the material agents that occupy various urban environments and emphasizes that it is in the relationships between them that one reads what infrastructure space is doing. The participatory experiences I lead and their results leaned heavily on this perceptual approach. Following my solitary experiments &amp; the mock-up workshop, I organized 5 walks in three different locations over the course of a month. The walks were executed with three to four participants. Over time, I changed a variety of variables but stayed true to this format:</p>\n<ul>\n<li>An orientation walk to encounter the space</li>\n<li>A walk to find and encounter an element in the space</li>\n<li>A discussion and the creation of a material assemblage</li>\n</ul>\n<p>In the third part of the event, I set out to physically materialise the emergence of discourse, debate, and associations. With the aid of cables, caution tape, yarn, metal wire etc. physical links were made between each participants’ element of discovery as the discussion unfolded; these verbal and active prompts hope to uncover the relationships between participants and their findings, provoking alternate awareness and curiosity of their surroundings. The results are transferred to a digital installation where I have curated and displayed the data that was gathered.</p>\n<p>To view this archive, read more about the intricacies of the process &amp; access to a comprehensive list of resources please visit unearthed.zone.</p>\n","tags":[{"name":"Art","slug":"art"},{"name":"Critical Theory Art","slug":"critical-theory-art"},{"name":"Data","slug":"data"},{"name":"Performance","slug":"performance"},{"name":"social practice","slug":"social-practice"}],"video_presentation_url":"https://vimeo.com/336817727","video_documentation_url":"","project_url":"https://unearthed.zone","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/default.png","title":"default","alt":"default","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thumbnail-17-1024x576.jpg","title":"thumbnail","alt":"thumb","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/1-4-1024x576.jpg","title":"1","alt":"touch","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/2-2-1024x576.jpg","title":"2","alt":"material","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/web-768x446-1.png","title":"web-768x446","alt":"isa's project image","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/5-768x432-1.jpg","title":"5-768x432","alt":"isa's project image","caption":""}]}