{"student_id":"63","student_name":"Itay Niv","student_slug":"itay-niv","advisor_name":"Nancy Hechinger","title":"Let's Read A Story","thesis_statement":"My thesis project, Let’s Read A Story, is a speculative exploration on how computers and technology can turn story time into a conversation between parents, children and a computer. Human gestures -- speaking, drawing, typing – allows the reader to participate in a new form of conversation on a smart device (tablet or a smart speaker) that yields a surprising new story.\r\n\r\n","abstract":"Technology and smart devices are ever present in children’s everyday lives and their development. Let’s Read A Story investigates the possibilities of enhancing storytime for children with a Machine Learning-based program to engaging a child's creativity, imagination, and inventiveness. The program is intended to be an activity joined by parents and child.\r\n<br><br>\r\nThe project addresses the following questions: \r\n1. can technology augment how parents read and tell stories to children? \r\n2. Can a child interact with a piece of technology to create a meaningful connection through literature, sound and visual art? \r\n<br><br>\r\nUsing recently possible machine learning techniques, various children’s literature corpuses have been analyzed in order to build a conversational platform that allows the reader to navigate through different narrative bits and pieces to weave a new, original immersive story of his own. The core of the experience is in the form of generated text that is a response or an answer to a human gesture (e.g speaking or drawing). The text is the first layer that carries the plot progression forward, on top of which, layers of generative sound and illustration are formed to enhance the text and based on various predictive models.\r\n<br><br>\r\nLastly, the reader can change and bend the story as it progresses, drawing illustrations of their own and changing lines of text as their heart desires.\r\n","context_research":"The rise in popularity of smart devices and speakers has increased exponentially in recent years. \r\nNext year, on average, each American household will have a smart device like the amazon Alexa or Google Home. \r\nKids are talking to technology and technology is starting to talk back.\r\n<br><br>\r\nAdvancements in NLP offer accurate semantic understanding in natural language. In natural language processing tasks, an essential part of the research (and what requires an enormous amount of effort) is to convert text data into vectors. In that manner, it’s easier for a computer to then process and analyze the text. The publicly available pre-trained model, Universal Sentence Encoder, enables users to encode corpuses of text (i.e. both sentences and whole paragraphs) into high dimensional vectors that can be used for text classification, semantic similarity, clustering, and other natural language tasks. \r\n<br><br>\r\nThe Quick! Draw dataset is a dataset of millions of drawings collected from users playing Quick! Draw. These doodles are a unique data set that helps developers train new neural networks, enable them to see patterns in how people around the world draw, and to encourage artists to create things never before imagined.\r\n<br><br>\r\n“Nothing is more important than the impact of parents and others who take care of the child; second in importance is our cultural heritage, when transmitted to the child in the right manner. When children are young, it is literature that carries such information best.” -- Bruno Bettelheim\r\n<br><br>\r\nAesop's Fables, is a collection of fables credited to Aesop, a slave and storyteller who lived in ancient Greece in 620 BCE. Initially the fables were addressed to adults containing social themes, and ethical guides. From the Renaissance onwards they were particularly used for the education of children. Each fable contains: <br>\r\n1. A short title, usually very descriptive of the story’s content and characters.<br>\r\n2. The story itself, usually no more than 30 sentences.<br>\r\n3. The moral of the story, usually contains a metaphor built on the inherent nature or trait of the animals in the story.\r\n","technical_details":"Collecting and Cleaning the data - python tools<br>\r\nVoice parsing - chrome speech to text API<br>\r\nVoice synthesis - chrome Speech Synthesis API<br>\r\nUniversal Sentence Encoder - similarity embedding.<br>\r\nVector retrieval from original story - node, ml5<br>\r\nStory Generation - server side node<br>\r\nMusic enhancement - tone.js / sentiment analysis<br>\r\nIllustration - SketchRNN + Quick! Draw dataset<br>\r\nAdditional Illustration collected by a proprietary software<br>\r\nInterface and Design - javascript<br>\r\n","further_reading":"<p>https://towardsdatascience.com/lets-read-a-story-a-study-on-storytelling-for-children-using-machine-learning-tools-1b631bbbffac</p>\n","tags":[{"name":"Animation","slug":"animation"},{"name":"Education","slug":"education"},{"name":"Machine Learning","slug":"machine-learning"},{"name":"Narrative/Storytelling","slug":"narrative-storytelling"},{"name":"Python","slug":"python"},{"name":"Software","slug":"software"},{"name":"Speech","slug":"speech"}],"video_presentation_url":"https://vimeo.com/337313905","video_documentation_url":"https://vimeo.com/itayniv/lets-read-a-story","project_url":"https://www.letsreadastory.xyz","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/profile-01-1.jpg","title":"profile-01","alt":"Itay's profile image","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/header_image-1024x576.jpg","title":"header_image","alt":"itay","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/header_image-1024x576.jpg","title":"header_image","alt":"itay","caption":""}]}