{"student_id":"65","student_name":"Jarone Wright","student_slug":"jarone-wright","advisor_name":"Kathleen Stevens Wilson","title":"In Panes","thesis_statement":"Exploration of kiln-glass and light to make images. I’ve experimented with creating interactive glass sculptures that can be used to make paintings with light.","abstract":"In Panes is a series of glass sculptures that encourage user exploration with light. The transmissive and reflective properties of glass is used to create multi-dimensional images when illuminated. Viewers are empowered to explore and change the sculpture by manipulating the lights provided.<br><br>\r\n\r\nGlass art is seen as fragile and rigid, something stuck in a moment of time. I encourage viewers to break through the “Pane” and manipulate the composition as they explore the pieces. Several pieces have been created for display, each a different experiment in form, color and transparency.<br><br>\r\n\r\nGlass is a versatile medium but not often utilized in the creative technology field. Why is this and how can we encourage people to view glass in a new light? Various methods of fusing kiln-glass and coldworking have been examined as part of this experiment.","context_research":"For my thesis I wanted to work with a material that requires an artistic touch. While I’ve done work in acrylic, in particular, sculptures made from laser cut acrylic sheets, there was a degree of separation I wanted to remove. Working with glass is a fun but frustratingly unforgiving artform, which is part of the reason I named this thesis “In Panes”.<br><br>\r\n\r\nTo know what I was getting into I researched contemporary glass artists, either for the unique sculptural techniques or meaningful incorporation of technology. Artists such as Michelle Jader, Jed Malitz and Dustin Yellin were good sources of inspiration. Michelle and Jed’s work involves directly stacking layers of acrylic sheets to make pieces, and their pieces have a unique identity and visual language. I hope to develop an art fingerprint like that. In Dustin’s work, He is able to capture a moment in time while being visually dynamic. Being able to view from multiple angles adds to it. I would like to give my work depth even though the starting materials are 2-dimensional.<br><br>\r\n\r\nI also was inspired by an exhibit at LACMA called 3D Double Vision. This exhibit showed the history of 3D art and most of it involves tricking the mind to interpret a perspective that isn’t physically there.<br><br>\r\n\r\nI then took various lessons at UrbanGlass, which is a multi-specialty glass studio. After that and speaking to many glass artists and retailers, I started learning more. But more importantly I started feeling like a member of the glass art community.<br><br>\r\n\r\nFor my user testing, I will exhibit the glass sculptures and allow the viewers to inspect, play and analyze the pieces by only manipulating the light sources. My intention is to make light their hands. At the same time I want to avoid direct physical interactions with the glass which may damage the pieces and harm the viewer.","technical_details":"","further_reading":"","tags":[{"name":"Art","slug":"art"},{"name":"Design","slug":"design"},{"name":"Education","slug":"education"},{"name":"Sculpture","slug":"sculpture"},{"name":"Visual","slug":"visual"}],"video_presentation_url":"https://vimeo.com/336836549","video_documentation_url":"","project_url":"http://jarone.net","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Headshot-768x432-1.jpg","title":"Headshot-768x432","alt":"jarone portrait","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Proj_Thumbnail-1024x576.jpg","title":"Proj_Thumbnail","alt":"Transparent blue glass prism","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/InPanes01-1024x683.jpg","title":"InPanes01","alt":"Transparent blue glass prism with sunlight","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/InPanes03-1024x683.jpg","title":"InPanes03","alt":"Glass sheet with multiple rows of gradients repeated","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/InPanes02-1024x683.jpg","title":"InPanes02","alt":"hand holding a dark blue rectangular prism piece.","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/DSC_0758-1024x680.jpg","title":"DSC_0758","alt":"Blue Glass rectangular prism piece with dark round shape in middle.","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slideshow5-2-1024x683.jpg","title":"slideshow5","alt":"thin vertical stripes in glass, cobalt, clear and blue.","caption":""}]}