{"student_id":"67","student_name":"Joohyun Park","student_slug":"joohyun-park","advisor_name":"Gregory Shakar","title":"Unknown Universe","thesis_statement":"Unknown Universe is an aesthetic web VR experience of an imagined world beyond the observable universe.","abstract":"The way our universe is designed and unfolding resonates with me. As an artist and as an engineer, I view the indefiniteness of the universe as highly potential. Yes, most part of our universe remains unresolved. And that’s where Unknown Universe starts from. <br><br>\r\n\r\nThe Unknown Universe is a web VR exploration aimed at people with a strong curiosity to the outer world. Amongst different terms, I describe this project as a web art. I would like to invite you to the cosmic world I imagine. It is the multidimensional scene with hidden interaction. Also, the aesthetic experience delivered through technology-driven expression. <br><br>\r\n\r\nWhat is out there?  While fully addressing it will require a significant amount of time, I hope Unknown Universe takes us one step closer to wonders of the universe.","context_research":"My research concentration as an artist was to make the experience visually engaging with a little touch of sound. All components should be delineated in a creative and distinctive context, but at the same time, they must reflect the reality to some extent. I tried to get resource from diverse areas and frame them subtly. The inspiration for each part is as follow. <br><br>\r\n\r\n- Narrative: NASA Exoplanet Archive, Michio Kaku, Stephen Hawking, Carl Sagan, Arthur C. Clarke, René Magritte, Planet Earth (BBC)<br>\r\n- Visual: NASA Hubble Space Telescope Images, Wonders of the Universe (BBC), Hans Zimmer, Max Richter<br>\r\n- Sound: Symphonies of the Planets (Nasa Voyager Recordings), NASA Sound Library\r\n<br><br>\r\nAs an engineer, my research focus was implementing the accessible VR experience, state-based interaction aligned with narrative, and suitable use of high-performance web graphics. Although the outcome was excluded for the final version, research on sound generation process using neural networks (NSynth, WaveNet, Sample RNN) has been done in the early stage of the project for pursuing additional possibilities. \r\n","technical_details":"The Unknown Universe is built upon A-Frame for web-based VR experience. For creating visual components inside the scene, A-Frame Particle System, Three.js, and WebGL are used. For state management, Watch.js and p5.js are to communicate between the audience’s state and the scene components. Lastly, Howler.js with Web Audio API is used to selectively trigger the background sound.","further_reading":"","tags":[{"name":"Art","slug":"art"}],"video_presentation_url":"https://vimeo.com/336826412","video_documentation_url":"","project_url":"https://unknownuniverse.parkjoohyun.com/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/jhp-1.jpg","title":"jhp","alt":"jhp","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/UU-Thumbnail-1024x576.jpg","title":"Unknown Universe","alt":"Unknown Universe","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/scenee-1024x576.png","title":"Unknown Universe","alt":"Unknown Universe","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/scene2-1024x576.png","title":"Unknown Universe","alt":"Unknown Universe","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/scene-1024x576.png","title":"Unknown Universe","alt":"Unknown Universe","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/sss-1024x576.png","title":"Unknown Universe","alt":"unknown universe","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/sceneee-1024x576.png","title":"Unknown Universe","alt":"unknown universe","caption":""}]}