{"student_id":"70","student_name":"Jesse Simpson","student_slug":"jesse-simpson","advisor_name":"Gregory Shakar","title":"LIME: Light Interface for Musical Expression","thesis_statement":"LIME is a patchable device that provides the user with a platform for using light as a control medium for musical expression. Through a combination of lighting, sensors, fiber optic patch cables, and processing units, the system allows the user to design cable flows which generate and modulate light patterns before translating the patterned light into musical events interpreted by computer-based virtual instruments and effects.","abstract":"Over the past 80 years, electronics, especially computers, have had a massive impact upon the ways that music is created. In more recent years, technologies have introduced incredible new capabilities, however, these have often come at the cost of increased complexity and a growing level of abstraction between the sounds that are made and the signals used to create them. This phenomena has created some disconnect between performers and the audience as the connection between gestures on stage and the sounds that are heard become increasingly dissociated. A prime example of this can be seen in modular synthesizers where even the player can become confused by the intricate, yet abstract, programming of the instruments, especially on-stage.<br><br>\r\n\r\nBut, what if audio signals could be made visible while they’re communicating?  Could patch cables that expose the underlying signal patterns improve one’s comprehension of their compositions or, perhaps, enhance the experience of composing as well as viewing?  LIME is a response to these questions by offering a semi-modular system for using light as a control medium in musical expression. Where modular synthesizers generate and modulate raw audio, LIME operates in the computer space utilizing the MIDI protocol.  Through a combination of lighting, sensors, fiber optic patch cables, and processing units, the system allows the user to design signal flows made of light patterns which are then translated into sound. The patch cables provide real-time views into the signal flows as they pass between different modules. The pulsing and breathing light visualizes the signal flow in a physical form.  As a composer or performer, this visual component is useful in that it allows for quickly understanding how a signal is affected by different modules and how it fits into a larger musical piece. Another benefit comes in the form of reduced error and easier troubleshooting. While computer software allows for internal signal routing, it can quickly lead to extremely complex scenarios with confusion abound. The physical interaction of ‘patching’ from point to point provides a more tangible understanding of the connections as they are formed. Unfortunately, as patches grow, they too can become a chaotic mess of wires with little ability to quickly discern the meaning of individual connections. With LIME, signal generators, processors, and inputs are combinable to compose sounds and rhythms while simultaneously providing the path taken to achieve them, visually.","context_research":"Light is not an unexplored medium in musical expression.  In 1734, Jesuit priest, Father Louis-Bertrand Castel is largely cited as having developed the first documented visual music tool, the Clavecin Oculaire (Ocular Harpsicord).  It was comprised of a harpsichord paired with colored stained glass revealed in unison with each note.  In 1754, a second model was designed specifically for allowing candlelight to pass through the colored panes.  Two centuries later, in 1915, Russian Composer Alexander Scriabin’s symphony, ‘Prometheus: Poem of Fire’ debuted in New York City, centering around a light organ displaying a tone to color mapping system based on the circle of 5ths; a geometric tonal relationship map used within music theory for describing the chromatic scale.  A different, yet notable approach can be seen in light theremins; a common example implemented using easily accessible electronic components where a user controls the pitch and volume of an audio signal with their hands through blocking or allowing desired amounts of light to the sensors.  This same approach can be seen in many commercially available synthesizers as well.  LIME is the result of harnessing this simple technique and combining it with controlled, physical routing modeled after modular synthesis.\r\n<br><br>\r\nWhile musical patching largely emerged in analog synthesizers in the 1960s, tangible patching is less frequently seen in the digital world of physical software controllers.  While DIY projects exist such as TaViPaCo: Tangible Virtual Patch Cords, there are no commercial products to bridge the worlds of physical patching and digital sound synthesis.  With the growing popularity of node-based audio programming in software such as Audiomulch, Max/MSP, Puredata, and others, a physical controller modeled after computer-based programming is appealing.  \r\n <br><br>\r\nVisual accompaniment has become a mainstay of electronic music performance.  The synesthetic qualities provided by audiovisual performance provide deeper context to the human mind. One series of studies suggests that “variation in visual accompaniment (e.g. animated narrative story video, abstract animated video, musician performance video, no-video control) influenced the way music was effectively interpreted and cognitively perceived” amongst the participants. LIME provides an approach to simplifying signal flow perception, and enhancing tangible interaction with digital media, thus creating a compelling Light Interface for Musical Expression.  \r\n","technical_details":"Hardware Used:<br>\r\nArduino/Teensy Microcontrollers<br>\r\nCustom PCB Designs<br>\r\nCustom Enclosure Designs<br>\r\n3d Printed Parts<br><br>\r\n\r\nSoftware Used:<br>\r\nCustom Software<br>\r\n-C++ Host Application for receiving data from physical device<br>\r\n-Adafruit NeoTrellis Library<br>\r\n-Wire Library for i2c<br>\r\nMax/MSP Host Application for turning signals into sounds<br>\r\nRhino <br>\r\nEagle<br><br>\r\n\r\nTools Used:<br>\r\nOtherMill and PCB FabLab<br>\r\nLaser Cutters<br>\r\n3D Printers\r\n","further_reading":"","tags":[{"name":"Music","slug":"music"},{"name":"Product Design","slug":"product-design"},{"name":"Sound","slug":"sound"},{"name":"Tool","slug":"tool"}],"video_presentation_url":"https://vimeo.com/336826498","video_documentation_url":"https://vimeo.com/331523790","project_url":"https://www.jesse-simpson.com/LIME","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/2H6A0006-edit-768x513-1.jpg","title":"2H6A0006-edit-768x513","alt":"jesse headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/aldenOnLime-for-archive-2-1024x556.jpg","title":"aldenOnLime - for archive 2","alt":"A hand is seen going to grab one of the cables in that is inserted into an input port. The other hand is seen adjusting a knob","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/LIMEgif1-under5.gif","title":"LIMEgif1 - under5","alt":"Lime Playing","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/LIMEgif2-under5.gif","title":"LIMEgif2 - under5","alt":"lime instrument","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/LIMEgif3-under5.gif","title":"LIMEgif3 - under5","alt":"Lime gif","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/patching-1024x640.jpg","title":"patching","alt":"The user is preparing to patch the LIME device and the cables are already patched with some illuminated","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/unnamed-1-1-1024x557.png","title":"unnamed (1)","alt":"playing nime","caption":""}]}