{"student_id":"71","student_name":"Jason S Yung","student_slug":"jason-s-yung","advisor_name":"Nancy Hechinger","title":"Conjunctio","thesis_statement":"My thesis presents milestones from my ongoing investigation into the use of light as an expressive medium for art. To this end, I have created an object that uses projected light, shadow and movement to generate a complex and dynamic light sculpture. ","abstract":"Sometimes one moment of inspiration takes years to unpack. For me, this moment came when I saw how a bent LED strip looked behind a large piece of paper, creating beautiful interplays of light, arching shadows and gradients. Two years at ITP gave me the means to truly explore this insight and push my understanding of the medium of light.<br><br>\r\n\r\nAt ITP, it was not just my technical skills on LEDs and electricity that grew, but it was what I saw in the light that also grew. Danny Rozin remarked once that there seemed to be two types of light in my work: smart and dumb light.  “Smart light” is when it is the information in the light pattern itself that creates form, e.g. how differences of paint colors create a line. “Dumb light” is where the information was not in the light itself but in the darkness, as  when an object in front of a lamp creates shadow. Then, the resulting form is not just due to the light alone, but a co-creation of the light and the darkness. It’s not just the light that creates form -- but also the controlled application of darkness. It is the insight of “dumb light” that my thesis unpacks and builds upon. \r\n<br><br>\r\nMore broadly, my thesis signifies new directions for my light work: from 2D light painting to 3D light sculpture; from the motion of LEDs animation to the motion of stepper motors controlling the shaft of light. \r\n<br><br>\r\nMy thesis also embodies my new understanding of light as a field of possibility that doesn't need to stay on a 2D surface like a painting, but rather the light exists as a field of possibility that can be caught and volumized in different ways. ","context_research":"My major artistic influences are Mark Rothko, James Turrell and Thomas Wilfred: Rothko for his color field paintings that expressed both simplicity and complexity at the same time, and Turrell for his innovations that showed light as no one had ever seen it before.For my thesis the major , major influence is Thomas Wilfred, who pioneered light art back in the 1920s through his “lumia”. I became aware that my light/shadow work was a different path to the same esthetic garden. <br><br>\r\n\r\nMy major influence on concepts/esthetics is the book Art As Experience by John Dewey and his generation theory of art’s value in human life for it’s reconciliatory qualities through the human psychological projection system.\r\n<br><br>\r\nMy major influences on my technical work are: <br>\r\n-Danny Rozin for his approach to design and construction, and his mentality of solving different problems at different stages of design. <br>\r\n-Ben Light for his “make life easier for yourself” approach<br>\r\n-Barak Hemou for his exploration of projective surfaces, modular design ethnic and practical no-nonsense approach to component procurement. <br><br>\r\n\r\nUnderlying it all is my interest in the mysterious aspect of light as a substance, the “thingness of light itself”, as James Turrell says. Light as primordial element, the common thread that ties together religion, science and the beautiful way Washington Square Park looks like at dusk. \r\n<br><br>\r\nMy thesis is entitled Conjunctio, which means \"conjunction\" in latin and is a term taken from medieval alchemy. In alchemy, the conjunction was the part of the alchemical opus when the opposites were united. For me, the control of darkness and combination with light is the conjunction that allowed for this new direction of light sculpture for me.\r\n","technical_details":"materials: acrylic, stepper motors, arduino nano, WS2812B led strip, 3d printed parts, bamboo (container store)","further_reading":"","tags":[{"name":"Art","slug":"art"}],"video_presentation_url":"https://vimeo.com/337313962","video_documentation_url":"https://vimeo.com/332128030","project_url":"","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/jason.jpeg","title":"jason","alt":"jason headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/2H6A9406.MOV.04_53_37_07.Still001-1024x576.jpg","title":"2H6A9406.MOV.04_53_37_07.Still001","alt":"main box","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/1O3A9994-1024x683.jpg","title":"1O3A9994","alt":"color field","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/2H6A9404.MOV.04_48_30_12.Still001-1024x576.jpg","title":"2H6A9404.MOV.04_48_30_12.Still001","alt":"white on white","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/2H6A9404.MOV.04_52_04_16.Still003-1024x576.jpg","title":"2H6A9404.MOV.04_52_04_16.Still003","alt":"side very red","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/1O3A9951-1024x683.jpg","title":"1O3A9951","alt":"red on blue","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/2H6A9404.MOV.04_52_35_18.Still002-1024x576.jpg","title":"2H6A9404.MOV.04_52_35_18.Still002","alt":"side red","caption":""}]}