{"student_id":"73","student_name":"Jenna Xu","student_slug":"jenna-xu","advisor_name":"Adaora Udoji","title":"Self-Portrait as Allegory of","thesis_statement":"To this day, “learned helplessness” is still the most insidious vestige of my history with depression, quietly limiting my sense of self, capability, and possibility. \"Self-Portrait as Allegory of\" is my act of resistance: a data-driven, machine-managed, mental health maintenance system that aims not only to mitigate the pain points of recovery, but restore my sense of agency.","abstract":"Adapting the conceptual format and title of an Artemisia Gentileschi painting from 1638–39, my thesis is at once a self-portrait as depicted by personal data and predictive models, as well as an allegory to an amalgamation of scientific, cultural, and personal ideals of mental health. <br><br>\r\n\r\nIn construction, \"Self-Portrait as Allegory of\" comprises three systems: data collection by a body of trackers I built to collect behavioral metrics; mood prediction by a suite of neural networks that use this data to predict my mood, morale, stress, and fatigue levels; and intervention by a noninteractive voice assistant that responds to these predictions by directing me to perform mood-improving interventions and rituals that, taken together, form a lifestyle shift that optimizes for mental health.\r\n<br><br>\r\nIn manifestation, the project stems from the last system as an n-of-one experiment: a data-driven, tech-directed performance of a composite aspiration comprising optimizations from positive psychology, the wellness industry, self-care culture, the female-empowerment zeitgeist, and my own romanticism of past, present, and future lives forever shaped, stagnated, and propelled by my history with depression. Synthesized into actionable interventions and rituals, these frameworks form the body of allegorical symbolism for idealized mental health, which I perform throughout the day as the system sees fit. The mere act of embodying these ideals allows me to not only live them in the present but also write them into my narrative of the future.\r\n<br><br>\r\nBy transforming mental health maintenance—normally a consciously effortful, continuous act of self-discipline—into a simple performance of externally mandated instruction, my thesis aims to render irrelevant some of the most insidious and persistent depressive symptoms—learned helplessness and fixed mindset—by removing willpower, decision-making, and constant emotional monitoring out of the daily work of self-care and recovery. ","context_research":"The data-collection phase was inspired by research projects and businesses rooted in the field of psychology, in particular trackyourhappiness, a doctoral research project from Harvard that identifies daily patterns associated with happiness; the PHQ-9, a self-reported depression-diagnostic standard; Mindstrong, a company headed by researchers looking at which markers of smartphone usage predict mental illness; and Exist, which links many of your apps to find correlations in behavior.\r\n<br><br>\r\nThe mood-prediction phase consisted of machine learning research and experiments, with guidance from fellow cohort Jim Schmitz and the tutorials of Jason Brownlee.\r\n<br><br>\r\nThe intervention phase was also deeply inspired by psychology, as well as by wellness culture. Examples include You Feel Like Shit, an interactive self-care flow chart; the Headspace app, which offers exercises tailored for nearly every mood possible; Berkeley’s Greater Good Science Center and its spin-off project, Greater Good in Action, a repository of practical applications for its research findings on mental health and wellness; and UPenn’s positive psychology MOOCs.\r\n<br><br>\r\nMy rituals mostly replicate certain aspects of my traveler’s lifestyle that resurrected me years ago: namely, frequent exposure to new situations, experiences, and people. While I borrowed from references like the now-famous paper \"The Experimental Generation of Interpersonal Closeness\", and the public event Skip the Small Talk, these rituals are mainly anchored in the idea of randomness as a way to push past self-limiting boundaries reinforced by routine and narratives of “personality.” A conversation with Max Hawkins about his work on randomized living helped to coalesce this idea.","technical_details":"For the data collection phase, I built three trackers in python and one in javascript; these trackers have been collecting data and posting hourly for the past year.<br><br>\r\n\r\nThe second phase was mood prediction, where I used all this data to train recurrent neural networks to predict scores for mood, morale, stress, and fatigue. These predictive models update their predictions as the data from the trackers come in.\r\n<br><br>\r\nThe third phase was intervention, in which node scripts running on a Raspberry Pi Zero W read these predictions and speak instructions for an intervention if deemed necessary.","further_reading":"","tags":[{"name":"Data","slug":"data"},{"name":"Experiment","slug":"experiment"},{"name":"Machine Learning","slug":"machine-learning"},{"name":"Self-care","slug":"self-care"},{"name":"Speculation","slug":"speculation"}],"video_presentation_url":"https://vimeo.com/336817760","video_documentation_url":"https://vimeo.com/331318826","project_url":"https://xujenna.com/allegoryOf/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/headshot_xu-768x432-1.jpg","title":"headshot_xu-768x432","alt":"jenna headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/cover-1024x574.png","title":"self-portrait as allegory of","alt":"style transfer from Artemisia Gentileschi's Self Portrait as the Allegory of Painting","caption":"style transfer from Artemisia Gentileschi's Self Portrait as the Allegory of Painting"},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2018-10-13-at-1.15.47-PM-1024x640.png","title":"data collection - trackers","alt":"data collection - trackers","caption":"data collection - trackers"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/fitterhappier-1024x682.jpg","title":"Fitter Happier","alt":"Fitter Happier - voice assistant","caption":"Fitter Happier - voice assistant"}]}