{"student_id":"74","student_name":"Jillian Zhong","student_slug":"jillian-zhong","advisor_name":"Adaora Udoji","title":"Person Thing #1-3","thesis_statement":"In the West and the racialization it imposes on the other, East Asian American women or the “yellow woman” exist as people that live as objects. Composed of a series of three pieces made from different mediums, this project explores the race-making logic used to depict east asian femininity in Western visual culture and examines the artist’s relations to them.","abstract":"On the topic of East Asian femininity in Western visual culture, Anne Anlin Cheng writes, “We have roughly marshalled this vast and tenacious history under a broad heuristic that we might roughly label “Oriental female objectification,” refracted through the lenses of commodity and sexual fetishism. Yet we barely know how to process the political, racial, and ontic complications of confronting a human figure that emerges as and through ornament.” This project aims to explore that elusive gray area in between “thing” and “person” by specifically playing with the visual language used in science fiction media to depict both futuristic and atavistic concepts.\r\n<br><br>\r\nPerson Thing #1-3 is a series of experiments where I attempt to create representations of the yellow woman using synthetic and immaterial mediums and examine my relationship with my creations. Will I see my creations as another object? Or as a clone of myself? A new separate being?<br><br>\r\nEach piece is a depiction of a body or a person using synthetic materials ranging from the physical, to the digital, and to the non-visual. The first piece is a sculptural dress made from acrylic and multiple speakers that are connected to portable media playing devices. This dress depicts a body informed by media and does not need a human wearer to feel lifelike. The second piece is a synthetic ghost figure that carries presence despite only being viewable through augmented reality. The third piece is an “hacked” chatbot that tells it’s own story of transitioning from a human computer programmer to an AI.<br><br>\r\n\r\nI designed this project around my research process that started from my own interest in understanding the racialization imposed on me. Rather than create an educational or awareness tool, I decided to frame these pieces as experiments, intimately working with asian femininity in Western visual culture and specifically focusing on techno-orientalism and Japanese animation in the West. This focus is influenced by my experiences growing up as an Chinese American in the 2000s and my career as a programmer.","context_research":"My research was informed by the works of Anne Anlin Cheng, specifically The Melancholy of Race (2000) and Ornamentalism (2018). I was also influenced by “The Cyborg Manifesto” by Donna Haraway and the sculptures of Lee Bul. The garment design was inspired by the Alexander McQueen’s 1999 S/S collection for Givenchy and Paco Rabanne’s modular dresses. The “hacked” chatbot narrative was inspired by the design of Lily, a Chinese language assistant, and its Kickstarter campaign. Overall, the research for this project encompasses all the media references I’ve collected over the years, across different mediums.","technical_details":"","further_reading":"","tags":[{"name":"3D","slug":"3d"},{"name":"Art","slug":"art"},{"name":"Culture","slug":"culture"},{"name":"Identity","slug":"identity"},{"name":"VR/AR/Immersive","slug":"vr-ar-immersive"}],"video_presentation_url":"https://vimeo.com/336817793","video_documentation_url":"https://vimeo.com/330901057","project_url":"http://blog.jzhong.today/Thesis-Final-Documentation/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/jillian_portrait2_16x9-169x300-1.jpg","title":"jillian_portrait2_16x9-169x300","alt":"jillian headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thumbnail-19-1024x576.jpg","title":"thumbnail","alt":"person thing #1-3","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slideshow_top-1024x576.jpg","title":"slideshow_top","alt":"person thing #1","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slideshow_ar-1024x576.jpg","title":"slideshow_ar","alt":"person thing #2","caption":""}]}