{"student_id":"75","student_name":"Jiyao Zhang","student_slug":"jiyao-zhang","advisor_name":"Nancy Hechinger","title":"A Vociferous Silence","thesis_statement":"“A Vociferous Silence” is a series of reactive masks that attempt to address the complexity of one’s self-concept and self-appraisal by presenting multiple aspects of inner voices.","abstract":"Visitors are invited to put their faces into the masks and cover their ears. A voice is heard through bone conduction, activated by physical touch. What the user hears creates the illusion of having a voice in their head. The narration reveals different aspects of my own self-image. Each mask focuses on one of the following aspects: negativity, positivity, and uncertainty. \r\n<br><br>\r\nAs our filters for Reality, how we see ourselves influence everything we do or say, everything we feel, or otherwise perceive. In a sense, one’s perception of others is actually a reflection of oneself. \r\n<br><br>\r\nThus, I see “A Vociferous Silence” as a VR piece as well but a different kind of virtual, where the experiencer is forced to become another person by wearing a new face and listen to a new self-image. \r\n<br><br>\r\nI have two goals for this project. First, I want to discover the unknown me, with whom I barely communicate but am always influenced by: the hidden character behind the face in the mirror that thinks, dreams, talks, feels and believes. Second, I hope that other people who share similar experiences will come to know that they aren't alone, and, I hope that will be comforting.","context_research":"Self-image is the emotional judgment we make of our self-worth. We assess ourselves continually and the inner voices become a part of the expression for the assessment. A positive self-image leads to confidence and self-acceptance. A negative self-image leads to a sense of inferiority and even depression.\r\n<br><br>\r\nThis has been a deep enduring problem for me, so I hope that this project can help not only me but also people like me. I started the project by talking to Ikuko Acosta, an art therapist and art therapy educator, who explained why the creative process is sometimes a good for people to heal: it requires a long period of time for them to continuously revisit their past and issues. And then, I reached out to others who share similar experiences to me and learned from their stories and feelings. After all the talks and interviews, I immersed myself into different kinds of books and studies. \r\nThe research process helped me to decide the media and interaction of my thesis: masks using bone conduction that reveals inner voices.\r\n<br><br>\r\nHaving no experience in making masks or sculptures, I encountered countless problems making this project happen. Thanks to Robert Benevides, a special effects make-up artist and educator, who showed me the way in, I tried different materials and techniques that eventually helped me make the idea more compelling.\r\n<br><br>\r\nI’m curious about people’s opinions on this project and I wonder if the new self-image visitors perceive affects the way they think. Does the negativity make them depressed? Does the positivity cheer them up? Do any of the aspects reflect their own journey of communicating with themselves?\r\n<br><br>\r\nThis project is the beginning of my investigation into one’s self-concept. How does this topic influence and shape individuals? How can we use different media to present it?","technical_details":"The interaction is activated by an optical sensor and then the bone conductor touching visitor’s chaw produces the sound which creates the illusion of having a voice in their head. I tested different kinds of material and technics to finalize the physical appearance of this project.","further_reading":"","tags":[{"name":"Identity","slug":"identity"},{"name":"Installation","slug":"installation"},{"name":"Narrative/Storytelling","slug":"narrative-storytelling"},{"name":"Sculpture","slug":"sculpture"},{"name":"VR/AR/Immersive","slug":"vr-ar-immersive"}],"video_presentation_url":"https://vimeo.com/337314015","video_documentation_url":"https://vimeo.com/334329052/81b45f63cf","project_url":"","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/picture-1-768x432-1.jpg","title":"picture-1-768x432","alt":"jiyao headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/1-5-1024x576.jpg","title":"1","alt":"project overview","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide_2-1024x576.jpg","title":"slide_2","alt":"side look","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide_3-1024x576.jpg","title":"slide_3","alt":"user pic","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide_5-1-1024x576.jpg","title":"slide_5","alt":"user pic","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide_1-1024x576.jpg","title":"slide_1","alt":"chin rest","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slide_4-1024x576.jpg","title":"slide_4","alt":"stand","caption":""}]}