{"student_id":"76","student_name":"Kellee D Massey","student_slug":"kellee-d-massey","advisor_name":"Nancy Hechinger","title":"The Field Guide to the Black Experience","thesis_statement":"The aim of this auditory sound walk through Harlem, is to give others an insight to the experiences that Black people have as they navigate their world. These experiences are told in the form of auditory conversations and narratives, told by the people I interviewed, in their own voices.  ","abstract":"I’m investigating the experiences black children and young adults have as they learn to navigate their world. Specifically, building a narrative around ‘the talk’, police brutality, navigating environments, and situations dealing with authority figures.<br><br>\r\n\r\nThe Talk, narrowly defined, is a conversation Black parents/parental figures have with their children to tell them how to act when dealing with police/authority figures, in the hope that they come home alive at the end of the encounter.  More broadly, the talk can encompass other situations that, as Black people, we have to consider to navigate the world we live in.  The conversations found in the field guide, often begin with the talk and continue into a broader range of conversation.  \r\n<br><br>\r\nThese conversations will be heard while a person walks through Harlem.  By having the user listen to people telling their own stories, while walking through a neighborhood steeped in Black history, it is my hope to not only engage the user, but also to bring about a sense of empathy.  \r\n<br><br>\r\nThese conversations are honest, raw, and deal with sensitive topics that can be upsetting to some people.  Still, I feel like these conversations are important to have in the hopes of starting conversations. \r\n<br><br>\r\nThere will also be a call to action section that will give the audience resources on steps that they can take to be more aware of what’s going on around them, and how to be better allies. \r\n","context_research":"My research has been a combination of readings, museum visits, interviews, watching news clips, and exploring technologies that could be used to tell a narrative. I’ve looked at VR and 360 video projects, as well as listened to audio guides(sound walks), and podcasts. <br><br>\r\n\r\nSimilar projects that I looked at initially VR projects, as I was initially hoping to do a VR project.  Even with the pivot to an audio piece, I feel that those projects are still relevant based on the topics, and the way they handled the subject matter. \r\n<br><br>\r\n‘The Talk: Race in America’ is an example of this.  It covers a very timely and sensitive topic with vulnerability and care.  These are stories and experiences that are difficult to tell and hear, and while it could be easy to turn it into a sad and depressive piece, there’s a underlying theme of resilience. \r\n","technical_details":"","further_reading":"<p>Personal Statement:</p>\n<p>This project grew out of a proposal assignment I did in Socially Engaged Art and Digital Practice.  I’d been casting about for a project that I felt strongly about. Something that dealt with social justice, and art, allowing me to make something that meant something.  On October 12, 2018, I read that although a Chicago police officer had fatally shot an unarmed teenager in the back of the head in 2012, he’d recently been acquitted of any wrongdoing, and would be allowed to remain on the force. At the time, it seemed as if I couldn’t turn around without hearing something in the news cycle about a police shooting.  Black and brown people dying at the hands of the police seemed to happen with such a frequency that I almost felt numb when thinking about it.</p>\n<p>When I spoke to some of my white friends, they didn’t understand my concerns and fears about dealing with police officers as authority figures.  Comments such as “not all police officers” or “if he’d only followed orders, he’d be alive now” felt as if they weren’t even attempting to see things from outside of their limited, and privileged world views.</p>\n<p>One of the things I’ve found as someone who’s constantly engaging in social media, is that Black people, People of Color, and women, are often forced to justify our lived experiences.  We’re constantly fighting to have people hear our experiences, while at the same time, not trying to come across as (in my case), an “angry Black woman”.</p>\n<p>In 2003, I was in Norfolk, VA for the convention of my band fraternity, Kappa Kappa Psi.  It was late and stuffy inside, so to get some air, two of my fraternity brothers and I grabbed hoodies, and took a walk in the city.  We’d hoped to find someplace to grab a drink, or perhaps a bite to eat. Instead, we found that most of the places we’d planned to go, were closed. As we walked back to the hotel, we were trailed through the streets by a cop car.</p>\n<p>The police officer didn’t speed up, or turn his lights on.  He just followed us through the dark streets for a couple of blocks, before passing us, and continuing on his way.  When we realized that we were being followed, I immediately flashed back to the conversation I’d had with my parents who grew up during the civil rights era. I was scared, and didn’t know if we were going to be a statistic.</p>\n<p>These experiences shape how I view the world as an adult in the current state of America, and they were the driving force that helped shape what I wanted to do for thesis.</p>\n<p>Further Reading:</p>\n<p>“The Talk: After Ferguson, a Shaded Conversation About Race – The New York Times.” <a href=\"https://www.nytimes.com/2014/12/14/sunday-review/dana-canedy-the-talk-after-ferguson-a-shaded-conversation-about-race.html\">https://www.nytimes.com/2014/12/14/sunday-review/dana-canedy-the-talk-after-ferguson-a-shaded-conversation-about-race.html</a></p>\n<p>“The Conversation Black Parents Have With Their Kids About Cops.” ABC News. <a href=\"https://abcnews.go.com/US/conversation-black-parents-kids-cops/story?id=27446833\">https://abcnews.go.com/US/conversation-black-parents-kids-cops/story?id=27446833</a></p>\n<p>Jubilee. Dear Child – When Black Parents Have To Give “The Talk.”  . <a href=\"https://www.youtube.com/watch?v=Mkw1CetjWwI\">https://www.youtube.com/watch?v=Mkw1CetjWwI</a></p>\n<p>“Growing up black in America: Here's my story of everyday racism.” The Guardian. <a href=\"https://www.theguardian.com/us-news/2018/jun/06/growing-up-black-in-america-racism-education\">https://www.theguardian.com/us-news/2018/jun/06/growing-up-black-in-america-racism-education</a></p>\n","tags":[{"name":"Culture","slug":"culture"},{"name":"Identity","slug":"identity"},{"name":"Justice","slug":"justice"},{"name":"Narrative/Storytelling","slug":"narrative-storytelling"},{"name":"Social Good/Activism","slug":"social-good-activism"}],"video_presentation_url":"https://vimeo.com/337314114","video_documentation_url":"","project_url":"","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/headshot-7-1024x990.jpg","title":"headshot","alt":"headshot of Kellee Massey","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/user-test-768x895-1.jpg","title":"user test","alt":"user test","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/user-test-879x1024.jpg","title":"user-test","alt":"picture of user accessing the field guide on mobile phone","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/IMG_5644-1-225x300-1.jpeg","title":"user test","alt":"user test","caption":""}]}