{"student_id":"8","student_name":"Azalea Vaseghi","student_slug":"azalea-vaseghi","advisor_name":"Kathleen M Sullivan","title":"Digital Embrace","thesis_statement":"Digital Embrace is a data driven exercise that explores how the internet is potentially affecting us in ways we are unaware of. ","abstract":"Although social media claims to catalyze social connections, much of the time it only serves to simplify our experiences and lives into manageable, easy to digest snippets. This according to, psychologist and the professor of the social studies of science and technology at MIT, Sherry Turkle “turns [people] into something close to objects” and, consequently, makes oneself “vulnerable to seeing itself as one.” This method of interaction, according to Turkle, breeds narcissism, which in psychoanalysis, is “not to indicate people who love themselves, but a personality…who cannot tolerate the complicated demands of other people but tries to relate to them by distorting who they are” and so “gets on with others only by dealing with their made-to-measure representations”. This level of control in online interaction, couple with our body’s release of the “cuddle drug” oxytocin during the act of social media engagement, create an allure that few are able to resist. But how is this potentially affecting the way we interact in the long run? Digital embrace seeks to unveil these shifts are they are occurring. ","context_research":"Our desire to control the way we are perceived is something that sociologist Erving Goffman explores in The Presentation of Self in Everyday Life. According to Goffman, “everyone is always and everywhere, more or less consciously, playing a role”. When we interact with one another, one participant plays the role of the performer while the other serves as the audience. In these instances, it is the goal of the “actor” to cast themselves in the best light possible. However, there are many non-verbal cues the actor might unwittingly give the audience that might put the them in a position of vulnerability during these interaction that is not ideal. This aversion to vulnerability is something that social media often capitalizes on as Sherry Turkle explores in her book Alone Together. In this book, Turkle interviews a number of individuals on their use of digital mediums as tools for communication. Although many of them credit these tools with the ability to relieve some of the stress that comes with dealing with other human beings, it becomes clear that this is often at the cost of foregoing vital experiences that help us in our development as human beings, such as the ability to have verbal conversations and the ability to function independently of one another. Often these interactions trick our brains into thinking that we are getting the same level of satisfaction from these interactions as we would from in person interaction by flooding our bodies with feel good chemicals that keep us engaged. In the end, however, all this leads us, according to Turkle, to expect more from technology and less from each other.  ","technical_details":"To explore this phenomenon, I created a garment that uses capacitive touch to sense when the wearer is being physically embraced. Once this is detected it measures their pulse and sends this information to a database. At the same time, this database records the same user's biometrics whenever they receive a like on social media. In the end, the two are compared. ","further_reading":"","tags":[{"name":"Data","slug":"data"},{"name":"Design","slug":"design"},{"name":"Experiment","slug":"experiment"},{"name":"Speculation","slug":"speculation"},{"name":"Wearables","slug":"wearables"}],"video_presentation_url":"https://vimeo.com/336825383","video_documentation_url":"","project_url":"","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/default.png","title":"default","alt":"default","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/IMG_0656-768x1024.jpg","title":"IMG_0656","alt":"Wearable hug sensor on mannequin","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/back-1024x576.png","title":"back","alt":"back","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/IMG_0664-1024x768.jpg","title":"IMG_0664","alt":"Wearable hug sensor detail","caption":""}]}