{"student_id":"80","student_name":"Kimberly Lin","student_slug":"kimberly-lin","advisor_name":"Kathleen M Sullivan","title":"Super Frustrated NYC Modern Love Stories","thesis_statement":"Super Frustrated NYC Modern Love Stories is a living archive of location based audio stories that provides a glimpse into how millennials date in New York City.","abstract":"For many millennials, finding romantic love in digital age New York City appears to be unbearably challenging. We are active participants in the swipe economy which attempted to disrupt romance but actually sabotaged our love lives. After the launch of Tinder in 2012, online dating is now the norm. We re-invented heterosexual relationships in self-destructive ways: we added ghosting to communication and regard monogamy as an outdated idea. Why not? Unlimited choices are presented right in front of us! Paradoxically, in a hidden corner of our subconscious, we still expect our date to text back to us and somehow hope to find the one big love of our life. Yes, I am one of these millennials who is burned out by modern dating. But instead of staying unhappily single and questioning our approaches, maybe we should collectively voice out our hopes and disappointments of this NYC phenomenon. Let’s honor our stories as solace to those who shared the same frustrations and entertaining guidance for those who did not have the opportunity to experience our dating culture.","context_research":"Inspired by speculations on future romance like Spike Jonze’s “Her”, Yorgos Lanthimos’ “The Lobster”, Black Mirror’s “Hang the DJ”, Gary Shteyngart’s “Super Sad True Love Story” and love cliches from early 2000s romantic comedies like Donald Petrie’s “How to Lose a Guy in 10 Days” and Darren Star’s “Sex and the City”, Super Frustrated NYC Modern Love Stories depicts how millennials currently fall in love in the age of online dating. Who cares? Popular books about contemporary relationship like Aziz Ansari’s “Modern Romance” and Blythe Roberson’s “How to date men when you hate men” as well as Netflix’s recently released reality TV show “Dating Around” confirm that there is a fairly high demand for this subject. Millennials who are single and dating like to talk about their experiences that many of those who are not part of the group enjoy listening to. Super Frustrated NYC Modern Love Stories re-imagined New York Times Modern Love essays, Overheard New York’s Instagram posts and Humans of New York’s photo journal through voice and space. It provides you a series of audio stories that pop up on a mobile site as you walk through New York City. Why voice? Ansari discussed in his book that many millennials are terrified of phone calls as our ability to converse spontaneously weakens in a text-filled world. It is time to rebuild what we have lost and reintroduce voice into our lives. \r\n<br><br>\r\n\r\nWorks Cited: <br>\r\nAnsari, A. (2016). Modern romance. London: Penguin Books.<br>\r\nBarden, Evan Ford. “One Hundred Dates.” One Hundred Dates, 6 Jan. 2014, onehundreddates.com.<br>\r\nDating Around, created by Chris Culvenor, season 1, Netflix, 14 Feb. 2019.<br>\r\nFisher, H. E. (2005). Why we love: The nature and chemistry of romantic love. New York: St. Martins Griffin.<br>\r\n“Hang the DJ .” Black Mirror. Directed by Tim Van Patten, written by Charlie Brooker, season 4, episode 4, Netflix, 29 Dec. 2017.<br>\r\nJones, Daniel, editor. “Modern Love.” The New York Times, www.nytimes.com/column/modern-love.<br>\r\nJonze, Spike, director. Her. Warner Bros. Pictures, 2014.<br>\r\nLanthimos, Yorgos, director. The Lobster. A24, 2016.<br>\r\n“Overheard New York.” Overheard New York, www.instagram.com/overheardnewyork/?hl=en.<br>\r\nPetrie, Donald, director. How to Lose a Guy in 10 Days. Paramount Pictures, 2003.<br>\r\nRoberson, B. (2018). How to date men when you hate men. New York: Flatiron Books.<br>\r\nSex and the City, created by Darren Star, HBO, 6 June 1998.\r\nShteyngart, G. (2011). Super Sad True Love Story. Random House Trade Paperbacks.<br>\r\nStanton, Brandon. “Humans of New York.” Humans of New York, 4 Sept. 2010, www.humansofnewyork.com/.<br>\r\nW. (2019, February 13). Machine Love: Dating in the Digital Age [Audio blog post]. Retrieved from https://www.wsj.com/podcasts/wsj-the-future-of-everything/machine-love-dating-in-the-digital-age/6ba51076-d036-436e-a5b7-f68d5889dd1c<br>","technical_details":"Super Frustrated NYC Modern Love Stories is a mobile site that tracks your location. <br><br>\r\n\r\nWhile waiting for your late friend to arrive, you ordered yourself a glass of wine. You wonder if any frustrating dates have happened at this bar. You take out your phone and go to https://www.superfrustrated.nyc/. It asks for your location, sends it to Javascript to check if it matches with any of the 27 sets of coordinates. If it does, an audio file of that frustrating date will pop up. You can then listen to the story. If your coordinates did not match with any of the 27 stories, you will receive a text, “No frustrating dates were reported here...yet”.  \r\n<br><br>\r\nWebsite: https://www.superfrustrated.nyc<br>\r\nGitHub: https://github.com/madbunnykim/Super-Frustrated\r\n","further_reading":"<p>A good friend of mine once told me as we were about to graduate from college in 2016, “Kim, I am too cynical about dating in general that I would never try out any of those apps, but I love listening to all of your troublesome dates. As an artist yourself, don’t you find your experience inspiring and want to make something out of it?” Three years later, I started responding to break-ups through my work. It resonates with many of those who shared similar stories and now it has evolved from a personal ritual into a collective practice.</p>\n<p>Nice guys are hard to find</p>\n<p>I am a heterosexual millennial, single and dating, in my mid-twenties who has lived in NYC the past seven years. I have been looking for a man for a while but encountered mostly boys. Is my expectation unrealistic? Is it the city? Or is it that I just have very bad luck? Whether it is through the form of <a href=\"https://www.kimberly-y-lin.com/baenana\">a talking banana</a> or <a href=\"https://www.kimberly-y-lin.com/sad-bunny\">a heartbroken Google Home</a>, many of my previous works at ITP were about my frustrations with dating in the city. Through conversations with various New Yorkers, it is confirmed that many people are also frustrated with modern dating. Instead of staying unhappily single and questioning our approaches, why don’t we collectively voice our disappointments using the city as a canvas? There needs to be more honesty around our frustrating dating culture.</p>\n<p>Persistent Outreach</p>\n<p>Due to the time limitation I have here, I reached out to my immediate community, which is the ITP family and undergraduate friends from other NYU departments (Economics, Communication, Education, Studio Art, Photography) asking for people who are interested in sharing their dating experience with me. I conducted 30 in-depth interviews where I spent 1.5 hour with each interviewees learning about their background, value, expectation, dating approach, past and present relationships. 60% of them were women and 40% men. Age between 24 and 34. Work in art, entertainment, tech and finance. 25 out of 30 ppl that expressed a lot of frustrations with dating are heterosexual millennials so moving forward I decided to focus on their perspective which is the community I am part of.</p>\n<p>Common Frustrations</p>\n<p>Through these interviews, I gathered a list of problems I observed.</p>\n<ul>\n<li>It is not cool to label yourself as a “boyfriend/girlfriend hunter” and hence most people present themselves as being open minded to any kinds of relationship even though deep down you are looking for a Catholic husband.</li>\n<li>Effective communication is difficult especially when we have different understanding in vocabularies. A conventional relationship that you refer your partner as your boyfriend/girlfriend is now being referred as a “exclusive relationship”, “sexually exclusive relationship”, “serious relationship”, “very seriously committed relationship” or all of the above combined. Simultaneously, there is also “casual relationship” and some people also regard “exclusive relationship” less serious than a “serious relationship”. You never know which relationship you are in and hence it is difficult to figure out your expectations.</li>\n<li>Dating apps have low stakes. Many people treated dating apps as a platform for sex and/or short term emotional company. They swipe through profiles like going through a catalog. App-users do regard dating apps that require user to fill out more information such as OkCupid and Hinge less of a hook-up app than Tinder.</li>\n<li>A lot of people don’t know what they want. They are confused and hence screw each other over.</li>\n</ul>\n<p>Sarcastic vs Poetic</p>\n<p>Collaging these observations with various dating stories from my interviewees, I then came up with several 30-50 second stories told through Google assistant Audrey in two different styles. The first is to have <a href=\"https://vimeo.com/319972653\">Audrey read aloud the love stories based on a frustration level of your choice</a>. The second is a comedy show style performance between Audrey and myself poking fun at these frustrations and absurd fears many people have with romantic relationships. I also thought of involving the city as a site-specific piece. Voice is a crucial component as it is how many stories are told in the first place. When I am on a date at a romantic bar, I always wonder if the people sitting next to me are also on their awkward first date (or last). To capture this curiosity and familiarity with memories and locations, I can perhaps use the city as a home to these oral stories that are usually invisible yet relatable to many.</p>\n<p>The geolocation idea makes more sense to me yet the comedy show performance fits more into my style (funny and sarcastic). I spoke to my BFF Roland about my concerns and he responded “Why do you always have to be so sarcastic? I like the geolocation idea. It’s poetic and unlike what you have done before”. Thanks to Roland. It’s true that I don’t always have to be so sarcastic. I then decided to create a location based audio storytelling site that allows you to listen to a dating story that took place right where you are at.</p>\n<p>Audrey the Voice Assistant</p>\n<p>The first iteration was done with <a href=\"https://vimeo.com/323073615\">Audrey the voice assistant</a>. The interaction begins as you ask for Audrey through Google Assistant on your phone. Audrey then ask you to select a level of frustration from mild, medium, super to unbearably. Based on your selection, you will be given an address. Once you arrive, you can listen to a frustrating date that took place right on that spot.</p>\n<p>Through this first round of user testing, I realized that synthetic voice flattens these stories a little too much. In order to make them specific to the city, they need to be longer with more hints of the environment. I was also aware that this mission driven approach demands a lot from the user.</p>\n<p>&nbsp;</p>\n<p>Voice of Frustrated Millennials</p>\n<p>Moving on to my second iteration, I invited 16 millennials to one-on-one recording sessions where I ask them to talk about one or two specific date/relationship. Altogether, I collected <a href=\"https://vimeo.com/335295488\">27 stories</a>. I then created a mobile site to host these stories on <a href=\"https://www.superfrustrated.nyc/\">https://www.superfrustrated.nyc/</a> that tracks your location.</p>\n<p>How does it work? While waiting for your late friend to arrive, you ordered yourself a glass of wine. You wonder if any breakups have happened at this bar. You take out your phone and go to <a href=\"https://www.superfrustrated.nyc/\">https://www.superfrustrated.nyc/</a>. It asks for your location, sends it to Javascript to check if it matches with any of the 27 sets of coordinates. If it does, an audio file of that frustrating date will pop up. You can then listen to the story. If your coordinates did not match with any of the 27 stories, you will receive a text, “No frustrating dates were reported here...yet”. You can also learn more about the user journey in the form of <a href=\"https://vimeo.com/333329541\">a super entertaining video of three girlfriends catching up over drinks at a bar</a>.</p>\n<p>Moving Forward</p>\n<p>I would like to create a share function where you can upload your story to the archive and a comment function where you can leave a comment after listening to a story to create an ongoing dialog. I would also like to integrate this into an app so that instead of actively checking the site on your phone, you will receive a push notification when you stumble upon a story.</p>\n<p>Special Thanks</p>\n<p>To all the storytellers</p>\n<p>Evan Forde Barden, Lauren Race, Jillian Zhong, Max Horwich, Matt Newberg, Jelani Bektemba, Shreiya Chowdhary, Damian Ashton, Mark Lam, Sam Chasan, Sam Krystal, Jenna Xu, Amanda Hendon, Mackenzie Bennett and Tiffany Chang.</p>\n<p>And everyone who helped me to making this project possible.</p>\n<p>Shawn Van Every, Nicolás Escarpentier, Danny Rozin, Kat Sullivan, Devin Curry, Fanni Fazakas, Daniel Benyi, Ayaka Omoto, Grace Chuang, Paul Gisbrecht, Suzanne Li, Hafi, Caroline Neel, Caroline Fahey, Roland Arnoldt, Brandon Newberg, Mai Izsak, Asha Veeraswamy, Jim Schmitz, Dominic Barrett, Hayley Hwang, Rushali Paratey, Emma Norton, MH Rahmani, Dan Oved, Katya Rozanova, Matt Ross, Winslow Porter, Tina Huang, Andrea Yang, the Keybar crew, Mom and Dad.</p>\n","tags":[{"name":"Art","slug":"art"},{"name":"Culture","slug":"culture"},{"name":"Identity","slug":"identity"},{"name":"Mobile","slug":"mobile"},{"name":"Narrative/Storytelling","slug":"narrative-storytelling"}],"video_presentation_url":"https://vimeo.com/336826561","video_documentation_url":"https://vimeo.com/333329541","project_url":"https://www.superfrustrated.nyc","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/small-768x432-1.jpg","title":"small-768x432","alt":"kim headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/logo_16by9-1024x683.jpg","title":"logo_16by9","alt":"Logo","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/16to9_main_small-1024x576.jpg","title":"Super Frustrated NYC Modern Love Stories","alt":"An iphone with a screen display of Super Frustrated NYC Modern Love Stories, headphones and an upside down dead flower.","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/P1150940-1024x576.jpg","title":"Super Frustrated NYC Modern Love Stories","alt":"A couple sitting in the park sharing a pair of headphones while listening to dating stories from Super Frustrated NYC Modern Love Stories.","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/keybar-16-1024x576.jpg","title":"Super Frustrated NYC Modern Love Stories","alt":"Three girlfriends listening to dating stories from Super Frustrated NYC Modern Love Stories at a bar.","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/keybar-2-1024x576.jpg","title":"Super Frustrated NYC Modern Love Stories","alt":"Three girlfriends listening to dating stories from Super Frustrated NYC Modern Love Stories at a bar.","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/UX.001-1024x576.jpeg","title":"Super Frustrated NYC Modern Love Stories","alt":"Super Frustrated NYC Modern Love Stories user journey.","caption":""}]}