{"student_id":"82","student_name":"Katya Rozanova","student_slug":"katya-rozanova","advisor_name":"Gregory Shakar","title":"Sound Playground","thesis_statement":"Sound Playground is a tactile, semi-autonomous ecosystem of objects that emit sound to communicate with one another when they want to but that you can also collaborate with by triggering some of their sonic behaviors. One can linger with these objects alone or in a group. ","abstract":"Sound Playground consists of a set of objects that emit sound upon being moved, touched, placed next to other objects, and activated by outside sounds. The system is semi-autonomous - the objects have a degree of agency. They can emit sound when they want to, sometimes triggering one another’s sonic behaviors. They can decide when they want to react to your tactile or sonic input and when to refuse cooperation by going into sleeping mode. They can decide which sonic behaviors to exhibit at a given time. Finally, they can decide when to record small snippets of environmental sound in order to insert them to an ongoing composition and when to play this composition back into the world. <br><br>\r\n\r\nDue to the ever-shifting behaviors of this, rather punky, rebellious, Sound Playground, your experience with it will never be the same. However, you may be able to notice patterns as you get to know the personality of each sound object and as you observe the socialites that these objects form with one another. While you, as the human, are gently decentralized, you can impress your sounds and interactions onto the playground’s memory, shaping some of its current and future behaviors. I call this collaboration. <br><br>\r\n\r\nThe goal of this project is to create a meditative environment where you can focus on tactile sensations and create sounds with an opaque, autonomous ecosystem by observing and discovering its properties. It is also an opportunity to be with technology that demands respect and that respects your opacity in return. Neither party is expected to be fully knowable in order for collaboration to happen. This experiment aims to examine the effects of such encounters. \r\n<br><br>\r\nSound Playground explores several themes. Opacity, object agency, tactility and sound, therapeutic play, abstracted anthropomorphism, awkwardness of form, relationally, and the intersection of labor and art. The experience invites people to linger and examine how they relate to human and non-human elements alike.\r\n","context_research":"Inspirations:\r\n<br>\r\nJulianne Swartz, Sine Body,<br>\r\nEmily Counts’s Super Mode,<br>\r\nDavid Bernstein’s Bureau of Unspecified Services (B.U.S.),<br>\r\nRosa Sijben and David Bernstein’s “Something to Hold On To”,\r\nFoo/Skou,<br>\r\nMICRO -double helix- by Purring Tiger,<br>\r\nThe Situationist International’s Drifting and Psychogeography observation practice, <br>\r\nDada works that break away from “rationality”<br>\r\nElaine Gan’s work within the Actor Network practice, <br>\r\nI/O: Chamber of a Musical Composer by Yuko Mohri<br>\r\n<br>\r\nGrant:<br>\r\nI received the Fall '18 Prototyping Fund from the Tandon School of Engineering to create a prototype for a Sound Playground with an emphasis on tactile and sonic therapy. The objects would eventually live in waiting rooms in hospitals in order to quiet the mind of patients under stress. While the current iteration of Sound Playground exists as a meditative experience agnostic of place, I feel it still offers people a therapeutic experience and can be used in hospitals and other waiting rooms when the . \r\n<br><br>\r\nSome Readings:<br>\r\n\r\nJohn Cage, Chance Operations, and the Chaos Game: Cage and the \"I Ching” by Marc G. Jensen<br>\r\nJohn Cage: Crafting Randomness by Warren A. Burt<br>\r\nNature's Queer Performativity by Karen Barad<br>\r\nAlien phenomenology by Ian Bogost<br>\r\nPrince of Networks: Bruno Latour and Metaphysics By  Graham Harman <br>\r\n<br>\r\nExpert Interviews:<br>\r\n\r\nElaine Gan, Actor-Network practitioner, professor, Experimental Humanities Department, NYU. <br>\r\nDevi Sambouka, Brooklyn-based sound therapist.","technical_details":"For this project I used several paper clay enclosures, two 3d printed enclosures, microcontrollers, accelerometers, microphones, speakers, and Max MSP.","further_reading":"<p>The project explores several themes.  Opacity, object agency, tactility and sound, therapeutic play, abstracted anthropomorphism, awkwardness of form, and horizontal relationally.</p>\n<p>Themes 1, 2 &amp; 3:</p>\n<p>Opacity, Object agency, Tactility and sound as therapeutic play</p>\n<p>This project is within the tradition of challenging ideas of Western rationality and transparency as control. I was not aware of this when I decided to build the playground, but in retrospect I believe the impulse to create this could be, in part, a subconscious desire to examine a different way of relating. I like to think that the Sound Playground is a punk version of the sonic instruments I encountered at the Sonic Arcade exhibit at the Design Museum (on view in 2017). Beautiful but mostly obedient, they left something to be desired. I set out to make something rebellious instead. I’m offering this experiment as a small contribution to the existing conversation about rethinking how humans relate to the world and to one another, about breaking away from human centrality.</p>\n<p>Sound Playground consists of a set of objects that emit sound upon being moved, touched, placed next to other objects, and activated by outside sounds. The system is semi-autonomous - the objects have a degree of agency. They can emit sound when they want to, sometimes triggering one another’s sonic behaviors. They can decide when they want to react to your tactile or sonic input and when to refuse cooperation by going into sleeping mode. They can decide which sonic behaviors to exhibit at a given time. Finally, they can decide when to record small snippets of environmental sound in order to insert them to an ongoing composition and when to play this composition back into the world.</p>\n<p>Due to the ever-shifting behaviors of this, rather punky, rebellious, Sound Playground, your experience with it will never be the same. However, you may be able to notice patterns as you get to know the personality of each sound object and as you observe the socialites that these objects form with one another. While you, as the human, are gently decentralized, you can impress your sounds and interactions onto the playground’s memory, shaping some of its current and future behaviors. I call this collaboration.</p>\n<p>The goal of this project is to create a meditative environment where you can focus on tactile sensations and create sounds with an opaque, autonomous ecosystem by observing and discovering its properties. It is also an opportunity to be with technology that demands respect and that respects your opacity in return. Neither party is expected to be fully knowable in order for collaboration to happen. This experiment aims to examine the effects of such encounters.</p>\n<p>The experience is for those who might enjoy an anti-Alexa in their life. For those who might want to rethink their relationship with technology and other non-human elements.</p>\n<p>Theme 4:</p>\n<p>Abstracted anthropomorphism</p>\n<p>One of the recurring themes in my work is abstracted anthropomorphism, which includes the objects having certain animal-plant-humanoid characteristics as well as the ability to produce sound, simulating sonic communication between members of the object ecosystem.</p>\n<p>I'll always been fascination with objects communicating as a simulation of other types of communications. I’m still not sure if I think of them as objects or as abstract representations of living organisms, perhaps even of the human variety but not only. Could this be a human listening to an animal? Is this interspecies communication? Abstraction allows for this kind of contemplation that I find quite interesting.</p>\n<p>Theme 5:</p>\n<p>Awkwardness of form</p>\n<p>Another concept I explore in my work is awkwardness. Most of the objects are askew. They often lean against walls or appear to be in motion or on the verge of losing balance and falling to one side. I gravitate towards this kind of presentation because it gives objects personality, which makes it easier to imagine what they would be like if they were animate.</p>\n<p>Theme 6:</p>\n<p>Exploration of Relationality</p>\n<p>I rarely make one of anything. I find it more interesting in exploring the negative spaces between objects, where communication lives, than the bodies of the objects themselves. I'm meditating on ways in which units, creatures, entities can relate to one another.</p>\n<p>Theme 7:</p>\n<p>Intersection of art and labor</p>\n<p>In this work I am using the language of labor - \"works from 5 - 8\", \"only works in November\",  \"working\" vs. \"sleeping\", \"these two work together most of the time\". It alludes to how we work in collectives. Who sleeps and when? For how long? Who works more with who?</p>\n","tags":[{"name":"Art","slug":"art"},{"name":"Experiment","slug":"experiment"},{"name":"Installation","slug":"installation"},{"name":"Play/Games","slug":"play-games"}],"video_presentation_url":"https://vimeo.com/336826625","video_documentation_url":"https://vimeo.com/331363550","project_url":"https://www.katyarozanova.com/art/soundplayground","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/photo_katyarozanova_1280_720-768x432-1.jpg","title":"photo_katyarozanova_1280_720-768x432","alt":"katya headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/picnic_main_1280720-1024x576.jpg","title":"picnic_main_1280720","alt":"Sound Playground thumbnail image","caption":"Sound Playground thumbnail image"},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/1920_1080_slide_soundplayground-1024x576.jpg","title":"1920_1080_slide_soundplayground","alt":"sound playground","caption":"sound playground"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/1920_1080_slide_soundplayground_PERSON-1024x576.jpg","title":"Someone setting a sound object into motion","alt":"Someone setting a sound object into motion","caption":"Someone setting a sound object into motion"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/only_plays-1024x576.jpg","title":"Object that only plays 5 - 8","alt":"Object that only plays 5 - 8","caption":"Object that only plays 5 - 8"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/composition_changers_over_time-1024x576.jpg","title":"composition that changers over time","alt":"composition_changers_over_time","caption":"composition_changers_over_time"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/object_that_only_works_in_november-1024x576.jpg","title":"object_that_only_works_in_november","alt":"object_that_only_works_in_november","caption":"object_that_only_works_in_november"}]}