{"student_id":"85","student_name":"Lauren Race","student_slug":"lauren-race","advisor_name":"Stefani Bardin","title":"Designing Tactile Schematics","thesis_statement":"To make electronics more accessible to blind and low vision learners, a set of design standards and best practices were developed for converting schematics into tactile schematics.","abstract":"Accessibility is the heart of experience design because it’s not usable if it’s not accessible. For a sighted designer, it’s an opportunity to improve the design process since understanding the user’s needs require listening to and working alongside them to design something together. <br><br>\r\n\r\nThe particular accessibility use case came from making the Physical Computing coursework more accessible, since the schematics on the class’s site are images. While sighted learners rely on schematic images, blind and low vision learners rely on circuit descriptions to understand how electronics work. No graphical representation has yet been able to compete with circuit descriptions. This pain point became the focal point of the subsequent design research.\r\n\r\nUsing participatory and human-centered design with 5 blind and low vision participants through NYU’s Institutional Review Board (IRB), a set of design standards and best practices were developed to illustrate how to design a readable tactile schematic. These standards were then applied to the 50+ schematics from the Physical Computing site. The standards and best practices and book of tactile schematics were made available for download by the public.\r\n","context_research":"Competitive analysis disclosed that there are electronics educational resources for blind and low vision learners with different learning styles: verbal descriptions or interactive simulations for auditory learning, Braille translations for reading/writing learning, blind Arduino workshops for constructivist learning, and tactile graphics for kinesthetic/tactile learning (the focus of this research).\r\n<br><br>\r\nIn order to determine the optimal design standards and best practices for tactile schematics (labeling, scaling, layout, and contrast), a usability study was conducted through NYU’s IRB with 5 low vision and blind participants, ranging in learning style, finger variables (sensitivity and size), electronics experience, Braille literacy, and level of vision. Learners were presented with tactile versions of The Big 6, or the six schematics crucial to understanding Physical Computing, given informed consent, a series of tasks, and follow up questions.","technical_details":"","further_reading":"<p>Tactile graphics are one element in a larger toolbox. There are educational resources. The <a href=\"https://www.ski.org/project/blind-arduino-project\">Blind Arduino Project</a> develops and shares techniques for low vision users to build electronics projects. The Andrew Heiskell Braille and Talking Book Library hosts Arduino workshops with the <a href=\"https://www.nypl.org/about/locations/heiskell/dimensions\">Dimensions</a> program. The <a href=\"https://www.ski.org/smith-kettlewell-technical-file\">Smith Kettlewell Technical File</a> was a publication for low vision electronics enthusiasts and used standardized verbal circuit descriptions instead of diagrams.</p>\n<p>There are educational tools. <a href=\"https://phet-dev.colorado.edu/html/ohms-law/1.4.0-dev.23/phet/ohms-law_en_phet.html?accessibility\">Interactive simulations</a> use a screen reader to allow the user to dynamically explore electronics educational materials. <a href=\"https://ieeexplore.ieee.org/document/5711764\">Circuit descriptions </a> provide text to speech descriptions of the sequence of components in a circuit. Printed Braille descriptions are similar and more useful to a reader who learns by reading and writing.</p>\n<p>The concentration of this research is tactile graphics. They can be made in a variety of ways: <a href=\"http://www.tactilebooks.org/tactileguidelines/page1.htm\">vacuum forming</a>, <a href=\"https://www.afb.org/blindness-and-low-vision/using-technology/assistive-technology-products/braille-printers\">embossing</a>, <a href=\"https://www.aph.org/products/tactile-art-products-and-materials/\">customized paper collage</a>, and <a href=\"http://www.americanthermoform.com/product/swell-form-graphics-starter-pack/\">microcapsule printing</a>. Microcapsule printing, the chosen method for this use case due to ITP’s access to a Swell Form printer, reacts to black ink causing it to puff up, while lighter grays and colors remain flat.</p>\n<p>Human-centered design and participatory design methodologies were used to observe, ideate, rapid prototype, user test, iterate, and implement, while positioning the end user as the lead design expert. For user testing, participants were presented with 6 tactile schematics that best represent the Physical Computing curriculum and asked to identify specific electronics components and explain the schematic in their own words.</p>\n<p>The output of this research concerns two target audiences: the primary being blind or low vision learners who want to use tactile schematics to understand electronics and the secondary being sighted designers who want to help convert schematics to tactile schematics. The documents for both audiences, the book of tactile schematics from <a href=\"https://itp.nyu.edu/physcomp/itp/syllabus/#Class1\">ITP’s Physical Computing</a> site and design standards and best practices, were available for download from the <a href=\"http://tactileschematics.com\">project website.</a></p>\n","tags":[{"name":"Accessibility","slug":"accessibility"},{"name":"Design","slug":"design"},{"name":"UX","slug":"ux"}],"video_presentation_url":"https://vimeo.com/336817936","video_documentation_url":"https://vimeo.com/331350194","project_url":"https://tactileschematics.com/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/LRace-4-768x432-1.jpg","title":"LRace-4-768x432","alt":"lauren race headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Designing-Tactile-Schematics-3-1024x576.jpg","title":"Designing Tactile Schematics","alt":"Close up of two hands exploring a tactile schematic.","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/LED-Regulator-Resistor-Before-1024x576.jpg","title":"LED Resistor Regulator Before","alt":"Schematic of an LED, Resistor, Regulator in Series, downloaded from the Physical Computing site, before the re-design. It doesn't have Braille labels, optimal sized components, or consistent lines.","caption":"Schematic of an LED, Resistor, Regulator in Series, downloaded from the Physical Computing site, before the re-design."},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/LED-Regulator-Resistor-After-1024x576.jpg","title":"LED Resistor Regulator After","alt":"Hands exploring one of the final iteration of the LED, Resistor, Regulator in Series schematic after the re-design. There's Braille labels, optimal sized components, and consistent lines.","caption":"One of the final iteration of the LED, Resistor, Regulator in Series schematic after the re-design."},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Style-Guide-Example-Page-1-1024x576.jpg","title":"Style Guide Example Page 1","alt":"Example page from the style guide that shows how to set the Braille and text minimum/maximum font sizes.","caption":"Example page from the style guide that shows how to set the Braille and text minimum/maximum font sizes."},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Style-Guide-Example-Page-2-1-1024x576.jpg","title":"Style Guide Example Page 2","alt":"Example page from the style guide that shows optimal measurements, in inches, of common circuit components.","caption":"Example page from the style guide that shows optimal measurements, in inches, of common circuit components."},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Style-Guide-Example-Page-3-1024x576.jpg","title":"Style Guide Example Page 3","alt":"Example page from the style guide that shows how to put .25 inch breathing room between all of your components for tactile clarity.","caption":"Example page from the style guide that shows how to put .25 inch breathing room between all of your components for tactile clarity."}]}