{"student_id":"86","student_name":"Lucas Kuen Kule'a Chung","student_slug":"lucas-kuen-kule'a-chung","advisor_name":"Kathleen Stevens Wilson","title":"Shush?","thesis_statement":"Shush? is an installation that reacts to the noise levels of a space. Comprising a series of sensor nodes that are outfitted with kinetic “bloom” structures, Shush? provides a visual representation of activity within an area.","abstract":"What happens when our surroundings are given the capacities once limited to our phones and computers? Will they then also strive to capture our attention for their own ends? Shush? is an installation that I hope will offer an alternative approach.\r\n<br><br>\r\nShush?’s own objectives are agnostic. It instead will exist just beyond the foreground of a person’s attention. It lives above the user and reacts only to sound. When noise levels are elevated, the nearest bloom structures will close, and when it is quiet again, the bloom structures will open again.\r\n<br><br>\r\nEach bloom/sensor node is supported by a wifi enabled microcontroller that will send information to a remote server. Each node also will await instructions on whether it will open or close. This allows easy calibration and recalibration in order to observe user behaviors, eccentric spatial conditions, and other unknown factors that need to be accommodated. \r\n<br><br>\r\nUltimately I hope to create an experience that shows that simple gestures can have a profound impact on our built environment while utilizing technologies that allow these interventions to be scalable, adaptable, and decentralized.","context_research":"Many of the ideas behind this project were inspired by the technologies that are becoming more affordable and easier to access. Additionally, I looked at some other installations that were made using similar tools with similar objectives.\r\n<br><br>\r\nI first looked at how to use a wifi enabled microcontroller as a sensor node, how to take the data recorded from each node and process it, and how to then remotely send instructions back. Much of this can be done using MQTT.\r\n<br><br>\r\nI then focused on what this installation will look like. How might it work? What will be the final visual cue that results from audio input. I came across “Diffusion Choir,” an installation that uses dozens of umbrella-shaped objects to open and close, and “Lift” an installation that reacts to temperature fluctuations in a room.\r\n<br><br>\r\nWhile considering the actual bloom structure of each node, I took inspiration from the work being done at the Jet Propulsion Laboratory on their Starshade project and the mechanics of Chuck Hoberman’s sphere objects.","technical_details":"This project will use a series of sensor nodes outfitted with wifi enabled microcontrollers to connect to a server using the MQTT transfer protocol. This will provide two-way communication with each node. Each node will also support a bloom structure that comprises a Tyvek disk that opens and closes actuated by nitinol wires connected to the microcontroller. The sensor within uses an electret microphone hooked up to an LM358 op-amp and a PVC interference tube.<br><br>\r\nI intend to prototype 3 bloom structures, the minimum number required to enclose a given space. The nodes will be mounted to the ceiling and hang about 8' off the ground. ","further_reading":"","tags":[{"name":"Architecture","slug":"architecture"},{"name":"Data","slug":"data"},{"name":"Design","slug":"design"},{"name":"Installation","slug":"installation"},{"name":"IOT","slug":"iot"}],"video_presentation_url":"https://vimeo.com/336836616","video_documentation_url":"","project_url":"","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/2H6A1860-768x512-1.jpg","title":"2H6A1860-768x512","alt":"lucas headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/RENDERING01-1-1024x576.jpg","title":"RENDERING01","alt":"A pair of silhouettes of human figures stand in conversation beneath a series of shush units.","caption":"The machine is designed to scale and work concert with multiple units."},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/archive-001-2-1024x682.jpg","title":"archive-001","alt":"A machine made of acrylic with stainless steel hardware. It comprises a ring of linkages that shrink and expand when it perceives sounds of varying levels below it.","caption":"Version 1 of the Shush? sound reactive machine."},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/archive-003-3-1024x683.jpg","title":"archive-003","alt":"A closeup view of the shockmount mic holder on the underside of the shush machine","caption":"Each Shush unit is outfitted with a directional sound sensor and a shockmount microphone holder to isolate vibrations."},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/isometric-1024x683.png","title":"isometric","alt":"An exploded diagram of a shush unit showing each part individually with labels identifying the electronics, stepper motor, accordion ring, microphone, and pvc pipe.","caption":"Exploded isometric diagram"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/RENDERING01-1-1024x576.jpg","title":"RENDERING01","alt":"A pair of silhouettes of human figures stand in conversation beneath a series of shush units.","caption":"The machine is designed to scale and work concert with multiple units."},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/comp-copy-1024x683.jpg","title":"comp copy","alt":"The shockmount mic holder is made of rubber bands in tension supporting the microphone as a means of isolating vibrations. The stepper motor is held in place by acrylic brackets supported by stainless steel screws and aluminum standoffs. The electronics of the device are contained in a sandwich of two acrylic panels supported by standoffs as well.","caption":"Closeups of the shockmount mic holder, stepper motor and electronics enclosure"}]}