{"student_id":"87","student_name":"Luna Olavarria Gallegos","student_slug":"luna-olavarria-gallegos","advisor_name":"Gregory Shakar","title":"HOUSE PARTY FEDERATION","thesis_statement":"A set of digital and physical objects inspired by local music scenes across the Black Atlantic, which offer decentralized methods of distributing and consuming music.  \r\n","abstract":"“The triangle trade” is a historical term referring to the exchange of enslaved people and sugar cane between Africa and the Americas, which has evolved into the Atlantic trade infrastructure of the 21st century. What happens if we think about the triangle trade as an exchange of culture, not of just bodies and sugar? Through complicating this trade, new vectors are revealed and the boundaries of Euclidean geometry within trade routes become impractical to the reality in which we all live.\r\n</br> </br>\r\nThrough research of the music industry, as well as local music scenes in Colombia, Jamaica, Puerto Rico, Nigeria and Panama throughout the 70s, 80s and 90s, I demonstrate the ways in which the current music distribution and consumption infrastructure has failed artists in the very places which birthed pop-culture trends and I offer alternatives to this infrastructure. I propose that the introduction of the Internet did not solve issues of connection of artists with other artists, but rather creates new ways of obstructing conversation of diaspora. \r\n</br> </br>\r\nHOUSE PARTY FEDERATION is an archive of physical and digital objects and knowledges that recognize a greater Black-Atlantic network for what it is: a collection of places / times that constantly produce global pop culture. The project re-imagines what the triangle trade means to us. This is the most realistic place because it is the place in which all the conditions for our art have been created —the space in which we are not slaves, but Gods– creators of food, buildings, railways, canals and culture. ","context_research":"Much of my early research focused on the constraints of the global digital music industry, which disproportionately affects artists of the Global South through digital infrastructure as well as corporate and government censorship. These obstructions include Spotify not being available in much of the world, the raids the National Guard carried out on music stores in Puerto Rico in the 90s in order to stop the distribution of reggaeton tapes, elite algorithmic playlists favoring corporate artists, and Sony’s plans to defund all distribution for non-English speaking music internationally. \r\n</br> </br>\r\nTo offer alternatives to this system, I did in-depth research on various local music scenes and created three objects based on the sounds, aesthetics and political economies of those time/place manifestations of global pop culture. The three objects are below: \r\n</br></br>\r\nLa Red Radio is a user-generated map which provides an easy way to listen to music from across the globe. Artists (or fans) add their own music using a form which allows them to input a Youtube link. \r\n</br></br>\r\nLa de Ahora is an MP3 player that only works with a USB input. Pulling inspiration from Cuba's \"el paquete\", and potlatch \"gift-giving\" culture of indigenous people of the Pacific Northwest and Canada, the MP3 player imagines practice of intentional sharing of music as gift-giving. \r\n</br></br>\r\nReparation Machine is a prototype website that redirects listeners from one video to another video to highlight and uplift the music of artists that have been structurally uncompensated, robbed or erased. ","technical_details":"Object 1: La Red Radio\r\nLa Red Radio was programmed with Javascript and uses a Digital Ocean server. I used the Mapbox platform to make the map. \r\n</br> </br>\r\nObject 2: La De Ahora MP3 Player\r\nLa De Ahora was created using an arduino at its core with a vinyl / metal shell. I chose the color combination because it is indicative of the aesthetics from the time the reggaeton raids were happening in Puerto Rico, and the cheap metal is a reminder of how canal workers were paid. \r\n</br> </br>\r\nObject 3: Reparation Machine\r\nReparation machine was coded using p5.js. \r\n","further_reading":"<p>To dig deep into the project, I chose to do research on the following points along the “triangle trade”:</p>\n<ul>\n<li>1993, San Juan, Puerto Rico</li>\n<li>1994, Palenque, Colombia</li>\n<li>1983, Lagos, Nigeria</li>\n<li>1977, Kingston, Jamaica</li>\n<li>1995, Panama City, Panama</li>\n</ul>\n<p>I chose these points because of their cultural relationship to each other as well as their importance to the current pop culture global trends. In 2004, Daddy Yankee released “Gasolina”, which peaked on U.S. charts and put reggaeton on the map for White audiences in the United States. While Puerto Rico’s relationship with United States allowed many reggaeton artists from the island to reach stardom early on, the genre was being incubated years before the song released across the Caribbean.</p>\n<p>The research I did follows the ways in which local manifestations of reggaeton were created on the coast of Colombia, in the Canal Zone of Panama and in highly criminalized housing projects Puerto Rico decades prior to the release of “Gasolina.” This music was informed by and inspired music globally, and I chose to research the relationships of these cities to each other in various directions, which demonstrates the true nonlinearity of music creation and distribution. While Africa is often positioned as the Old World birthplace from which all Black culture comes, careful listening allows for a more complex understanding of how music is shared. West African music is not the origin of all inspiration, rather a nexus in a greater conversation.</p>\n<p>The term and concept of the “triangle trade” in itself is the basis of European ship navigation routes, which, like many colonial constructs, does not do justice to the reality in which we all live. Histories of maroon communities across the Caribbean, run-away slave-ships that made their way from the Antileas to Central America and autonomous land projects in areas known to be colonized are just some examples of the ways in which a triangle is too simplistic to understand human geographies. The triangle is also imagined to be linear (Africa, Caribbean, South America, back to Africa), which does not give space for the reality that trade happens all at once and back and forth. The purpose of the triangle trade is to perpetually maintain the theory and practice of private property, however the existence of these routes also creates new opportunities for free trade of art, culture and knowledge which happen both intentionally and unintentionally.</p>\n<p>In 2019, the music industry looks very differently from the 70s-90s. Digital infrastructure has created opportunities for monopolization all along the music industry food chain and the reality is that it is harder than ever for an artist to get access to services required to be heard globally (distribution platforms, record labels, media outlets, and production companies). The idea that the internet has democratized the cultural landscape is a myth because there are many thresholds that prevent much of the Global South from accessing Internet in the same way as many people in European countries and North America, including cost and bandwidth. In addition, a crack-down on Copyright has further created boundaries on the way music is made, remixed and shared, which prioritizes artists who are represented by major corporate labels.</p>\n<p>HOUSE PARTY FEDERATION does not to solve any issues of colonialism nor the music industry, but rather provides insight to the importance of music distribution and consumption, the obstruction of these flows of culture through current commercial and governmental structures, and the ways humans have resisted. The project presents three ideas that do not attempt to solve, but rather offer alternatives that would change the way we experience music. At the core is a more complex understanding of human networks and the importance of global community building based off shared resistance to structural inequality as opposed to indulgence of private property.</p>\n<p>La Red Radio is my example of an alternative network, because it allows artists to upload their own music without a corporate middle man. It also allows the user to meditate on the idea of intention around bandwidth and digital literacy. The form is intentionally light and created to be easy to use. The site is not technically legal, as it converts the Youtube video into an MP3 before downloading it onto the server and pushing onto the front-end. This further allows La Red Radio to act as a way to investigate who is allowed to share music globally and how, and who makes these rules.</p>\n<p>La De Ahora MP3 Player acts more as an exploration of music consumption as opposed to distribution. Because it is USB input, it forces one to be intentional about what they will share, (there’s an extra step of having to download the song onto the USB) and allows us to get back into a practice of listening and sharing music communally as opposed to by ourselves on an algorithmically-curated playlist. The object seeks to push questions of why we share what we share and how we listen. It also lives in an analog-digital space— the MP3 that is shared could very well be downloaded from the Internet, but the tangible object forces users to be together when sharing.</p>\n<p>Reparation Machine is based on the reality that most music in 2019 that reaches global pop stardom are of artists who are represented by one of the three major corporate labels, and are typically white. The issue is not with white people making music of Black people— the issue is with the lack of compensation and even recognition of the communities who incubate the sound. At the very least, this object seeks to educate and at best, it opens a conversation about whose art we are fed through existing systems, and why.</p>\n<p>To create this project I was inspired and in constant conversation with many people, most notably, my mentors, Boima Tucker, artist and founder of INTLBLK, and Natalia “Conrazón” Linares who does work around a New Cultural Economy. I have listened to a lot of music and read books and articles with Rishi Nath who has informed a lot of critical construction. I am heavily inspired by artist, Tabita Rezaire, who produces audiovisual work around digital colonialism, holistic networks and intergenerational knowledges and trauma. Other feedback has come from poet, critic and theorist, Fred Moten and scholar and cultural critic, Alexandra Vázquez. Interviews include: Jason Sigal, founder of Free Music Archive; Cuban hip hop artist, El Individuo; Colombian hip hop artist, Dr. Rata.</p>\n<p>Collaborators on this project include Che Olavarría Gallegos who helped me with the Javascript and server set up, El Cepe MC, who provided voice for Spanish sound piece, and JD Asere, who helped produce soundscape and documentation.</p>\n","tags":[{"name":"Culture","slug":"culture"},{"name":"Justice","slug":"justice"},{"name":"Memory","slug":"memory"},{"name":"Music","slug":"music"},{"name":"Networks","slug":"networks"}],"video_presentation_url":"https://vimeo.com/336826667","video_documentation_url":"https://vimeo.com/333674769","project_url":"http://lunaog.global/houseparty.html","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/default.png","title":"default","alt":"default","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-04-17-at-1.50.56-AM-1024x576.jpg","title":"map","alt":"map of the Black Atlantic","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-04-17-at-1.50.56-AM-1024x576.jpg","title":"map","alt":"map of the Black Atlantic","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-05-09-at-9.27.32-PM-1024x577.png","title":"la red radio","alt":"screenshot of luna's la red radio","caption":"screenshot of la red radio"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/IMG_4846-1024x517.jpg","title":"IMG_4846","alt":"la de ahora mp3 player","caption":"la de ahora"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-05-07-at-4.24.19-PM-1024x442.png","title":"reparation machine","alt":"reparation-machine","caption":"screenshot of luna's \"reparation machine\""}]}