{"student_id":"89","student_name":"Wang Lu (dk)","student_slug":"wang-lu-(dk)","advisor_name":"Gregory Shakar","title":"The Invader, an immersive opera with multi-channel speaker system","thesis_statement":"The invader, is a non-traditional immersive opera experience about the procedure of manipulation between human and machine.  Audiences will be surrounded by multi-channel speaker system and experience the storytelling purely through the live performed sound and one screen which one of the performer will be remotely projected.  \r\n \r\n","abstract":"Merleau Ponty ’s book, Perception of Phenomenology  inspires me to think about the question on how to create a sound experience which can extend our auditory perception through music and storytelling extensively. <br><br>\r\n\r\nFor seeking the answer to this question, I started to develop a series of live performance project with immersive sound experience equipped with live-controlled multi-channel speaker system since the algorithm composition course and interactive music course I took in 2017.\r\n<br><br>\r\nThe Invader, which is my newest piece on this live-performance series and also, my thesis project. \r\n                                                          <br><br>\r\nThis project is based on the intention of creating an illusionary acoustic experience, which calls for the formation of horizon been built through soundscape and audiences’ unconsciously perceptions. To achieve this effect, I created in real time soundscape through the multi-channel speaker control system with live sound reactive visual. \r\n<br><br>\r\nFour sound layers(ingredients) are included and controlled through the whole performance. They are real-time voice recording, live processed sound signal, synthesized sound and studio recorded music materials.  <br><br>\r\n\r\nOn this project, the sound is used to tell the story.  I will use sound to express the procedure of how human and machine are anxiously invading each other under modern society context. \r\n\r\n","context_research":"Conceptually I'm inspired by the study of the phenomenology of sound, and the concept on considering sound or music element as object and build or observe the invisible bridge between these specific object and the corresponding perception of human. <br><br>\r\n\r\nTo achieve to build the bridge, I researched early 50s-90s avant-garde musicology forms and music materials been used for performance and compositions. And later on how the computer and its algorithm engage in creating different music materials and triggered a new approach to music composition. <br><br>\r\n\r\nFor the technical research, I've been experimenting with Spat, a software suite for spatialization of sound signals in real-time intended for musical creation, postproduction, and live performances made by IRCAM (Institut de Recherche et Coordination Acoustique/Musique). To help me to build my own controlling max patch in better shape.\r\n","technical_details":"Software: Max MSP, Premier, Pro Tools, Logic Pro, Reason\r\nHardware: minum 8 channel sound interface, microphone \r\nVenue: The Feldstein Immersion Room in the Avery Fisher Center\r\n \r\n","further_reading":"","tags":[{"name":"Art","slug":"art"},{"name":"Experiment","slug":"experiment"},{"name":"Music","slug":"music"},{"name":"Narrative/Storytelling","slug":"narrative-storytelling"},{"name":"Performance","slug":"performance"}],"video_presentation_url":"https://vimeo.com/336826729","video_documentation_url":"","project_url":"","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/IMG_0967-1-768x432-1.jpg","title":"IMG_0967-1-768x432","alt":"lu headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-04-19-at-2.58.40-PM-1024x576.png","title":"Screen Shot 2019-04-19 at 2.58.40 PM","alt":"11111","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/IMG_7264-1024x744.png","title":"IMG_7264","alt":"3","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/IMG_7220-1024x576.png","title":"IMG_7220","alt":"2","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/IMG_7536-1024x687.png","title":"IMG_7536","alt":"4","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/DSC02447-1024x683.jpg","title":"DSC02447","alt":"1","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-05-09-at-8.03.24-PM-1024x683.jpg","title":"Screen Shot 2019-05-09 at 8.03.24 PM","alt":"1111","caption":""}]}