{"student_id":"9","student_name":"Adekemi Hanna Sijuwade-Ukadike","student_slug":"adekemi-hanna-sijuwade-ukadike","advisor_name":"Stefani Bardin","title":"Africa Maker","thesis_statement":"Africa Maker is a website for and about African inventors and creative technologists in Africa and in the Diaspora.","abstract":"Africans throughout the continent are making incredible technology, and creating solutions to cope with the ‘nuances’ of living in Africa. At the same time, Africans in the Diaspora feel that the narrative of the technology they are creating is not well represented in the media, in data sets and in artificial intelligence algorithms.\r\n\r\nAfrica Maker is a narrative-driven platform that seeks to showcase emerging African and African Diaspora technologists.\r\n\r\nLarge and small scale solutions to power outages, food preservation, waste disposal, fake pharmaceutical detection -- have been created. Who are these people? Where are their projects? How can I promote, propagate and provide them with resources?\r\n\r\nAs an African Maker I (Kemi) am creating an adaptive thumb piano that can be played in the browser with a mouse pad, touchscreen or by facial gestures.\r\n\r\nMy experience from being completely bed-bound for years, due to Guillain–Barré syndrome, to now walking with a cane, prompted me to create this musical instrument / interface. I am making it for people with weak upper body muscles who want to play a musical instrument.\r\n\r\nThis is an example of one of the ways that I am looking to convey the thought processes / cycles of the many devices and applications that Africans are making.\r\n\r\nI am into helping people. I was a physically strong woman, who became disabled and is now in recovery. I have had to be in the most vulnerable of positions…., down to someone having to dress and bathe and clean me everyday.\r\n\r\nSo, imagine an inventor struggling to make this thing to help their life, like a rudimentary prosthetic, but no one else can benefit from it because of privilege or exposure. This is the core spirit of Africa Maker. To help and promote people because they have chosen to make something to enlighten themselves and others.","context_research":"I stumbled upon this idea of creating an online space for current African innovators while browsing social media feeds. I watched, read and listened to stories of new projects created as a means to dealing with some distinctive African circumstance. I became passionate about the idea of devoting myself to empowering these burgeoning technologists.<br><br>\r\nAfrica Maker will begin as a website with feature articles about some African creative technologists in the New York area. In addition, the website will have resources that can be shared by other content publishers.<br><br>\r\n\r\nFrom my research, there is an increasing effort to develop innovation by Africans by countries such as the United Kingdom, China and Italy, as well as companies such as Johnson &amp; Johnson, the Tony Elumelu Foundation, AfriLabs, to name a few. \r\n<br><br>\r\nWhile these forces provide resources by way of funding, there is not much in the way of uncovering the narrative of the maker, and extending this narrative by providing resources beyond funding and some mentor ship.","technical_details":"My target audience is as follows:\r\n<br><br>\r\nUser 1<br>\r\n* African technology professional<br>\r\n* Interested in innovation<br>\r\n* Looking for ideas<br>\r\n* Wants to create something<br>\r\n<br>\r\nUser 2<br>\r\n* Creative person<br>\r\n* Interested in technology<br>\r\n* Interested in making anything<br>\r\n* Wants to connect to African identity<br>\r\n* Enjoys reading about African creativity<br>\r\n<br>\r\nUser 3<br>\r\n* Social media user<br>\r\n* Open to anything African and creative<br>\r\n* Young, possibly a student<br>\r\n* Looking for solutions<br>\r\n<br>\r\nThe Africa Maker Website is made using the Drupal 8 content management system.","further_reading":"<p>Innovation is a big subject in most African countries now. If you search for African innovation events, each week there are conferences, summits, festivals all about innovation. These events are promoting innovators through training, hackathons and entrepreneurship skill building.</p>\n<p>Tech hubs are gaining traction in most African countries. Tech Hubs are spaces that provide support by way of internet access, electricity and administrative support to the immediate local innovator community. According to GSMA (https://www.gsma.com/mobilefordevelopment/programme/ecosystem-accelerator/things-learned-tech-hubs-africa-asia/) “...We have been looking at all kinds of physical spaces that fall under the broad term of “tech hubs”: incubators, accelerators, co-working spaces, fab labs, makerspaces, hackerspaces and other innovation spaces. Incubators and accelerators – which provide start-ups with business support resources and services to help them scale…”</p>\n<p>The GSMA report goes on to say that around 50% of these hubs are in South Africa, Kenya, Nigeria, Egypt and Morocco and that other African countries have about one or two active tech hubs. According to the report, the regions leading the way for these spaces are Morocco, Tunisia and Egypt in North Africa; Nigeria, Ghana and Senegal in West Africa; Kenya and Uganda in East Africa; and South Africa in Southern Africa.</p>\n<p>In addition, according to the World Bank (http://wbgfiles.worldbank.org/documents/dec/Tech-Hubs-in-Africa.html,) “The recent development of tech hubs across Africa exemplifies how technology clusters create a snowball effect, whereby initial preconditions for success generate additional, mutually reinforcing innovation drivers. The comparative success of certain clusters, while others remain stagnant, suggests that organic, multi-stakeholder ecosystems work better than initiatives led by government, the private sector, or academia alone.”</p>\n<p>Included with this document is an image by Venture Capitalist that breaks down the location of these spaces and the funding they receive.</p>\n<p>The purpose of Africa Maker is to support the innovator by telling their stories and their processes, while also arming them with knowledge sharing content and information about where to find these events, tech hubs, funding and other opportunities.</p>\n<p>The Website has feature articles about African creative technologists in the New York area. For this I interviewed the following people:</p>\n<ul>\n<li>Ayo Okunseinde: A creative technologist and adjunct professor at NYU ITP, as well as Parsons</li>\n<li>Mimi Onuoha: A creative technologist and adjunct professor at NYU ITP, as well as Olin College</li>\n<li>Rasu Jimani (informally, for sources): Director of Recruiting and Community Engagement at New Inc.</li>\n<li>Jordan Muthra: A creative technologist that just created a music streaming app called Island Stream</li>\n<li>Abhita Austin: A music technology specialist and founder of The Creators Suite, a company to promote women in music.</li>\n</ul>\n<p>Creating the Website’s logo was a very personal experience for me. I wanted the logo to be in the style of contemporary African Art, but with some traditional context.</p>\n<p>I have always been drawn to the motifs used in many African artifacts. These symbols have meanings, and are usually connected to a tribe or village / locality.</p>\n<p>I sought to create an African mask, that identifies me, is true to mask design and that also includes a motif for makers.</p>\n<p>I decided to create it in p5.js mainly because I really can’t draw, nor illustrate, and the p5 platform has given me a canvas to program my vision.</p>\n<p>What does this mask mean? What is the symbology?</p>\n<p>I wanted the facial features: eyes, nose, mouth to be indistinguishably African, hence the pronounced nostrils and thicker lips. Though Africans have all sized facial features, there is no denying this look.</p>\n<p>I am from a town in Nigeria called Ile-Ife (Ife). In fact, most don’t even know that I am an African princess…, of like one of the highest orders. My family is among the group of the sons of the founder of the Yoruba race. (Law, R. C. C. “The Heritage of Oduduwa: Traditional History and Political Propaganda among the Yoruba.” The Journal of African History, vol. 14, no. 2, 1973, pp. 207–222. JSTOR, www.jstor.org/stable/180445.)</p>\n<p>I connect to my family, but because I was mainly raised here in the US, I have basically lived my own life, separated from the affairs and ceremonies of my really big and infamous heritage.</p>\n<p>The three lines on each side of the mask signify my locality. It says that the face is of an indigene of Ile-Ife. They are the tribal marks of the Ife people, well, at least according to this chart:</p>\n<p>Image from: https://face2faceafrica.com/article/face-african-tribal-marks-meanings</p>\n<p>The energy symbol is located on the forehead to signify that this is where all the maker feelings and intent comes from. It is a reminder to the viewer that creativity comes from the mind and that it is powerful.</p>\n<p>The smoky effect is to further compound the meaning of the strength that lies in the power of the mind.</p>\n<p>Here are the different versions of this mask:</p>\n<ul>\n<li><a href=\"https://editor.p5js.org/Kemlove/present/pYs5PzBuU\">https://editor.p5js.org/Kemlove/present/pYs5PzBuU</a></li>\n<li><a href=\"https://editor.p5js.org/Kemlove/present/MI_o-8egs\">https://editor.p5js.org/Kemlove/present/MI_o-8egs</a></li>\n<li><a href=\"https://editor.p5js.org/Kemlove/present/Oil6doubL\">https://editor.p5js.org/Kemlove/present/Oil6doubL</a></li>\n</ul>\n<p>There are many curated articles on <a href=\"http://www.africamaker.com\">www.africamaker.com</a>, see <a href=\"http://www.africamaker.com/notable-news\">www.africamaker.com/notable-news</a></p>\n<p>In addition:</p>\n<p>Articles / Publications</p>\n<ul>\n<li><a href=\"https://www.gov.uk/government/news/ambitious-new-innovation-partnerships-with-african-countries\">Ambitious new Innovation Partnerships with African countries</a></li>\n<li><a href=\"https://www.ispionline.it/it/pubblicazione/g7-and-africa-innovation-17853\">G7 and Africa: Innovation</a></li>\n<li><a href=\"https://www.huffingtonpost.com/naadiya-moosajee/is-africa-leading-the-inn_b_9018882.html\">Is Africa Leading the Innovation Revolution?</a></li>\n<li><a href=\"https://technologist.eu/10-great-african-innovations/\">10 great African innovations</a></li>\n<li><a href=\"https://qz.com/africa/1397982/the-danger-of-the-innovation-narrative-becoming-a-distraction-in-africa/\">The danger of the innovation narrative becoming a distraction in Africa</a></li>\n<li><a href=\"https://qz.com/africa/1389574/quartz-africa-innovators-2018-a-list-of-30-pioneers/\">https://qz.com/africa/1389574/quartz-africa-innovators-2018-a-list-of-30-pioneers/</a></li>\n<li><a href=\"https://qz.com/africa/1389574/quartz-africa-innovators-2018-a-list-of-30-pioneers/\">Quartz Africa Innovators 2018: A list of 30 pioneers</a></li>\n<li><a href=\"https://www.forbes.com/sites/mfonobongnsehe/2014/02/13/seven-innovative-products-from-africa-you-should-know/\">7 Innovative Products From Africa You Should Know</a></li>\n<li><a href=\"https://www.nytimes.com/2017/10/10/business/andela-start-up-coding-africa.html\">Start-Up Bets on Tech Talent Pipeline From Africa</a></li>\n<li><a href=\"https://www.the-scientist.com/news-opinion/initiative-aims-to-limit-excessive-red-tape-for-african-science-65423\">Initiative Aims to Limit Excessive Red Tape for African Science</a></li>\n</ul>\n<p>Organizations / Websites</p>\n<ul>\n<li><a href=\"https://innovation.thomsonreuters.com/en/labs/incubator.html\">The Incubator | Labs | Thomson Reuters</a></li>\n<li><a href=\"http://disrupt-africa.com/\">Disrupt Africa</a></li>\n<li><a href=\"https://www.africatechsummit.com/kigali/africa-startup-summit/\">Africa startup summit</a></li>\n<li><a href=\"http://www.openair.org.za/\">Open Air</a></li>\n<li><a href=\"http://www.africainlead.net/\">Africa Innovation Leaders</a></li>\n<li><a href=\"http://research.africa/\">Africa Innovation and Research</a></li>\n<li><a href=\"http://www.afrilabs.com/\">AfriLabs</a></li>\n<li><a href=\"http://www.africainnovationsummit.com/\">Africa Innovation Summit</a></li>\n<li><a href=\"http://africaninnovation.org/\">African Innovation Foundation</a></li>\n<li><a href=\"https://www.zuahub.org/\">ZuaHub</a></li>\n<li><a href=\"http://www.africainnovationnetwork.com/\">Africa Innovation Network</a></li>\n<li><a href=\"http://africafuturesummit.org/\">Africa Future Summit</a></li>\n<li>https://www.thegladiesafrica.com/</li>\n</ul>\n<p>Funding Resources for African innovation</p>\n<ul>\n<li><a href=\"http://graymatterscap.com/\">Gray Matters Capital</a></li>\n<li><a href=\"https://www.aasciences.ac.ke/aesa/programmes/grand-challenges-africa/gc-africa-innovation-seed-grants/\">AESA</a></li>\n<li><a href=\"https://www.mbtnconnect.com/africa-innovation-accelerator\">MBTN Accelerator Programme</a></li>\n<li><a href=\"http://www.greentalents.de/index.php\">Green Talents Competition</a></li>\n<li><a href=\"http://ventureburn.com/2019/01/global-startup-competitions-african/\">Here are 12 challenges and competitions African tech startups can enter in 2019</a></li>\n<li><a href=\"https://vc4a.com/\">VC4A</a></li>\n<li><a href=\"https://www.jnjinnovation.com/africachallenge/\">Africa Innovation Challenge, by Johnson &amp; Johnson</a></li>\n</ul>\n","tags":[{"name":"Culture","slug":"culture"},{"name":"Identity","slug":"identity"},{"name":"Narrative/Storytelling","slug":"narrative-storytelling"},{"name":"Social Good/Activism","slug":"social-good-activism"},{"name":"social practice","slug":"social-practice"}],"video_presentation_url":"https://vimeo.com/336813088","video_documentation_url":"","project_url":"http://www.africamaker.com","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/2H6A9894-768x512-1.jpg","title":"2H6A9894-768x512","alt":"kemi headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/africa-maker-logo-1.png","title":"Africa Maker Logo","alt":"Africa Maker Logo","caption":"Africa Maker Logo"},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Untitled-2.png","title":"Untitled-2","alt":"project image 1","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Untitled-1-1.png","title":"Untitled-1","alt":"project image 2","caption":""}]}