{"student_id":"90","student_name":"Lin Zhang","student_slug":"lin-zhang","advisor_name":"Kathleen Stevens Wilson","title":"Unwind - Conflict Resolution for Daily Practice","thesis_statement":"Unwind is a set of voice-controlled exercises that help young professionals to better understand others and resolve conflicts in collaborative work environments.","abstract":"In our modern work environment, knowledge-based professionals not only need to have the skill to perform complicated project goals and tasks, they also need to learn how to navigate and negotiate creative differences with their co-workers, supervisors, and clients.\r\n<br><br>\r\nWith this goal in mind, Unwind is designed to help young professionals with their daily work-related challenges and improve their ability to handle difficult situations.\r\n<br><br>\r\nUsing Unwind is easy. All you need to do is download the Google Assistant App or use Google Home device and say, “Talk to unwind”.  Then, Unwind will provide you with a series of questions and exercises to help guide you through a daily exercise review.","context_research":"My research for this project includes literature on conflict resolution, in-person experience with a professional mediator, testing out existing self-improvement apps, and technical documentation. Each category is listed as below:\r\n<br><br>\r\nLiterature on conflict resolution:\r\n<br><br>\r\nStone, Douglas, Bruce Patton, and Sheila Heen. Difficult Conversations: How to Discuss What Matters Most. New York, N.Y: Penguin Books, 2000.<br>\r\nFisher, Roger, Bruce Patton, and William Ury. Getting to Yes: Negotiating Agreement Without Giving in. Rev. ed. New York: Penguin Books, 2011.<br>\r\nRandolph, Paul. Psychology of Conflict: Mediating in a Diverse World. Bloomsbury Publishing, Feb 25, 2016.<br>\r\nTwo one-on-one session with Assistant Director for student conduct and conflict resolution, Colleen Maeder.<br>\r\n<br>\r\nFirst session we identified my personal conflict style and discussed differences between styles, and introduced PIN model of conflict resolution<br>\r\nColleen talk though a conflict in my life to using PIN model\r\nSecond session we further discussed listening and communication skills<br>\r\n<br>\r\nSimilar Products / Projects:<br>\r\n<br>\r\nRelax Guru<br>\r\nHeadspace<br>\r\nLucky Trivia<br>\r\nMusical Chair<br>\r\n<br>\r\nTechnical Documentations and books:<br>\r\n<br>\r\nHall, Erika. Conversational Design.  A Book Apart, Mar 6, 2018<br>\r\nGoogle, “Conversation Design”. Google, 2018, designguidelines.withgoogle.com/conversation/conversation-design/welcome.html<br>\r\nGoogle, “Building Actions for the Google Assistant (Level 1)”, Google, 2018, codelabs.developers.google.com/codelabs/actions-1/#0<br>\r\nGoogle, “Building Actions for the Google Assistant (Level 2)”, Google, 2018, codelabs.developers.google.com/codelabs/actions-2/#0<br>\r\nAmazon, “Alexa Voice Service Tutorials”, Amazon, https://developer.amazon.com/alexa-voice-service/learn","technical_details":"For picking a technical platform, I researched into two options: <br>Amazon Alexa and Google Assistant.  Amazon Alexa offers developer the access to tools that allow them to design applications for Alexa using Raspberry Pi. However, my goal is to get the content out to users. Google Assistant is the better choice for my current goal. <br><br>\r\n\r\nUsing Actions on Google, I was able to develop a prototype with ease. The deployment process was also very straight-forward. However, to make the final voice app, I will use more advanced features of Dialogflow , such as rich messages using custom payload.\r\n","further_reading":"<p>My motivation for this project is based on moments I had in my professional life I wish I was better prepared. During those difficult times, I looked for any media content - books, workshop, etc that reflected on similar situations. They helped me to understand, improve, and heal. I wonder if I would have felt and done better if I had access to good advice or tools.Although knowing how to having difficult conversations is a skill that affects our day-to-day life quality, it is a skill we are expected to learn as we get older. It is not taught in school. When it is being directly address, they are often set in professional business context - business books and seminars. There is a need for having an accessible way to learn how to address those difficult situations.</p>\n","tags":[{"name":"Business","slug":"business"},{"name":"Culture","slug":"culture"},{"name":"Identity","slug":"identity"},{"name":"Self-care","slug":"self-care"},{"name":"Tool","slug":"tool"}],"video_presentation_url":"https://vimeo.com/336836664","video_documentation_url":"https://vimeo.com/331479004","project_url":"https://linzhangcs.github.io/","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/default.png","title":"default","alt":"default","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thumbnail-9-1024x576.jpg","title":"Unwind","alt":"a person using unwind at the end of the day to relax and review","caption":"a person using unwind at the end of the day to relax and review"},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/thumbnail-9-1024x576.jpg","title":"Unwind","alt":"a person using unwind at the end of the day to relax and review","caption":"a person using unwind at the end of the day to relax and review"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/dan-farrell-unsplash-768x512-1.jpg","title":"dan-farrell-unsplash-768x512","alt":"image4","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/slideshow2-768x512-1.jpg","title":"slideshow2-768x512","alt":"image5","caption":""}]}