{"student_id":"91","student_name":"Michael Fuller","student_slug":"michael-fuller","advisor_name":"Kathleen Stevens Wilson","title":"Touch-An Interactive Art Installation","thesis_statement":"In a world of digital touch screens there is a disconnect with the touch of physical objects. My thesis is an exploration the interface between the physical object and the digital output through the installation of an interactive art object. Specifically, the relationship between doing a physical action and getting a digital reaction.","abstract":"Touch - An Interactive Art Installation speaks about the relationship between the physical object and the digital representation. There is an interactive experience that represents the physical touch of the object to create a digital experience in sound and image.\r\n<br><br>\r\nThe installation<br><br>\r\nThe display of a piece of Western desert Juniper wood on top of a pedestal with a piece of draped fabric mounted behind. <br><br>\r\nThere is a distance proximity sensor mounted on the front of the pedestal that activates an audio clip and an image of a desert thunder storm when people stand 2 -3 feet in front and the volume of the audio increases as people approach the pedestal.<br><br>\r\nThere are multiple close proximity sensors mounted on the surface of the pedestal around/beneath the juniper that activate different audio clips of desert sounds - wind, birds, etc. when people touch and move their hands around the surface of the juniper. As audio clips are activated, different images related to the different sounds and the desert are projected on the fabric hanging behind the Juniper.<br><br>\r\nThe relationship between the physical touch of the object and the digital output is an elusion. The touching of the physical object is being mapped in space by the sensors that are not connected, they are just sensing touch.","context_research":"Most of the research I have discovered is software and installations that delight in the interactive experience interface without the tension or effort I am looking to illustrate and convey in the interaction. I am researching natural materials as the interface with the digital translation like natural wood or stone. The key to the interface from physical interaction to the digital translation is the hardware. All of the research is still open ended as I clarify the concept and implementation.\r\n<br><br>\r\nResearch<br><br>\r\ninteractive touch breath art<br>\r\n7 Ways Technology is Changing How Art is Made<br>\r\nPlease Touch The Art<br>\r\nbreathe on digital screen create art<br>\r\nInteractive generative art<br>\r\n\r\nUseless machines<br>\r\n\r\ntraditional material use in a digital world<br>\r\n\r\nJuniper Trees Moab Desert\r\n\r\n","technical_details":"","further_reading":"","tags":[{"name":"Art","slug":"art"}],"video_presentation_url":"https://vimeo.com/336836725","video_documentation_url":"","project_url":"","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/default.png","title":"default","alt":"default","caption":""},"thumbnail_image":null,"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screenshot-2019-05-20-20.36.07-1024x576.png","title":"Screenshot 2019-05-20 20.36.07","alt":"michael fuller project image","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screenshot-2019-05-20-20.36.29-1024x576.png","title":"Screenshot 2019-05-20 20.36.29","alt":"michael fuller","caption":""}]}