{"student_id":"93","student_name":"Meicheng Jia","student_slug":"meicheng-jia","advisor_name":"Stefani Bardin","title":"Wu Wei","thesis_statement":"   An immersive projection installation experience inspired by the Chinese philosophy Wu Wei( peaceful mind). This experience is to reflect user's brain activity through visual art and to help people realize the importance of tranquility.","abstract":" Wu Wei was designed in order to encourage people to relax both their body and mind. It is an immersive interactive installation which exhibit the importance of tranquility through visual and sound. \r\n Wu Wei symbolizes the essence of a peaceful mind, by which means one should not force out any ideas, but to embrace the peacefulness and let ideas come to oneself, and that peaceful state of mind is the key concept from the philosophy of Daoism.<br><br>\r\n  The fast-paced modern life has brought people nothing but anxiety, people are often working under high pressure and the competitiveness of our culture are forcing people to try and to strive, which opposes the philosophy of Wu Wei. However, a lot of times constantly trying and striving can be the most inefficient way when it comes to generating ideas. For instance, for artists and musicians, a lot of the times creative ideas comes for us automatically, we can’t force it to come us.<br><br>\r\n  I want people to think this installation as the physical embodiment of a mind, each particle represents one idea, and when their brain is at ease, these small particles would form into a much larger sphere.The idea of using sphere instead of other shapes comes directly from Daoism, the Ba Gua Map, which represents balance and tranquility. ","context_research":"    During my research I read a book wrote by Edward Slingerland who is a professor of Asian Studies at the University of British Columbia. The book he wrote talked about the philosophy behind Wu Wei is the paradox of trying not to try, and he gave an example of a Mindball game. The game is a physical table where two players sit opposite to each other wearing EEG  headsets that senses their brain signals.The player who is most relaxed will have their ball score the opponents goal and win. I found that this game can perfectly explain the philosophy of Wu Wei, which is the more peaceful your mind is , the better result you will get. From this game I got inspiration to crate my installation.  My installation is a immersive projection room where users will use their brain to control the visual elements that projected in the room by wearing a EEG headset that monitor the peaceful level of their brain. The more tranquil the person is the more he will form the entire image.   \r\n\r\n","technical_details":"   Throughout my research, I found out the best way to evaluate one's mind peacefulness is though EEG sensor. EEG is a monitoring approach that report one's brainwave activity.  By wearing EEG sensors can monitor one's brainwave in six different band, which emphasis different function of our brain. For the purpose of my installation, I only need to monitor one's Alpha band brainwave, which reflect one's calmness level in the brain. By getting the raw Alpha data from EEG headset, I'm able to use serial communication to send this realtime data to let users control the scale, rotation and movement of the visual in Processing using their brainwave. \r\n    ","further_reading":"","tags":[{"name":"Art","slug":"art"},{"name":"Installation","slug":"installation"},{"name":"Performance","slug":"performance"}],"video_presentation_url":"https://vimeo.com/336817979","video_documentation_url":"https://vimeo.com/330915199","project_url":"https://www.meicheng-jia.com/wuwei","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/me-nyu-photo-768x432-1.jpg","title":"me-nyu-photo-768x432","alt":"meicheng headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/33BA3A6E-35B4-4393-866C-6A07A44B4FEA-1024x639.jpg","title":"33BA3A6E-35B4-4393-866C-6A07A44B4FEA","alt":"wuwei1","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/33BA3A6E-35B4-4393-866C-6A07A44B4FEA-1024x639.jpg","title":"33BA3A6E-35B4-4393-866C-6A07A44B4FEA","alt":"wuwei1","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/IMG_7937-1024x719.jpg","title":"IMG_7937","alt":"wuwei3","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/IMG_7940-1024x701.jpg","title":"IMG_7940","alt":"wuwei4","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-05-07-at-9.35.03-PM.png","title":"Screen Shot 2019-05-07 at 9.35.03 PM","alt":"wu wei","caption":""}]}