{"student_id":"96","student_name":"Marco Matteo Wylie","student_slug":"marco-matteo-wylie","advisor_name":"Nancy Hechinger","title":"Undercover","thesis_statement":"Undercover is an autobiographical performance that weaves vignettes of memory, music and pop culture imagery into a narrative that explores misogyny, gender, and identity from the perspective of a transman.","abstract":"As a transgender man, I’ve realized that there are things that men say to each other in the absence of women and things women say to each other in the absence of men. In fact, there are many changes I’ve noticed, particularly in the way that people treat and perceive me after transitioning. I now find myself in the predicament of being held accountable for a social history of misogyny that I’ve lived on the receiving end of for many years prior. Undercover shares this perspective through a 5-minute show.\r\n<br><br>\r\n The viewer doesn’t know any of this backstory when they enter the space. During the piece, the viewer listens and watches a narrative that uses sound, light, images, a two-way mirror, with an element of surprise at the end. It takes place inside of a curtained off, dark space, similar to a photo or fortune-telling booth, where the viewer enters and sits down on the chair in front of a black wall that frames a 12” x 12” mirror and puts on headphones. The narration begins with the viewer looking at their own reflection. A minute in, the lights are gradually dimmed, and images relating to the audio are projected on a screen on the other side of the mirror. In the last 45 seconds,  the images disappear and the light inside the space changes to reveal the narrator (me) sitting on the other side of the mirror. Putting myself in the space with the viewer on the other side of the divider, and making eye contact through the two-way mirror during the last moments of the show, breaks down the fourth wall and further humanizes the story. I understand that this may be a bit uncomfortable and that is by design.\r\n","context_research":"The Marina Abramovic piece The Artist Is Present was the inspiration behind having this be a one on one show. I like the intimacy it provides and the uncomfortableness of staring into a stranger's eyes. Because transitioning is a process that a person goes through on their own, I wanted to highlight this quality and have the audience member experience this installation alone while partially looking into their own reflection.<br><br>\r\nThe artist Cassils, in their piece Becoming An Image, fights with a large chunk of clay in total darkness. The audience only sees what’s going on when a single camera flash happens and a photograph is taken. This inspired me to begin in darkness and play with the idea of seeing and hearing glimpses of experiences without giving the full picture. I eventually decided not to include any direct interaction with the viewer, just like Cassils’ piece, because the purpose of the space is to give people a sense that they are alone with their feelings and thoughts, just as I felt while transitioning.     ","technical_details":"Initially, I wanted this to be housed inside of a rectangular mirrored box. But after realizing the time constraints I had, having a curtained off black box type of space was a better prototype for the time being. Eventually, I’d like to make the mirrored box I imagined, and perform inside of that space using the same space divider I built out of luan and framing wood. <br><br>\r\n    Due to the physical setup of this show, I had to create something to divide me from the viewer. I created a tabletop divider out of lauan and framing wood that houses the two-way mirror in the middle and allows for darkened space that keeps me separate from the viewer. The narration was recorded through a Zoom recorder and edited using Adobe Audition. I did multiple takes but settled primarily on the first one, taking bits of words or phrases from other takes and merging the files together. Since the recording was done in my bathroom (with my dog walking around in the background) I had to clean up the audio a fair amount. To get rid of the background noise I took a Noise Capture of about two seconds and processed the track to delete any unnecessary ambient sounds. Then I used a DeEsser plugin to get rid of the harsh s’s in my speech and Normalized the audio to -3 dB to ensure the volume never caps out in places where I talk louder. The images and video that are displayed come from YouTube, Giphy, screen capture from scenes in movies, home movies, and personal pictures. The video portion was edited using Adobe Premiere, and the face morphing clip was created using Adobe After Effects. ","further_reading":"","tags":[{"name":"Identity","slug":"identity"},{"name":"Memory","slug":"memory"},{"name":"Narrative/Storytelling","slug":"narrative-storytelling"},{"name":"Performance","slug":"performance"}],"video_presentation_url":"https://vimeo.com/337314215","video_documentation_url":"https://vimeo.com/331463321","project_url":"","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/profile-pic.jpg","title":"profile pic","alt":"profile pic","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Thesis-Picture-1-1024x576.jpg","title":"Thesis-Picture","alt":"marco","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Thesis-Picture-1-1024x576.jpg","title":"Thesis-Picture","alt":"marco","caption":""}]}