{"student_id":"97","student_name":"Mai Arakida Izsak","student_slug":"mai-arakida-izsak","advisor_name":"Adaora Udoji","title":"Salon109","thesis_statement":"Salon109 proposes a framework for creating meaningful connections in Social VR, by collaboratively constructing a space to safely start conversations and take ownership of the virtual world-building process.","abstract":"Salon109 is virtual place created on the High Fidelity social VR platform. While social dynamics in open virtual worlds have largely been unfavorable towards women, we have the means to create our own curated virtual places. Salons have historically been an important social force where women facilitate an exchange of ideas and culture in their living rooms. I am recreating this format within High Fidelity’s decentralized platform, which allows me to truly play host with my own domain and server. Like in the real salons, I can decide who can come in, who’s allowed to make changes, and best of all, I am able to invite my family and friends to create the world with me from within.\r\n<br><br>\r\nMy ethnic and cultural background is highly diasporic, and social VR metaverses represent a form of freedom wherein physical representations become less important, as we exist somewhere in the cloud. In a virtual social sphere, bodies are not threatened in the way some are in the physical world, allowing for the exchange of ideas and meeting new people without risk to physical safety. I have been developing my virtual identity, embodied in a unique avatar I uploaded, while extending my lifestyle to places that forsake geography.\r\n<br><br>\r\nThe collaborative creation of Salon109 takes place at https://hifi.place/salon, culminating in a virtual singing recital by my sister Aili. To best mitigate the reality that access to VR is limited, those without headsets are able to follow via a Youtube livestream and send in chat messages. When the space is in its final form, it will be packaged and sold at the High Fidelity marketplace on the blockchain for 1HFC (approx $0.01), as an offering to the platform.","context_research":"I began my research on networked virtual worlds with a project I developed in VRChat, Maispace, a safe place I call my virtual home. The privacy of the world allowed me to invite friends to explore the space, but I wanted to extend the project in a way that would allow me to host a semi-public space that others could contribute to as well. \r\n<br><br>\r\nOver the last year, I have been going to virtual events across several platforms, including Altspace, VRChat, and High Fidelity, in order to compare the community of each as well as new safety features and interactions. I have been inspired by Jessica Outlaw’s research on the relationship between virtual spaces and rules of behavior, and what makes a welcoming Social VR experience. I have also incorporated Facebook Research’s article on “Harassment in Social VR: Implications for Design”, and “Lessons from the Frontiers of Social VR” by Mike Booth. I am more aware of emerging findings thanks to the Voices of VR podcast by Kent Bye, and I’ve been reading Peter Rubin’s Future Presence: How Virtual Reality Is Changing Human Connection, Intimacy, and the Limits of Ordinary Life. I have learned about the history of virtual social dynamics through studies on Second Life and Real Virtuality: about the Destruction and Multiplication of World. by Gehmann, Ulrich, et al. \r\n<br><br>\r\nI was greatly inspired by Chris Milk's \"Life of Us\", and the performance piece “Becoming Dragon: a mixed reality, durational performance in second life” by Micha Cárdenas for their approach to becoming virtual and bridging the gap between realities.  ","technical_details":"My domain is hosted on a Digital Ocean server, running High Fidelity’s open source platform, using scripts for interaction written in Javascript. I am using an Oculus Rift to embody my avatar, which I created in Adobe Fuse and Blender.","further_reading":"","tags":[{"name":"3D","slug":"3d"},{"name":"Art","slug":"art"},{"name":"Culture","slug":"culture"},{"name":"Identity","slug":"identity"},{"name":"Performance","slug":"performance"},{"name":"social practice","slug":"social-practice"},{"name":"Speculation","slug":"speculation"},{"name":"VR/AR/Immersive","slug":"vr-ar-immersive"}],"video_presentation_url":"https://vimeo.com/336818226","video_documentation_url":"https://vimeo.com/331521973","project_url":"https://www.maispace.space/salon","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/2H6A9827-768x512-1.jpg","title":"2H6A9827-768x512","alt":"mai headshot","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-05-09-at-11.29.03-PM-1-1024x575.png","title":"Screen Shot 2019-05-09 at 11.29.03 PM","alt":"1","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-05-09-at-11.29.34-PM-1-1024x640.png","title":"Screen Shot 2019-05-09 at 11.29.34 PM","alt":"1","caption":"1"},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/stage3-1-1024x476.png","title":"stage3","alt":"1","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Screen-Shot-2019-05-05-at-2.06.13-AM-1-1024x693.png","title":"Screen Shot 2019-05-05 at 2.06.13 AM","alt":"1","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/Chin-Drawing.00_00_01_23.Still001-1-1024x574.png","title":"Chin Drawing.00_00_01_23.Still001","alt":"1","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/stage2-1-1024x484.png","title":"stage2","alt":"1","caption":""}]}