{"student_id":"99","student_name":"Mohammad \"MH\" Rahmani","student_slug":"mohammad-\"mh\"-rahmani","advisor_name":"Kathleen M Sullivan","title":"reFrame","thesis_statement":"“reFrame” is an interactive installation that shows you different ways of perceiving and understanding the same subject. It reveals and shifts your internal cognitive framework to give a visceral understanding of how subjective our world view is. \r\n","abstract":"We trust our worldview so dearly that we argue, fight, and go to war over it; but we are probably more wrong than we are right. We experience only a slice of the world around us, and we perceive it through not only our limited senses, but also through our limited semantics. Does being conscious of these fundamental limitations lead us to better conversations and less tension in society?\r\n<br><br>\r\nMetacognition - awareness of our subjective cognition -  is already a well known concept these days, both in academia and pop culture; therefore we know that mere knowledge of it is not introspective enough to change our discourse. “reFrame” tries to communicate this concept through first-hand intuitive experience: it shifts your mindset to derive different meanings from the same subject, revealing to you the paradigms that are controlling what you see.  \r\n<br><br>\r\nThis installation is made of three large vertical frames at eye level that stand between the user and a visual subject. Within each frame is a custom-built transparent display that superimposes text and graphics over the subject - essentially turning the frame into a large AR Heads Up Display. It also tracks your eyes and adjusts the image based on where you look at it or how far you are from it. \r\n<br><br>\r\nEach frame represents a different point of view and reveal a unique way of understanding the subject. They also play with your distance by showing different ways of grouping and analyzing the subject based on how much of it is cropped by the frame. \r\n","context_research":"\"The present day shows with appalling clarity how little able people are to let the other man's argument count, although this capacity is a fundamental and indispensable condition for any human community. -- For, to the degree that he does not admit the validity of the other person, he denies the 'other' within himself the right to exist -- and vice versa.  The capacity for inner dialogue is a touchstone for outer objectivity.\"\r\n<br><br>\r\nThis quote by Carl Jung from 1945 was randomly given to me in the middle of my research, and by the end of it I really puts my efforts into context.\r\n<br><br>\r\nI was mainly inspired by Dr. Dale Purves classes on visual perception and the brain. Studying perception from an empirical point of view opened my eyes to appreciate artists like Magritte, Escher, Turrell, and Irwin who tackle with perception and self-awareness. I experienced a similar introspection in psychology from the works of Piaget, C.G. Jung,  Neumann’s “Origins and History of Consciousness”, Haidt’s “Emotional Dog and its Rational Tail”, Pinker’s “Blank Slate”, and Peterson’s “Psycho-ontological Analysis of Genesis”; to name a few.\r\n<br><br>\r\nFrom there I saw connections with Middle Eastern philosophy, especially Persian mystics such as Rumi and Hafez. Later learning about Cybernetics from Paul Pangaro, and studying works of Heinz von Foerster and Humberto Maturana, helped put things in a functional context.\r\n<br><br>\r\nI also discovered others currently dealing with expressing the same general concepts. Beau Lotto and his book “Deviate” became a great resource. Later inspirations include Caroline Bergvall’s VIA, Games by Nicky Case, Kyung Woo Han, and Daihei Shibata.\r\n<br><br>\r\nDiscrete subjects include Godel’s uncertainty theorem, Kuhn’s paradigms, plus unsupervised learning and reinforcement learning in Neural Networks.\r\n<br><br>\r\nOn the technical side Zach Lieberman’s “Body Sketches” inspired me to build my own transparent display. Also, I believe my former obsession with Prezi presentation app was a key to figure out the UX. \r\n","technical_details":"The transparent display is a Pico DLP rear projecting on a sheet of special invisible projection material stretched inside the frame. This material is can either be fine scrim (e.g. Hologauze, Pepperscrim) or invisible plastic film. \r\nThe user’s head is tracked using a Kinect 2.0 over in TouchDesigner which creates the virtual 3D environment, animations, and projection mapping. \r\n","further_reading":"","tags":[{"name":"Art","slug":"art"},{"name":"Hologram","slug":"hologram"},{"name":"Installation","slug":"installation"},{"name":"Narrative/Storytelling","slug":"narrative-storytelling"},{"name":"VR/AR/Immersive","slug":"vr-ar-immersive"}],"video_presentation_url":"https://vimeo.com/336826800","video_documentation_url":"","project_url":"https://portfolio.mhrahmani.com/reframe","headshot":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/mh_photo.png","title":"mh_portrait","alt":"Portrait of M.H. Rahmani","caption":""},"thumbnail_image":{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/reframe-theframe-2-3-1024x576.jpg","title":"reframe-theframe-pipe","alt":"reframe detecting pipe on magrite with 0.985 accuracy","caption":""},"slide_show":[{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/IMG_20190507_161246-Edit-1024x576.jpg","title":"reframe-perojector-setup","alt":"A pico projector hung by a manfrotto magic arm attached to a manfrotto video head","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/reframe-theframe-2-1024x576.jpg","title":"reframe-theframe-front","alt":"reframe the frame front view with square projection","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/reframe-theframe-1-1024x576.jpg","title":"reframe-theframe-left-profile","alt":"reframe the frame from left three-quarters view with the projector on magic arm visible","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/reframe-theframe-2-2-1024x576.jpg","title":"reframe-theframe-pipe-magritte","alt":"reframe the frame detecting pipe on magritte","caption":""},{"src":"https://itp.nyu.edu/thesis2019/wp-content/uploads/2019/04/reframe-theframe-5-1024x576.jpg","title":"reframe-theframe-5","alt":"reframe - left profile","caption":""}]}