{"post_id":544,"student_id":"100","student_name":"Ji Young Chun","student_slug":"ji-young-chun","advisor_id":"131","advisor_name":"Stefani Bardin","advisor_slug":"sb4840","project_title":"Semper Simul","project_question":"<i>Semper Simul</i>, a real-time multi-user webVR experience, is my artistic approach to use current technologies to shorten the physical and emotional gap of my family, who are separated by long distance. I hope my family can use this technology to spend more time together and feel connected. \r\n<br />\r\n<br />\r\nSince I came to United States to study when I was 17, I have been living far away from my loving family in my home country, South Korea. My sister also left Korea shortly after. I miss my childhood when my family always stayed together under one roof, and enjoyed meals together everyday. \r\n<br />\r\n<br />\r\nHow can I recreate this feeling of togetherness with my family? According to a study, eating with one’s family is important because it not only helps the family to be mentally healthy but also makes them stay together. \r\n<br />\r\n<br />\r\nI believe that eating together is the most basic and meaningful family ritual that makes the family emotionally connected. What if my family can eat with each other everyday with the help of an immersive communication platform I create? To explore some possibilities, I made a webVR experience, where users can experience dining with other users by being immersed in a 3D scene, created with real-time depth footages of all of the participating users’ eating moments. \r\n<br />\r\n<br />\r\nThe users will feel like they are eating at one shared table in one shared virtual space by witnessing all of the participants’ dishes on one table and interacting with each other with their gazes and gestures. The 3D footages are captured with the Kinect depth camera, the real-time communication is executed through WebRTC (a javascript API for real-time web communication), and the whole scene is built in three.js (a 3D javascript library). Ultimately, I hope my family will be able to connect with each other more by sharing these eating rituals over long distance, because life is too short and I want to share more memories with my family even when we are apart.","short_description":"How can technology help my family emotionally connect when are separated by a great physical distance?\r\n<i>Semper Simul</i>, meaning ‘always together,’ is a real-time multi-user webVR experience to assist my physically separated family in creating an environment of togetherness by giving a feeling of eating together in one shared space.","further_reading":"<p><b>Personal Statement</b></p>\n<p>My dad shed tears when I left to study abroad in United States when I was 17. He always told me that family should stay together, but I was too ambitious and selfish. Finally, he let me go, saying that I should go if that makes me happy. I left to the United States, imagining a fantasyland where I can have freedom and greater opportunities.</p>\n<p>It was different from what I expected. I grew up living alone, feeling like an alien in a different universe. I was always too caught up with learning the new language and catching up with the foreign cultures, jokes, food, etc. The more energy and time I spent trying to fit into this new world, the less energy and time I had to communicate with my family. And thus, a gap was created between my family and myself.</p>\n<p>I am currently attending my third school in America, and I feel a disconnection between my family in Korea and myself. We are living different lives in different cultures and timezones. I sometimes feel so awkward talking to them in chat or video call and it makes me sad. I really want to somehow connect and feel the ‘togetherness’ we had when we were together, while not having to face the awkwardness. Can I achieve this using current technology?</p>\n<p><b>Process</b></p>\n<p>First, I tried to make a poetic, real-time synchronous communication between my family in Korea and myself by using physical computing and a network. I wanted to focus on reproducing the essence of eating together, so I created – a dining table that shows the shadows of our eating movements in real-time. Unfortunately, the synchronous aspect was not possible because of many technical factors such as the implementation of the LED table and attaching a camera to it to capture real-time shadows. </p>\n<p>So I made my project into a non-real-time one; I would capture my mom’s gesture from one specific dining instance and play the footage every time I eat, in order to feel like I can eat with her anytime. I tested with the shadow of my own gesture first. I found that it was not really exciting unless I over act my eating actions because people don’t actually move that much when eating, and the movement is repetitive. </p>\n<p>I didn’t really feel anything exciting after a while, other than when looking at the visual beauty of the artwork – blurred colorful LED lights under a semi-transparent white dinner table, which showed shadow animations of eating gestures. Then I asked my mom to record her gesture and tested with it on my own dining table at my apartment this time. </p>\n<p>It was interesting because I could finally feel like she somehow existed in my space. It felt different using a real footage of my mom because it gave a sense of her presence. However, I realized that I wanted to go back to my original idea of the real-time, active and mutual communication, not the passive observation like seeing a recorded shadow animation. The idea of feeling my mom’s presence was beautiful, but after a while it made me more sad.</p>\n<p>So going back to my initial question, what makes the good emotional connection over distance? My next attempt was to make something with a more active communication, something that’s alive, mutual, and ongoing. I wanted to make an immersive experience to make the best use of current technology. My experiments with the existing telecommunications platforms tell me that they fail to give a sense of physical coexistence between users because users merely talk to a flat video confined within a rectangular screen. To achieve a more fluid experience, the users will be able to feel like they are sharing a same ‘space’ together. </p>\n<p>So I started testing with the Kinect’s depth camera and putting the depth footages of my family into one space that lives in the web. Depth footage is good because I can sense the spacial depth in 3D, but it doesn’t show the accurate image of a person; it is rather a glitched image of a person in 3D. So I also tried using 360 camera and stitching footages in a same space together. 360 footage is good because the video is clear and the image is accurate, but it does not show the spatial depth. Because my goal is to make an emotional connection with my family, the clarity and accuracy is not the main concern. I would be able to see the clear and accurate shape of my family even through a video chat. Hence, I chose Kinect's depth camera. </p>\n<p>In order to make my family engaged in the experience of my work and differentiate it from existing platforms, I added some enjoyable factors to my experience, such as gestural interactions in a 3D virtual space. Here is where my artistic exploration to shorten a gap of my family, actually started.</p>\n<p><b>Research</b></p>\n<p><i>Health, Happiness and Eating Together – Adrian C Sleigh and others<br />\nCorrelations Between Family Meals and Psychosocial Well-being – Marla E. Eisenberg and others<br />\nEating together is important – L. Wright and others<br />\nThe Family That Eats Together, Stays Together – Alaina Anderson</i></p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thmb-e1524291318103.png","title":"Semper Simul","alt":"Semper Simul","caption":"Semper Simul"},"topics":[{"name":"Culture","slug":"culture"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/video/269232712","video_documentation_url":"https://player.vimeo.com/video/265496762","project_url":"https://www.jiyoungc.com/#/semper-simul/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thmb-e1524291318103.png","title":"Semper Simul","alt":"Semper Simul","caption":"Semper Simul"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/image1-3.png","title":"Semper Simul Image1","alt":"Semper Simul Image1","caption":"Semper Simul Image1"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/image2-4.png","title":"Semper Simul image2","alt":"Semper Simul image2","caption":"Semper Simul image2"}]}