{"post_id":102,"student_id":"102","student_name":"Luqian Chen","student_slug":"luqian-chen","advisor_id":"131","advisor_name":"Stefani Bardin","advisor_slug":"sb4840","project_title":"Foodies","project_question":"My thesis focuses on creating a real-life community with the goal of optimizing food resources and reducing food waste. Through establishing a mobile platform, Foodies is able to ease individual’s pressure of independently changing behaviors of wasting food. Instead, it relies on food to bringing people together to create communities, and eventually achieve the goal of reducing food waste. \r\n\r\nPut it in a simple way: if there is only chicken left in my fridge while there are merely some tomatoes and cheese left in yours; instead of purchasing more ingredients, (it might lead to more food waste,) we can bring our leftover together and cook them in order to reduce all of our waste and have a good experience at the same time.","short_description":"<i>Foodies</i> is a social platform aimed at reducing food waste by bringing people together through food.","further_reading":"<p>Introduction<br />\nFoodies is a social platform aimed at reducing food waste by bringing people together through food. On Foodies, food is the key element connecting people. Through food and cooking, Foodies make each connection real, meaningful and unforgettable.</p>\n<p>Food is badly managed and widely wasted in our daily life. According to American Wasteland, “American families throw out approximately 25 percent of the food and beverages they buy.” In particular, a survey conducted by Statista indicates that people less than 30 years old are considered to waste the most food compared to other age groups in the United States.   </p>\n<p>I decided to create Foodies targeting people who left parents and not yet build their own family (falling on the age group of 18-30). The urban millennial are tech-savvy. They are willing to be engaged in all kinds of social media. Foodies encourages them to consume all food left in their refrigerators through a social media platform. By sharing food and cooking together, it helps to create a real-life community and ultimately achieve the goal of optimize food resources and reduce food waste.<br />\nHow It Works</p>\n<p>You could add food items you want to share with others on your profile page. Then, you will find there are two ways to find out your cooking buddies based on two different use cases. </p>\n<p>Use case #1: a regular Friday night off-work party. It is always annoying to decide what and how much food you need to prepare for a party. It happens many times that you overbought food in the supermarket and wasted a lot food in the end. Foodies provides a convenient and eco-friendly way to organize the party. All you need is to create a private group on Foodies, take and upload a picture of food and ingredients in your and your friends’ fridges. By simply pressing the “Cook together” button, a recipe will be automatically generated by Foodies.</p>\n<p>Use case #2: People live in the same building. Foodies creates a new way for strangers saying hi to their neighbors by sharing food and cooking together. You can find people in an open group. You could also see all the food you can cook with people nearby. By choosing the system-generated recipe you love, you could find the neighbors who are able to offer the ingredients needed for this recipe. Lastly, you can simply send out the invitation and make the connection and cooking happen.</p>\n<p>How I Get There<br />\nI started my thesis with a big ambition to bring true value to people and make a positive impact on the society. The two projects I started last semester fit my goal well: one is about parking problem in NY and the other is about food. </p>\n<p>I spent the first three weeks of this semester researching parking problems in Manhattan. I learned about the street parking system functioning mechanism and pain points of the system. I also acknowledged existing products in the market and how they try to approach those issues. However, after a thorough research, I still couldn't generate a unique solution without first-hand experience. Considering the limited time (three months) and the goal of thesis (demonstrate what I learnt at ITP), I decided to pivot my direction to the food topic. </p>\n<p>Instead of conducting a research at the beginning, I visioned a food management solution, KIWI. I improved this online tool based more on my imagination than solid evidences of real problems. Without fully analyzing the data I collected through my design research and standing on the ground, I failed to see real problems and seek for other possible solutions. Besides, the key value of KIWI is to automatically grab data from grocery stores to free users from manual input. However, after two weeks of research, there is almost no way I can grab real-time shopping data from any grocery store here. Without this core function (synchrony grocery data), my product will not be able to compete against existing apps in the market.<br />\nTherefore, I stepped back and reviewed the whole scope of how people interact with food to my target user: the millennial and generation Z. I decided to put my previous idea away and adopted the new idea. I realized that it is hard to fix the issue of food waste alone but easier to solve it within a community through taking advantage of technology. In some cases, people know that food in their fridges is going to be spoiled but they let it be just because they lack ingredients to cook. So the idea of Foodies generated. </p>\n<p>Ending</p>\n<p>What is social media? Can a computer screen, and a bunch of “likes” really replace every day human to human interactions? Could we convert digital connections into a real tangible experience? Besides dating, could we guide this connection/match in a more meaningful way that brings more positive social impact?</p>\n<p>I am thinking these questions when I am developing Foodies. I hope my practice could contribute a unique perspective on this controversial topic.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/320240.jpg","title":"Foodies","alt":"Foodies","caption":"Foodies"},"topics":[{"name":"Society","slug":"society"},{"name":"UX\\UI","slug":"uxui"}],"video_presentation_url":"https://player.vimeo.com/video/269194837","video_documentation_url":"https://player.vimeo.com/video/263790058","project_url":"","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/320240.jpg","title":"Foodies","alt":"Foodies","caption":"Foodies"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Foodies_01-02.jpg","title":"Foodies01","alt":"Foodies01","caption":"Foodies01"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Foodies_02-01-1.jpg","title":"Foodies02","alt":"Foodies02","caption":"Foodies02"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/xcode.jpg","title":"xcode","alt":"xcode","caption":"xcode"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Foodies_03.jpg","title":"Foodies_03","alt":"Foodies_03","caption":"Foodies_03"}]}