{"post_id":442,"student_id":"106","student_name":"Miao Tian","student_slug":"miao-tian","advisor_id":"131","advisor_name":"Stefani Bardin","advisor_slug":"sb4840","project_title":"Commodity Fetishism","project_question":"Consumption is inevitable. It is in our nature and it is part of the whole ecosystem. However, excessive consumption is a social mentality. In our recent past, overconsumption was viewed as greed, a moral vice. In our current time however, greed is viewed rather differently. Living in our current economic society, we as consumers become further and further away from the production and waste department. Because of that consumption seems independent from the guilt of wasting someone’s hard work or polluting a piece of land somewhere. Consumers enjoy an exhilarating sensation by satisfying their greed.\r\n<br />\r\n<br />\r\nFor the project, instead of announcing statistic numbers of overconsumption and its effect, I’d like to have audiences experience it directly. I hope to generate an emotional linkage between our daily consumption life and the amount of waste we produce.\r\n<br />\r\n<br />\r\nThere are three players to participate three parts of this project: a shopper to a commercial shopping website; a consumer to a trash can controller device; a receiver to an interactive VR film. The shopping website represents the drive that pushes us to shop more and more. The trash can symbolizes the end of a product’s commercial life and the start of its waste life. The VR film visualizes waste that we don’t see. The shopper 'buys' products and corresponding waste will show up in VR for the receiver. The consumer will step on a physical trash can and release the trash in VR. The receiver will endure the outcome, then the players can rotate and experience each other’s action.","short_description":"Consumption has become an exhilarating indulgence in today's economic culture. However, consumers are remote from creation, production and demolishment of commodities. Many developed fetishes on commodities. The purpose of this project is to recreate an emotional linkage between overconsumption due to our social mentality and its harmful effect. ","further_reading":"<p>Consider the following quote by Gordon Gecko in the movie Wall Street:</p>\n<p>The point is, ladies and gentlemen, that greed, for lack of a better word, is good.<br />\nGreed is right.<br />\nGreed works.<br />\nGreed clarifies, cuts through, and captures the essence of the evolutionary spirit.<br />\nGreed, in all its forms—greed for life, for money, for love, knowledge—has marked the upward surge of mankind, and greed—you mark my words—will not only save Teldar Paper, but that other malfunctioning corporation called the U.S.A.<br />\nThank you very much.</p>\n<p>I began to think about why and how I became to gain environmental awareness. Environment was never a priority in my family ethics. I probably had the same amount of exposure to environmental education as average people at my age. So why is it that I start to care about the issue?</p>\n<p>I don't know if it is a psychology effect, but once I really notice something, I will see that something more and more in our lives. If this is true to most people, then the first \"notice\" is crucial. I wonder if I create a similar effect of my initial \"notice\", will it turn the switch on in other people's mind?</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumb.jpg","title":"thumb","alt":"Enduring Commodity Fetish","caption":"Enduring Commodity Fetish"},"topics":[{"name":"Society","slug":"society"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/video/269233550","video_documentation_url":"https://player.vimeo.com/video/266524878","project_url":"","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumb.jpg","title":"thumb","alt":"Enduring Commodity Fetish","caption":"Enduring Commodity Fetish"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/visualDoc1a_T.jpg","title":"visualDoc1a_T","alt":"","caption":"Shopping Fetish"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Doc3.jpg","title":"visualDoc_T","alt":"Trash can in the kitchen","caption":"Trash can in the kitchen"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/visualDoc3_T.jpg","title":"visualDoc3_T","alt":"VR","caption":"VR experience to reality"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/visualDoc4-1.jpg","title":"visualDoc4","alt":"Player Experiences","caption":"Players experience 3 characters' roles"}]}