{"post_id":100,"student_id":"109","student_name":"Ran Tian","student_slug":"ran-tian","advisor_id":"131","advisor_name":"Stefani Bardin","advisor_slug":"sb4840","project_title":"Heart Health","project_question":"Unlike some disease that can be instantly felt by the patient or can be life threatening, cardiovascular disease is a silent killer. One third of patients after a cardiac event are not adherent to their medication irrespective of the cardiac medication prescribed, which is a major high growth situation in the US and globally. Patient adherence to medication is crucial for risk reduction following a cardiac event. Cardiac rehabilitation is complex and the workflow consists of 5 phases: patient ID, referral management, enrollment, patient rehabilitation, and maintenance. My thesis is focusing on patient rehabilitation and maintenance.\r\n<br />\r\n<br />\r\nThe primary reasons that cause non-adherence after a cardiac event are no symptoms, not filling the prescription, complexity, forgetting, cost and side effects. To address these problems, I’m creating a visually rich AR experience that will improve medication adherence, patient engagement, and create a better relationship between the patients and their heart anatomy to help them think about medication and rehab differently.\r\n<br />\r\n<br />\r\nTargeting the elderly, but highly applicable for youth as well, this AR app has three primary features: medication education via AR animated heart modules; integrated apple watch with realtime heart rate data; fun, emotional, and engaging gamified notifications for medication management. By turning the burdensome rehab trajectory into  an experience of a beautiful garden inside the room, the process becomes more like meditation rather than work.","short_description":"Through a visually rich AR experience, <i>Heart Health</i> helps cardiac patients understand in layman’s terms the impact of the medication they are taking directly on their heart health, and improves medication adherence by gamifying medication management; it also provides heart condition monitoring by integrating apple watch’s heart sensor.","further_reading":"<p><iframe src=\"https://player.vimeo.com/video/265311444\" width=\"640\" height=\"1385\"></iframe></p>\n<p><a href=\"https://vimeo.com/265311444\">Documentation</a> from <a href=\"https://vimeo.com/user57219316\">rantian</a> on <a href=\"https://vimeo.com\">Vimeo</a>.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Thumbnail.png","title":"Thumbnail","alt":"Heart Health AR app","caption":""},"topics":[{"name":"Health","slug":"health"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/video/269234120","video_documentation_url":"https://player.vimeo.com/video/265311444","project_url":"http://www.tianrandesign.com/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Thumbnail.png","title":"Thumbnail","alt":"Heart Health AR app","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/heart_BetaBlocker.png","title":"heart_BetaBlocker","alt":"How Beta Blockers Work","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/CheckMyMeds.png","title":"CheckMyMeds","alt":"CheckMyMeds","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/EatMe.png","title":"EatMe","alt":"Take My Meds","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/TakenMyMeds.png","title":"TakenMyMeds","alt":"TakenMyMeds","caption":"TakenMyMeds"}]}