{"post_id":452,"student_id":"110","student_name":"Samantha Schulman","student_slug":"samantha-schulman","advisor_id":"131","advisor_name":"Stefani Bardin","advisor_slug":"sb4840","project_title":"Breathe With Me","project_question":"Anxiety disorders affect more than 40 million Americans, many of whom suffer from panic attacks. Panic attacks are unpredictable, debilitating episodes typically characterized by shaking, chest tightness, difficulty breathing, and intense fear. The combination of fear and physiological symptoms continues to heighten one another, escalating the panic attack. Paralyzed with fear, one’s breathing becomes short and shallow. While some strategies for coping with anxiety involve meditation or medication, I want to offer a new solution, one that transforms the anti-anxiety techniques of both diaphragmatic breathing and applied deep body pressure into a garment that could be worn anywhere.\r\n<br />\r\n<br />\r\nThe result, <i>Breathe With Me</i>, is is a wearable t-shirt that leverages the expansion and compression of pneumatics to encourage the wearer to focus on and control their breathing during moments of panic and anxiety. The user squeezes a hand-pump to inflate two air pockets that hug their chest and back, providing comfort in the application of gentle pressure. The hand-pump itself is soft and tactile, shaped to match the form of a person’s hand, and absorbs muscle tension to provide stress relief. The repeated squeezing of the pump combined with the soft compression develops a pattern that simulates deep breathing, guiding the user to practice breathing together with their garment. Essential oils are also dispersed with each pump as an additional calming element.\r\n<br />\r\n<br />\r\nFurthermore, in creating <i>Breathe with Me</i>, I challenged myself to try to uphold environmental ethics when selecting materials, despite the lack of resources available for fast and affordable sustainable production. My final prototype is made with soft white cotton fabric by the way of vintage laundry bags, and silicone, which is non-toxic throughout its entire lifecycle when properly developed.","short_description":"<i>Breathe With Me</i> is a wearable t-shirt that leverages the expansion and compression of pneumatics to encourage the wearer to focus on and control their breathing during moments of panic and anxiety.","further_reading":"<p><b>Personal Statement</b></p>\n<p>I can remember a reoccuring moment from my childhood in which I am eating cereal at the breakfast table before school, when I unexpectedly feel nauseous and begin to shake. I fall down onto the floor and make my mom check for my heart beat. However, in just a couple of hours, I am feeling normal again. At the time neither myself, my mom or even heart doctors knew what was wrong with me, but looking back, these episodes were so clearly panic attacks. To this day I continue to experience symptoms of anxiety such as shaking, lightheadedness, and obsessive worry about mundane events that often manifest into panic attacks.</p>\n<p>Although I now understand what is happening to my body in these moments, I have not yet mastered how to prevent the episodes from occurring. The stress will follow me home and keep me awake all night. I have been on medication for many years, but only recently began learning about alternative therapies such as meditation and deep breathing techniques. For my thesis project, I wanted to develop a new therapeutic system that utilized the benefits of diaphragmatic breathing and could be taken with me everywhere.</p>\n<p><b>Background / Research</b></p>\n<p>“Complementary and Alternative Therapies in Occupational Health: Part II--Specific Therapies” (Bascom, 2002).<br />\n“Stress reduction techniques result in \"physiologic and mental health benefits from decreased oxygen consumption, and decreased heart and respiratory rate\" and \"improve mood, spiritual caïm, and heightened awareness\" (Kowalak, 2001). Diaphragmatic breathing, visualization, meditation, and yoga are stress reduction techniques that can be used anytime - at home or at work - to reduce anxiety (Benson, 1992; Kowalak, 2001; Pettinati, 2001; Weil, 1995).\"</p>\n<p>“Multimedia Assisted Breathwalk Aware System” (Yu et. al., 2012).<br />\nThe program helps patients learn walking meditation through feedback audio that syncs the user’s footsteps with their breathing patterns.</p>\n<p>“A Chinese Mind-Body Exercise Improves Self-Control of Children with Autism: A randomized Controlled Trial” (Chan et. al., 2013).<br />\nNei Yang Gong, a Chinese Chan mind-body exercise intended to enhance self-control in children with Autism Spectrum Disorder (ASD). Regarding anxiety, depression, insomnia and chronic pain, researchers have found therapeutic effects in mind-body interventions. The therapies focus on the interactions between the brain, mind, body and behavior in the form of slow exercise patterns that emphasize smooth, gentle and calm movements. The mind is used to influence physical and mental health through self-awareness and control to help restore a calm and relaxed state.</p>\n<p><i>Calm Clothing</i><br />\nBrand of undergarments that fit tight around the body while maintaining comfort to apply firm pressure that calms the nervous system.</p>\n<p><i>Sensewear by Emanuela Corti and Ivan Parati</i><br />\nA set of wearables aimed to relax children living with ASD. One piece in particular caught my interest, a jacket and hood that inflates entirely around the body, squeezing the user to provide shelter and comfort.</p>\n<p><i>MIT Media Lab’s Living Breathing Textile</i></p>\n<p>The textile embeds live bacteria directly into the wearable design, which expand when exposed to moisture. Intended for athletes who sweat, the clothing will automatically open up to circulate air around the athletes body. Although not a product for anxiety patients, the researchers' project gave me the idea to create a garment that helps guide breathing patterns.</p>\n<p><i>Eunjeong Jen</i></p>\n<p>Interaction design artist who describes her work as, “understanding how the emotion, sensory and movement dimensions of the lived body contribute to object creation in relation to human health and well-being.” She designs user-centered emotional objects and human behavioral processes, such as her project that heals by providing vibration therapy.</p>\n<p><i>“Psycho-textiles”</i></p>\n<p>This new category of fabrics apply studies on the interaction between the brain and the surrounding environment. Research describes how sensory elements such as color and texture in a fabric can influence human emotion. I was now further intrigued about the senses including the efficiency of aroma, sound waves and vibration on reducing anxiety.</p>\n<p><i>Audience</i></p>\n<p>Breathe With Me was initially designed with myself as the target user. I constructed my final prototype to fit my body and would like to use the garment as a tool to help reduce anxiety throughout my everyday life, as a 26-year-old designer living in New York City. Once I build a successful and reproducible design, I plan to iterate the garment to share with others struggling from anxiety disorders, to better their mental health and well-being as I did my own.</p>\n<p><i>Implementation</i></p>\n<p>My idea came to life one night when I was playing with a family member’s blood pressure pump and noticed the calming effects from repeatedly squeezing the pump and feeling the air released. I made my first prototype by taping material around the valve to test the feeling of inflation via the pump.</p>\n<p>The problem with making a pneumatic wearable is that most fabric is porous and therefore will not inflate. I did not want to purchase heat-sealable nylon, often used for making soft inflatables, due to the harmful environmental impact of nylon.</p>\n<p>I instead wanted to use a rubber material, that could be substituted in a later iteration, to seal air pockets on the inside of my fabric. Silicone works great and is a petroleum-free alternative to plastic rubbers. With help from my peer, Chester Dols, I made silicone molds directly onto the base shirt fabric. By my fourth prototype, I understood the properties of silicone and was able to create a durable and effective model.</p>\n<p><img src=\"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/IMG_7544.jpg\" /></p>\n<p>I initially practiced with dirty scrap fabric, but for my final prototype I found ultra-soft second hand cotton fabric to utilize.</p>\n<p><img src=\"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/fabric.jpg\" /></p>\n<p>I wanted the hand-pump to also be soft and soothing to hold and maximized for accessibility and function. For example, it could not be too stiff or shaped oddly as to cause pain in the hand or arm of the user. I also struggled with placement of the pump, as it needed to attach to the shirt but still be accessible underneath a jacket or sweater.</p>\n<p>The design is fully mechanical and user-operated in order to strengthen the control that the mind has over itself and its body. Tactile gestures and touch feedback invite the user to take deep breaths together with their garment. Breathe With Me is a soothing embodiment tool that helps the wearer to prevent the escalation of a panic attack and influences a general feeling of calmness throughout their daily life, ultimately improving their mental health and well-being.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumb2-size-2.jpg","title":"","alt":"thumb","caption":""},"topics":[{"name":"Health","slug":"health"},{"name":"Tangiable","slug":"tangiable"}],"video_presentation_url":"https://player.vimeo.com/video/269195463","video_documentation_url":"https://player.vimeo.com/video/265843631","project_url":"https://www.samanthaschulman.com/2018/04/17/breathe-with-me/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumb2-size-2.jpg","title":"","alt":"thumb","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/MG_407722222.jpg","title":"","alt":"front","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/MG_410822222222.jpg","title":"","alt":"back","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/IMG_378522222222.jpg","title":"","alt":"","caption":"pump"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/MG_3957222222.jpg","title":"","alt":"me","caption":""}]}