{"post_id":140,"student_id":"112","student_name":"Xitong Xu","student_slug":"xitong-xu","advisor_id":"131","advisor_name":"Stefani Bardin","advisor_slug":"sb4840","project_title":"The Birth of the Self Portrait (1889)","project_question":"This project is a tribute to Vincent Van Gogh, and his famous self-portrait oil painting from  1889, by converting the post-impressionist static painting into a dynamic storytelling platform  through an AR platform.\r\n<br />\r\n<br />\r\nWhat's the story and creation process behind this legendary self-portrait? What happened to the artist and his life right before this painting was finished? What’s the environment? The static painting itself it's just the very last frame of this whole story. This platform aims to address this buried yet consequential information within the painting itself amplifying this contextual information through the colors and brush strokes on the final piece.\r\n<br />\r\n<br />\r\nVan Gogh went through a lot in 1889, and in his letters to his brother, he wrote about the influence of many things on himself and the continuous impact this had on his psyche and artistic sensibilities all of which greatly influenced his creations.The creation story and the painting are not mutually exclusive, they depend on each other and give each other adde depth, nuance, and impact.\r\n<br />\r\n<br />\r\nThis AR project is about expressing the mutually reinforcing relationship between the creation story and the artwork. The existing way for the audience to do that is reading the description labels in the museum next to the painting, the experience is not immersive enough. This platform can shift our perceptions of art, history, storytelling, context, and experience. When you run the AR application on the mobile device and focus the screen onto the Self-Portrait (1889) painting, the audience is going to see the animation of the birth story of this painting. It takes the painting and translates it into real-time virtual animations. Also, the visualization sends the paint daubs of the self-portrait into swirling patterns of motion, the brush strokes will be animated into dynamic flows.","short_description":"This project is a portrait of the portrait of Vincent Van Gogh that he completed in 1889. I am using AR technology to layer the history and emotional and lived experience of Van Gogh at that time. It aims to use new technologies to explore the multi-faceted layers of storytelling and history that are often absent in two-dimensional paintings hung in a gallery or museum.","further_reading":"<p>How can I demonstrate the connection between Van Gogh's mysterious artistic creation process and his artwork to help people understand he and his work better? Is there a better storytelling way to convey the creation story instead of a description label with long text next to the painting? This project is created based on above questions, aiming to present a new platform for expression connecting artistic creation story with reality.</p>\n<p>Van Gogh completed this painting in 1889, which is the very last year of his life. He lived in Arles, created most of his famous paintings including The Starry Night, made a self-mutilation, finally committed a suicide next year. A lot of things happened to him that year, he wrote a bunch of letters to his brother, Theo, talk, and sketch about his emotions, his feelings, his surroundings... All of this things influenced him and his works a lot. The story in the AR platform is inspired by what Vincent wrote in the letters in 1889, he even wrote many intuitive descriptions of how he felt about his own face: \" I observed myself critically in a mirror...I hope you will notice that my facial expressions have become much calmer, although my eyes have the same insecure look as before, or so it appears to me.\" And to his sister \"I am looking for a deeper likeness than that obtained by a photographer...\" Thus the content of this animation clip will visualize the environment Van Gogh was in during the creation process, how he observed himself in the mirror, recreate his concrete thoughts using abstract visual style.</p>\n<p>Ideally, this project will be applied as an extension to understand better for people who're browsing Van Gogh's paintings via various platforms (galleries, books, website, etc.).</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/archivethumb.png","title":"The birth of the portrait","alt":"The birth of the portrait","caption":""},"topics":[{"name":"Narrative","slug":"narrative"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/video/269195855","video_documentation_url":"https://player.vimeo.com/video/265284376","project_url":"https://www.notion.so/Week-10-Archive-Statement-a92ef483b3da455f815eacde1867e0ee","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/archivethumb.png","title":"The birth of the portrait","alt":"The birth of the portrait","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/with-title-1.png","title":"titleimage","alt":"title","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/floating-back.png","title":"hand hold demo","alt":"hand hold demo","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Ar-demo-2.png","title":"demo 2","alt":"ardemo","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/gallery-scene.png","title":"gallery scene","alt":"gallery demo","caption":""}]}