{"post_id":424,"student_id":"12","student_name":"Kyung A Na","student_slug":"kyung-a-na","advisor_id":"114","advisor_name":"Adaora Udoji","advisor_slug":"aeu4","project_title":"Synesthesia","project_question":"Have you ever been to a concert in a big park, like Central Park? Have you experienced music in a large outdoor venue? These are questions of interest to me, so I chose to focus on them in my thesis. Augmented reality (AR) is a way to experience music and visuals in a new way. \r\n<br />\r\n<br />\r\nNowadays, AR is a very popular topic in the technology industry, a reason why I have been imaging everything in a world tagged by AR. Furthermore, I imagine AR visual effect with music will bring new sensation and unique experience to people. Therefore, I decided to create a music visualization hololens application by using AR effect called <i>Synesthesia</i>. This application enables the AR visual effect synchronized with audio rhythm. AR is the most advanced visual effect and flexible in reality. Through hololens, people can feel themselves immersing into reality compared to just looking at a small screen of smart phones. \r\n<br />\r\n<br />\r\nMoreover, I imagine that people will use smart glasses than smart phone. I believe that if people could listen to music with synchronized visual effect, they can get a more advanced level of inspirations. Adding onto my theory is the location of this application. \r\n<br />\r\n<br />\r\nI decided on Bryant Park as it has a rectangular shape and is surrounded by the graphical buildings. Combining reality with the nature and AR effect, people can feel the surrealism when listening to music. ","short_description":"<i>Synesthesia</i> is a music visualization hololens application that will be used in Bryant Park. Hololens provides sound, space, and space depth with visual effect in reality. These features utilize the mixed reality visualization with sound which translates into audio music visualizer. ","further_reading":"","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbsupArtboard-1.jpg","title":"thumbsnail","alt":"hmhm","caption":""},"topics":[{"name":"UX\\UI","slug":"uxui"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/video/270189992","video_documentation_url":"https://player.vimeo.com/video/265500077","project_url":"http://www.dianana.net/synesthesia/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbsupArtboard-1.jpg","title":"thumbsnail","alt":"hmhm","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/0Artboard-1.jpg","title":"1","alt":"ssss","caption":"nothing"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/1Artboard-1.jpg","title":"1Artboard 1","alt":"Start","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/2Artboard-1.jpg","title":"2Artboard 1","alt":"Musics","caption":"Synesthesia music files"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/3Artboard-1.jpg","title":"3Artboard 1","alt":"Music!!!!ß","caption":"what?"}]}