{"post_id":599,"student_id":"14","student_name":"Li-Chung Chen","student_slug":"li-chung-chen","advisor_id":"114","advisor_name":"Adaora Udoji","advisor_slug":"aeu4","project_title":"Iso-principle in the Digital World","project_question":"Iso-principle is “a technique by which music is matched with the mood of a client, then gradually altered to affect the desired mood state. This technique can also be used to affect physiological responses such as heart rate and blood pressure” (Davis, Gfeller, &amp; Thaut, 2008). This method has been widely adopted in the industry, however, this technique requires a certified music therapists to be present which is very expensive and not always accessible. Therefore, this project will be focusing on recreating the same experience in the digital platform. \r\n<br />\r\n<br />\r\nThe software created for this project will be collecting user’s physical data such as their motions and heart-rates, then use these data to modify the music users are listening to. Furthermore, this system can also affect user’s physiological responses. By modifying the music in certain ways, it can either increase or decrease user’s heart-rate and blood pressure to help users to achieve their desired mood state.","short_description":"This project focusing on recreating the Iso-principle in the digital platform.","further_reading":"<p>According to the American Heart Association (AHA), they recommend doing exercise that increases a person's heart rate to between 70 to 85 percent of their maximum heart rate for at least 30 minutes everyday. This range is called the target heart rate zone. Such exercise can increase the strength of cardiac muscle, thus decrease the chance of having a stroke or other cardiac disease. The most common cardiac exercise would be jogging and most people like to listen to music while they jog. However, one problem people face is that the music they listen to doesn’t match their heart-rate. According to Prof. Dr. Benenzon, “The patient’s mental tempo has to correlate with the sound-music tempo” (Benenzon, 1999), which means human has a tendency to match the tempo, so if the bpm of the music is lower or higher than user’s target heart-rate, it will create a psychological conflict and decrease the effect of the exercise. </p>\n<p>Furthermore, The ISO principle has also been used successfully in preoperative settings. A study was conducted using the ISO principle in this setting in which music was played at a tempo that matched the patients’ normal rhythms. The rhythms were gradually slowed, the tone made softer and the pitch lowered.  Due to the slow tempo and softness on the tone and pitch, the patients’ required fewer anesthesias and awoke from surgery easier with fewer side effects (Using music listening in nursing, 2002).</p>\n<p>Music therapy is one of the most effective and non-invasive treatment for most of the mental illness, however, the lack of accessibility and expensive bill have kept lots of patients from getting such treatments. Therefore, as a musician and entrepreneur, I have created a company focusing on building the best music therapy app. Since mental health is a very personal matter, I believe customization and interactivity will be the most crucial features in order to create the best experience. So far in the app, there are guided meditations specifically produced for different types of mental stress and each meditation has its own customized background music, which user can adjust the ratio between narration and the background music, while also applying reverb on the audio to have a more immersive experience. However, all these adjustments are only manually adjustable, which then gives me the idea of digitize Iso-principle in the app. </p>\n<p>When a patient go see a music therapist, they don’t tell the therapist what type of music or tempo they want, patients are only suppose to listen and let the music and narration guide them through the session, which is exactly what this project is trying recreate in the digital platform.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/iso-principle-in-the-digital-world.jpg","title":"iso-principle in the digital world","alt":"11","caption":"thumbnail"},"topics":[{"name":"Health","slug":"health"},{"name":"Sound","slug":"sound"}],"video_presentation_url":"https://player.vimeo.com/video/270206245","video_documentation_url":"https://www.youtube.com/embed/GM9_w7I2Bd4","project_url":"https://roninofficial.com/iso-principle-in-the-digital-world/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/iso-principle-in-the-digital-world.jpg","title":"iso-principle in the digital world","alt":"11","caption":"thumbnail"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/iso1-1024x576.png","title":"iso1","alt":"1","caption":"1"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/iso2-1024x554.png","title":"iso2","alt":"22","caption":"22"}]}