{"post_id":283,"student_id":"20","student_name":"Amanda Min-Jin Lee","student_slug":"amanda-min-jin-lee","advisor_id":"123","advisor_name":"Kathleen Sullivan","advisor_slug":"kms829","project_title":"JAM-JAM","project_question":"I love music and we all love music. Music is always on in our daily lives. Music is powerful as it can change the mood of the environment and the people that reside in it. These shared musical spaces bring out strong emotional connections between each listener. Hip-hop, jazz, classical; these are different genres that deliver different emotions and moods, depending on where we are and who we are with. \r\n<br />\r\n<br />\r\nHowever, sometimes an annoying situation happens when we are listening to music together with friends. Somebody needs to control the music. But it is hard to satisfy everyone because we all have different musical tastes. If there are more than two people in the same room who have different musical tastes, who will make the decision for what’s playing on the stereo? \r\n<br />\r\n<br />\r\nBased on this question, my goal was to find an answer to this small dilemma in my own playful way. How can I shuffle music playlists in a fair and equal way?\r\n<br />\r\n<br />\r\nI ended up with two keywords: “competition + shuffle”. I wanted the users to focus on the music-listening experience rather than the competitive action, so I chose a simple and dynamic “shaking” interaction for the game. It is fast and dynamic, so that users may quickly associate this action with the process of mixing music.","short_description":"This is a mobile app that solves the world’s greatest problem… who gets to control the music playlist? <i>Jam-Jam</i> is a playful and democratic music player that helps create a mixed playlist that everybody can enjoy.","further_reading":"<p>'Jam-Jam' is a multi-user mobile app that shuffles multiple music playlists automatically through a simple competitive game. It is for a small group of people listening to music in the same space.</p>\n<p><img src=\"https://preview.ibb.co/k7k5Gx/ppt6.jpg\"></p>\n<p>\n<b>User case</b></p>\n<p>Just imagine you are chilling with your friends in your place. You guys want to turn on some music, but whose music? There must be some people who want to control the music or maybe no one. Use this app in these cases. Make everyone to participate to share their music tastes. If someone wants to play his/her music more than he/she should win the game, and if someone doesn’t want to play his/her music than let them just relax.</p>\n<p>Based on the score of each player, the app will shuffle the playlists that the players created in the beginning and play the music automatically. “If you want to play your music more, shake it more”, the highest scores from the game will get more opportunities to play his/her music!</p>\n<p><iframe src=\"https://giphy.com/embed/1qY9wGUOPG5Npy8G68\" width=\"480\" height=\"270\"></iframe></p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/amanda-01-1024x768.jpg","title":"amanda","alt":"-","caption":"-"},"topics":[{"name":"Play","slug":"play"},{"name":"UX\\UI","slug":"uxui"}],"video_presentation_url":"https://player.vimeo.com/video/269184766","video_documentation_url":"","project_url":"http://www.amandamjlee.com/#/jamjam/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/amanda-01-1024x768.jpg","title":"amanda","alt":"-","caption":"-"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/1-01.jpg","title":"Web","alt":"-","caption":"-"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/3-01.jpg","title":"Web","alt":"-","caption":"-"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/2-01.jpg","title":"Web","alt":"-","caption":"-"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/4-01.jpg","title":"Web","alt":"-","caption":"-"}]}