{"post_id":536,"student_id":"21","student_name":"Bryan Hsu","student_slug":"bryan-hsu","advisor_id":"123","advisor_name":"Kathleen Sullivan","advisor_slug":"kms829","project_title":"Cascade","project_question":"<i>Cascade</i> is an autobiographical virtual reality film that explores an experience of near death. When I was young, I almost drowned. I remember what it felt like: the struggle of grasping onto hope, and the eventual release of it. The experience of it never really left me, and the goal of the film is to recreate these complex feelings. My mother also experienced something that many fear to even think about: the unknown status of her child’s well being. To this day, more than 15 years later, my mother still recalls this event as the worst moment of her entire life.\r\n<br />\r\n<br />\r\nI view VR as a tool to immerse people into scenarios that are often un-experienceable in their life. I also view it as a therapeutic tool that aids in expressing complicated thoughts. It’s hard to describe to people what life changing experiences feel like because no one can truly imagine all the nuanced emotions and feelings present during the described event.\r\n<br />\r\n<br />\r\nVR is a medium where perspective and point of view is the focus. I am recreating these perspectives to share with people because it’s the only way that I am able to truly surface these guarded emotions.","short_description":"Cascade is a cinematic VR project that retells the near death experience of its creator. The piece delves into the natural discomfort of virtual reality and how this discomfort can be utilized as a catalyst for surfacing buried emotions.","further_reading":"<p>I wanted to focus on my memory of that day and because it is a memory, I want the experience to feel dreamlike. Dreams feel grounded in reality, yet when something abstract occurs, the dreamer does not question it. The user will experience these memories in first person perspectives of my mother and myself.</p>\n<p>The main tool I am using for this process is Unity3D. I found that Unity3D, with its many plug-ins, assets, and developer support, was the best technology for me to use.</p>\n<p>I also wanted the design of the characters to rely a lot on sound. Because this is a memory, each character has a ghostly presence. Instead of focusing on realistic avatars of myself and my mother, I focused more on the audio. I used noises, voices, and lights to depict each character. The sounds are all recorded or found online and imported into Unity to create immersive sound for the VR environment.</p>\n<p><b>Story</b></p>\n<p><i>Scene 1: Kitchen, Mom POV</i></p>\n<p>The story begins on the perspective of my mother. She is doing motherly things in the kitchen. Eventually I appear and inform her that I am going to the pool. She says goodbye and to come back soon for lunch. I leave the house, and she continues to work. The atmosphere is bright yet something seems off.</p>\n<p><i>Scene 2: Pool, My POV</i></p>\n<p>I am in the pool. I hear children running and playing. The pool is shallow. I put on my snorkel mask and the world changes. The pool becomes a serene heavenly place. As I dive under the water, the pool expands to be infinite. I explore. Until something strikes my face, knocking away my snorkel mask. I panic.</p>\n<p><i>Scene 3: Acceptance, My POV</i></p>\n<p>I try to surface, but nothing goes as planned. As I try to breathe, more and more water fills my lungs. I look upwards and see the sun get dimmer and dimmer. The world underwater gets darker and claustrophobic. The sound of my heartbeat slows. Eventually I take a deep breath, even though I know I’m underwater. Everything goes black.</p>\n<p><i>Scene 4: Refusal, Mom POV</i></p>\n<p>My mother senses something is wrong. The house gradually falls apart and she sees in the distance a the fading sound and light of me. She starts her journey to me, but is met with pounding waves. She perseveres, crying out for me. Eventually she reaches me.</p>\n<p><i>Scene 5: Finale, My POV</i></p>\n<p>I see a faint light and hear a familiar sound. Vision becomes clearer. My eyes open and I see my mother. Words are exchanged. I am close to giving up, but my mother reassures me. I am alive, and she cries. Water flows, but the streams are calm.</p>\n<p>To see more in depth documentation on this project, please visit my website.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail-cascade2.png","title":"thumbnail-cascade2","alt":"Cascade thumbnail","caption":"Cascade thumbnail"},"topics":[{"name":"Narrative","slug":"narrative"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/video/269185366","video_documentation_url":"","project_url":"https://bryanhsu.com/cascade","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail-cascade2.png","title":"thumbnail-cascade2","alt":"Cascade thumbnail","caption":"Cascade thumbnail"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/large_imagesArtboard-2.png","title":"large_imagesArtboard-2","alt":"cascade title","caption":"Cascade"}]}