{"post_id":504,"student_id":"26","student_name":"Jennifer G Tis","student_slug":"jennifer-g-tis","advisor_id":"123","advisor_name":"Kathleen Sullivan","advisor_slug":"kms829","project_title":"In Their Steps","project_question":"<i>In Their Steps</i> is a concept for a mobile app bringing users on a guided audio walking tour of the women’s suffrage movement that took place in New York City in the early 1900s. Following the same path suffragists often marched during their popular parades, users walk in the footsteps of the individuals who fought for women’s right to vote while learning about the suffrage movement and the women who led it. \r\n<br />\r\n<br />\r\nWhile <i>In Their Steps</i> is focused on exploring the past, it also makes connections to the present, particularly the Women’s Marches of the past two years. My hope is that people who are interested in the recent marches can use In Their Steps to learn about women from the past who engaged in similar acts of protest, find connections with women who marched years ago, and find inspiration to continue fighting for women’s rights. \r\n<br />\r\n<br />\r\nI’m interested in creating experiences that help us uncover the past in interesting and engaging ways, and my goal is that <i>In Their Steps</i> does that for people who are curious to learn about the history of women’s rights in New York City. ","short_description":"A walking tour app exploring the history of New York City’s women’s suffrage movement and its connections to today’s Women’s Marches. The app takes users along the same route suffragists marched, as they listen to stories, discover landmarks, and view historical images using augmented reality.","further_reading":"<p>Inspiration &amp; Research: Over two years ago, I joined the Women’s March in New York City and was inspired by the magnitude and spirit of the event. During the march and in the time since, I wondered about women in the past who participated in similar acts of protest. Had there been earlier women’s marches on the same streets where I was walking? Did women in the past march for any of the same causes supported by the Women’s March? With these questions in mind, I began to research the women’s suffrage movement in New York City. </p>\n<p>My research included interviews with women who participated in the Women’s Marches, visits to women’s history exhibits at the New York Historical Society and the Museum of the City of New York, and combing through archival documents about the women’s suffrage movement, including newspaper articles, journals and images.  The information from these materials was crucial in defining the direction and narrative of In Their Steps. Learning about the small details of women’s suffrage parades that took place in New York, such as the what suffragists wrote on the signs they carried or the lyrics to the songs women sang as they marched, helped to shape the path of the walking tour, define the points of interest on the route, and build the overall story told during the experience. </p>\n<p>Additional research included reviewing the landscape of existing products and experiences similar to In Their Steps, including walking tour apps such as Detour, Urban Archive, and the East Village Poetry Walk. I also researched online resources dedicated to women’s suffrage and AR applications and experiences focused on historical content. </p>\n<p>Prototyping, Testing &amp; Feedback: After narrowing down the scope of the content, I began to simulate the user experience of <i>In Their Steps</i> through a series of prototypes, both paper and digital, in order to test the experience and collect feedback. </p>\n<p>Early user testing helped me understand the type of content people were interested in hearing and seeing, and how to frame the story I was telling about women’s suffrage. Through testing, it quickly became apparent the 'hook' that kept a user’s attention was how women’s suffrage connects to today’s Women’s Marches. Using this feedback, I reframed the narrative of In Their Steps to more clearly show the common threads that connect the suffrage movement with recent protests. </p>\n<p>Later user testing helped guide the flow of the user experience and design of In Their Steps. Feedback received during testing helped me optimize the experience and simplify the design of the app. I heard from testers that I needed to strike the right balance of how often the user was expected to interact with their phone. Some users did not constantly want to be glued to their phone, but others wanted to be able to rely on the app as a navigational guide and view imagery that supported the words they were hearing. This feedback led me to limit the number of images included during the experience and also to give the user the option to view additional photos for each point on their phone if they chose. </p>\n<p>How it Works: <i>In Their Steps</i> starts in Washington Square Park, the place where many women’s suffrage parades began. Users follow the same route suffragists walked, heading north on Fifth Avenue until 57th Street, continuing west for two blocks and ending at Carnegie Hall, the site of many rallies and speeches that took place at the conclusions of suffrage parades. </p>\n<p>The route is three miles long and takes about two hours to complete, with 18 points of interest along the way. As the users reaches a point, they select it on the map to reveal more information. While the experience is designed for people actually walking along the route, users also have the option to experience In Their Steps remotely. </p>\n<p>Each point includes a recorded audio piece and historical images that describe a part of the women’s suffrage movement connected to the place the user is standing. The audio features original content as well as excerpts from historical publications that covered specific suffrage parades and the larger movement. The historical text, which often includes incredible detail, helps to put the user in the scene of suffrage parades of the past at that location. </p>\n<p>The historical photos that accompany each point can be viewed in one of two ways, depending on the type of image. Photos that were taken at identifiable locations along the route are shown using AR. Using a photo of the present day location as a guide, users are prompted to point their camera at a building or landmark, launching a historical photo from a suffrage parade in that same location. Viewing historical images against the backdrop of the present day locations where the photos were taken allows users to see scenes from suffrage parades come to life in the places they originally occurred. Other images which are not directly related to a location, such as photos of people or memorabilia, are simply shown in the app. </p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thesisarchivethumbnail.jpg","title":"thesisarchivethumbnail","alt":"iPhone app displaying ahistorical image with New York City's Washington Square Park in the background","caption":""},"topics":[{"name":"Society","slug":"society"},{"name":"UX\\UI","slug":"uxui"}],"video_presentation_url":"https://player.vimeo.com/video/269194560","video_documentation_url":"","project_url":"https://jenntis.github.io/intheirsteps/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thesisarchivethumbnail.jpg","title":"thesisarchivethumbnail","alt":"iPhone app displaying ahistorical image with New York City's Washington Square Park in the background","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/InTheirSteps_Archive1-01.png","title":"InTheirSteps_Archive1-01","alt":"In Their Steps: Follow the path of New York City's suffragists","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/tisarchive2-01.png","title":"tisarchive2-01","alt":"Screenshot of three screens from In Their Steps mobile app","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thesisarchiveimage1.jpg","title":"thesisarchiveimage1","alt":"iPhone app displaying ahistorical image with New York City's Washington Square Park in the background","caption":""}]}