{"post_id":195,"student_id":"27","student_name":"Jingfei Lin","student_slug":"jingfei-lin","advisor_id":"123","advisor_name":"Kathleen Sullivan","advisor_slug":"kms829","project_title":"Runway in Store","project_question":"The retail industry is undergoing a major transformation as e-commerce disrupts traditional brick-and-mortar store models and gives rise to new modes of “experiential retail.” By creating a more immersive retail experience, retailers can drive people towards their stores and ensure they leave not just with your products but also memories. Runway in store explores how technology can enhance the retail experience, and especially adopts Augmented Reality to provide shoppers the experiences that engage, inform and entertain. \r\n<br />\r\n<br />\r\nRunway in store is a physical playground that encourages customers in the retail store to move around and interact with the augmented visuals that are projected on the wall or an LED screen, where a Kinect v2 is used to capture the real-time the human image and drive a real-time movement of a 3D character in Unity. By choosing Nike as the brand, the AR installation tracks human motions with multiplayer features and metaphorical explorations of the augmented 3D visuals.\r\n<br />\r\n<br />\r\nCustomers then could save and share the looks to social media, so that the brand can employ social media as a means of reaching out and connecting with potential customers.","short_description":"<i> Runway in Store</i>  is a projection-based Augmented Reality photo booth installation designed for Nike retail store. It explores the future of retail experience using AR with Kinect that gives shoppers compelling new interactive experiences. ","further_reading":"<p>'Retailtainment' is predicted to dominate the industry, the fusion of retail and entertainment, an effort on the part of retailers to provide customers with fun, unique experiences that elevate shopping above anything it’s previously been. A key element of experiential retail is the innovative use of technology to provide interactive and immersive experiences. </p>\n<p>'70% percent of users become regular customers after an experiential marketing event.' — EventTrack, 2016</p>\n<p>'86% of event marketers believe that technology can have a major positive impact on the success of their events.' —Bizzabo, 2017</p>\n<p>So how can we attract customers to visit retail stores if they could buy online? Except for the cool but expensive physical installations, what other technologies could bring more possibilities and convey the brands' attitudes in a more creative way? The emerging technology, Augmented Reality is incorporated by some forward-thinking retail brands into the customer experience, which could enable customer engagement, trigger more user-generated content on social media. AR technology is also scalable and easy to change themes for different stores, with minimum budget. </p>\n<p>For my thesis, I narrowed it down to choose particularly Nike as the brand and design the customized retail experience for their stores. As a sportswear brand, Nike adapts to current trends, continuously uses new technologies to make more enjoyable experiences for their customers and maintains their brand image in all aspects which my thesis idea could perfectly fit in. The target audience would be young-adult customers (aging between 18-30) who are tech-savvy and love sports. Most importantly, they are constantly looking for fun experiences to share on social media.</p>\n<p>Initially I wanted to build a mobile AR app, that could enable users to track their foot movement and see the triggered effects on the screen which led to three technical directions for detecting human movement: Machine learning: Vision framework (iOS) or YOLO with CoreML (iOS), Vuforia 3D object recognition, Kinect with creative coding.</p>\n<p>My first mobile prototype uses CoreML vision framework which processes a live feed from the camera and extracts information from each frame using both built-in and external machine learning models. However, the real-time object detection results are not reliable even if there are no big moves; The marker-based AR framework Vuforia has size limitations to the scanned object (which ideally would be the shoes), and the 3D object recognition may also lose track sometimes. </p>\n<p>So I finally decided to go with Kinect v2 which can capture the RGB images and sense the depth data. I also chose Unity 3D as the developing platform that enables 3D visual programming. Here is how the space setting looks like: customers enter the playground facing a Kinect and a wall to be projected or a big LED screen. The Kinect will track human movements and 3D augmented visuals will be showing on top of the RGB images. </p>\n<p>I designed the implemented an algorithm for the augmented 3D visuals with motion trails and particles. All of the parameters could be adjusted and customized easily such as the color, particle lifespan, texture and so on. The algorithm works like this:</p>\n<p>Layer 0: Kinect RGB image as background image.<br />\nLayer 1: Augmented 3D visual effects. Use Kinect v2 to drive a real-time movement of a 3D character (model).<br />\n- Map the Kinect skeleton data to a rigged mesh<br />\n- Use the Skinned Mesh Renderer component to render Bone animations, where the shape of the Mesh is deformed by predefined animation sequences.<br />\n- Use vertices of an animating skinned mesh as emitting points.<br />\n- Computes the velocity and acceleration of each emitting points and generates particle effects accordingly.</p>\n<p>In terms of the scalability of my AR installation, I was thinking about how to make it easy to change themes and also flexible to implement for different stores, with minimum budget. The solution is:</p>\n<p>- Extract the human silhouette from what Kinect sees<br />\n- Remove the annoying surroundings background<br />\n- Replace with the customized 2D image or add 3D scenes<br />\n- Add shader that reduces the disturbing edges caused by silhouette extraction</p>\n<p><img src=\"https://lh5.googleusercontent.com/rFnNoJSMmfxAQ3YJkKmgL3jb68rodE2X94JDH7vE4sOY-2RAjGGD1QoZlWSMlk18okFqPtY-iLt2mzkvdMFGkLK4irfeKXPkxIjSOecFLZBssLv1jQChNeHpMI-Tl-aItTGvlOyvldQ\"></img></p>\n<p>Adding the shader helps a lot with the overall experience and performance since the edges remained after extracting the silhouette are not clean and look like fake low-tech photoshop effects. So shader comes to help reduce the annoying effects and creates cool looks with the psychic filters on top of human faces. In this way, it is convenient to modify the image or 3D scenes for whatever stores/themes. I could replace the Kinect RGB image background with a simple Nike logo and add 3D objects to interact with.</p>\n<p>Runway in store could create the typical instagrammable experience that builds the brand awareness at the same time. Although Nike is an ideal “first brand partner” at a fundamental starting point, it also provides scalability and flexibility for other potential retail partners.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/THUMBNAIL.jpg","title":"Runway in store","alt":"Runway in store","caption":""},"topics":[{"name":"Installation","slug":"installation"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/video/269194683","video_documentation_url":"https://player.vimeo.com/video/261384538","project_url":"https://jadelin.work","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/THUMBNAIL.jpg","title":"Runway in store","alt":"Runway in store","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/runway-t.gif","title":"runway-t","alt":"screen","caption":"Screen demo"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ZEBRA.jpg","title":"Space setting","alt":"","caption":"Space setting with kinect and projection"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ME.gif","title":"","alt":"Flashing shader demo","caption":"Flashing shader demo"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ins.jpg","title":"social media","alt":"Experience marketing with social media","caption":"Experience marketing with social media"}]}