{"post_id":477,"student_id":"3","student_name":"Ari Melenciano","student_slug":"ari-melenciano","advisor_id":"114","advisor_name":"Adaora Udoji","advisor_slug":"aeu4","project_title":"OJO ORO Neo-retro Experimental Cameras","project_question":"At a time when alluring technology hyper extends the possibilities, we tend to forget the earlier analog inventions that played crucial roles in culture without the instant advancement of technical convenience. So, what if in applying the emerging technologies to analog inventions, we explored and discovered a world of the best of culture and innovation?\r\n<br />\r\n<br />\r\nThere are a variety of different forms of photography, from digital to film to instant, and they have each played into the development of society and culture. Cameras are a tool used to document life, and can often be used as a artistic expression. Through <i>OJO ORO</i>, I explore photography for artistic purposes, self identity, artistic expression, brand identity, design, and user experience to build a brand and product experience that creates moments of wonder.","short_description":"In applying emerging technologies to analog inventions, and developing human-centric, visceral brand strategies, what are the possibilities for an experimental neo-retro camera company?","further_reading":"<p><iframe src=\"https://player.vimeo.com/video/265495988\" width=\"640\" height=\"360\"></iframe></p>\n<p><a href=\"https://vimeo.com/265495988\">Building the Ojo Oro Camera</a> from <a href=\"https://vimeo.com/ariciano\">AriCiano</a> on <a href=\"https://vimeo.com\">Vimeo</a>.</p>\n<p>I am interested in exploring the art, philosophy and science of building a brand along with the possibilities when using design to engineer moments of wonder by applying emerging technologies to the analog invention of a camera in the form of an experimental neo-retro camera line.</p>\n<p><i>Ojo Oro</i> (golden eye) is a line of experimental neo-retro cameras. Neo-retro is the coined phrase that was developed in the creation of <i>Ojo Oro</i>, meaning to apply emerging technologies to analog inventions in innovative and explorative forms. The way that <i>Ojo Oro</i> is neo-retro is by its use of augmentation of the analog/film camera experience in a digital setting. The way that the camera works is by using digital mechanics to take a photo, that is then immediately and randomly altered to appear as if it has been taken with a film camera. To further mimic the film experience, there is no screen on the camera, forcing the photo to be \"developed\" in the \"cloud\" and sent to the user's paired app. This is both a hardware and software experience. The strategy of the brand is to organically start from inward, out. What is the core mission of <i>Ojo Oro</i> (or \"Golden Eye/Eye of Gold\" when translated from Spanish to English)? To allow users to explore their own artistry in an intentional and well-designed holistic and immersive experience. My audience is recreational photographers (people that enjoy photography as a hobby) between the ages of 15-30 years. These consumers also value design and style within products and their products' branding. The camera is intended to be used recreationally, artistically and for social purposes. Once the user has turned on their camera, they can begin exploring the different settings and taking photos. They eventually move to the app, where the photos have been \"developed\" and ready for view. These photos have all sorts of spontaneous film-like distortions, whether it is a few light burns, or intense film grain. The photos can be immediately shared to social media. The user can also scroll through the app to discover photos taken by other Ojo Oro owners (building a community) and discover different techniques and <i>Ojo Oro</i> tools/accessories used—forming an 'open-source' photography experience as well as innovative e-commerce platform. </p>\n<p>The key features of the <i>Ojo Oro</i> camera line includes a product design of high aesthetics (intricate camera design), seamless communication between the camera and paired app, a neo-retro approach to film photography via digital processing, interchangeable lenses, innovative e-commerce opportunities, eventual personalization of camera design, and more. </p>\n<p><b>The Story</b></p>\n<p>There has been a recent surge in gravitation toward nostalgic and vintage items and inventions. Yet, there still hasn’t been a company that successfully pairs these different worlds (of digital and nostalgia with a hint of experimentalism) together into a camera business. This has been discovered through extensive research. I've observed attempts by camera companies to build a digital/film experience and also witnessed the excitement that has developed around their missions. But most of them have failed to deliver on the holistic experience. </p>\n<p>We are moving to a time where a few things are simultaneously happening:<br />\n-The camera business is slowly but steadily declining in camera sales<br />\n-DSLRs are moving to retro product design<br />\n-The number two top selling camera is a compact mirror-less DSLR<br />\n-In the age of the \"cloud\" Millennials still appreciate tangible experiences<br />\n-There is a surge for the vintage and retro (from vinyl to film cameras)<br />\n-Intense saturation of digital photography </p>\n<p>What I take from this is:<br />\n- With the camera business slowly but steadily declining in camera sales (there leaves a lot of room for innovation and disruption of standard camera practices)<br />\n-With DSLRs now moving to retro product design, there is a recognition for an appreciation of camera design from a generation ago<br />\n-With the number two top selling camera being a compact mirror-less DSLR, people want more compact camera products and no longer feel that large cameras are \"more\" professional<br />\n-In being in the age of the \"cloud\", millennials still appreciate tangible experiences -- therefore the experience of Ojo Oro will be appreciated as a hardware device (it is not necessary and possibly more appealing, to not just be another app that edits photos - but rather an entire photography experience)<br />\n-With there being a surge for the vintage and retro (from vinyl to film cameras), it is perfect timing to build this<br />\n-With the intense saturation of digital photography, it is important to find ways to make the photos produced from this camera, signature and engaging </p>\n<p>I arrived at this idea after having been interested in photography for so many years. When I travel, usually half of my suitcase is an assortment of different kinds of cameras serving very distinct purposes (film - for the timelessness and photo aesthetic, dslr for the photo quality, smartphone for the convenience in sharing on social media, instant cameras for their \"coolness\" and sociability). And, from when I first started taking photos and doing post-editing, I always gravitated towards altering my photos to appear as if they've come from a film camera -- as well as seeing many other creatives do the same. I began exploring the idea of building a camera this is beautiful in design and reminiscent of the intricate detail of film cameras of the 1940s-60s, and that combines and creates the best of all worlds when using digital, film and instant cameras.</p>\n<p><b>Research</b></p>\n<p>My research process began with my own experiences, being a recreational photographer/filmmaker for about 10 years using almost every kind of camera - from point and shoot digital to DSLRs to film to instant to action and 360 degree cameras. I was able to observe and analyze the structure, function and design of cameras from a variety of different brands. It also began with the different post editing apps that I have used over time, always to make my photos appear as if they had come from a film camera (when taken on a digital) and to enhance colors and contrasts (when taken on film). I've also documented my experiences in engaging with communities/brands through their different marketing touch points from their package design to presentation in stores to their e-commerce platform. I have done competitive analysis with similar brands, from Holga to Fujifilm to Sony to Polaroid. In this research, I've discovered different trends within their revenue streams, marketing strategies and consumer activities. Now it is time to study consumers and what I am discovering to be my target market. I've been able to generally narrow it down to recreational photographers between the ages of 15-30, appreciates style and design within product design and branding, and shop at stores like Urban Outfitters. I have spent time researching who my customer market is by conducting interviews with people from a variety of different backgrounds and interests, hobbyist and professional photographers, artists/creatives, fashionistas, and more. Through my research on human-centric and viscerally oriented business strategies, I have read works from IDEO, Ikea, and Stone Yamashita Partners (specifically Keith Yamashita). I've spent time observing hardware businesses that focus on style and design within their branding and product design, such as Lomography, Teenage Engineering, and Apple. I have also spent time analyzing the brand and community development of other companies that conduct those practices well, such as VSCO, Urban Outfitters, NYLON, and more.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ari1.png","title":"OJO ORO","alt":"OJO ORO","caption":"a line of neo reto experimental cameras."},"topics":[{"name":"Tool\\Service","slug":"toolservice"},{"name":"UX\\UI","slug":"uxui"}],"video_presentation_url":"https://player.vimeo.com/video/270187242","video_documentation_url":"https://player.vimeo.com/video/265496134","project_url":"https://www.ojooro.com","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ari1.png","title":"OJO ORO","alt":"OJO ORO","caption":"a line of neo reto experimental cameras."}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ari2.png","title":"OJO ORO","alt":"OJO ORO","caption":"a line of neo reto experimental cameras."},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ari3.png","title":"OJO ORO","alt":"OJO ORO","caption":"a line of neo retro experimental cameras."}]}