{"post_id":618,"student_id":"30","student_name":"Paula Leonvendagar","student_slug":"paula-leonvendagar","advisor_id":"123","advisor_name":"Kathleen Sullivan","advisor_slug":"kms829","project_title":"Oneiric Lab","project_question":"<b>The installation</b>\r\n<br />\r\n<br />\r\nOutside a dark room, there is a computer where the audience can input dreams, which are added to a database that connects the installation and the web platform. The web platform collects the dreams people share, and the installation creates written and audiovisual poetry with them. \r\n<br />\r\n<br />\r\nInside the room there are two projections that represent inner and external aspects of the dream experience. In the walls there is projected a 3D animation of electronic poetry that moves around, appearing and disappearing. The written poems are created by a program that picks random sentences and words from the database made from what the visitors have shared. This decontextualizes the unitary dreams, mixing ones with others.\r\n<br />\r\n<br />\r\nAt the center of the installation, there is a round structure that looks like the top of a human skull. Inside there are projected image sequences created by an algorithm that emulate dream narratives with automated video techniques, subtly related to the dreams users share through word associations. The videos are tagged with words, and depending on the words of the dream, random videos will be selected by the program to create the sequences.\r\n<br />\r\n<br />\r\n<b>The web platform</b>\r\n<br />\r\n<br />\r\nThe second component of this project is a web platform where the dreams are stored. It is a Dream Archive that has a community and a personal dimension. Half of the site lets you publicly share your dreams, and the other half is a personal archive that privately keeps track of the dreams you do not wish to share.\r\n<br />\r\n<br />\r\nThe public dreams are shown in the installation and throughout the web site. Your private dream archive lets you search by word filters and make creative analysis. I will also be showing the artistic research I am doing in a gallery, working with analog and digital techniques, to create visual representations of the received dreams.","short_description":"<i>Oneiric Lab</i> is an art installation and a web platform to archive dreams and create artistic research about the dream image and its narratives. How is the language of dreams composed? Which brain mechanisms create them? How are they displayed? These questions are explored through the poetics of digital language.","further_reading":"<p><i>“Human does not live in a world of things, lives in a world of symbols. The reification of the symbols is the cause of the discomfort of our days: to remove all oneness from the fabric of symbols. Turn them interchangeable\".</i> Bertallanfy quoted by Raul Ruiz in his Journal</p>\n<p>As a filmmaker and media artist, I've always been interested in the creation of images and the reflection on them. The need to represent through images has been evolving in human History from cave paintings to virtual reality in the digital era—from hieroglyphics, writing, painting, handicrafts, sculpture, engraving, and photography to cinematography, video, multimedia and three-dimensional techniques. Image representation had revolution with the invention of the printing press, which made images reproducible, and another one with the emergence of digital technologies at the end of the 20th century. Digital media and the Internet has reached a historic moment in which practically anyone has access to make and disseminate images through cell phones. Contemporary life is overpopulated with images. In cities, public space is invaded by advertising; Internet and social networks do their part in the intimate space. It is in this context that the dream image has become so interesting for me. Somehow, it has a different quality; it is an inner image, generated inside the body through an unconscious and mysterious process.</p>\n<p>When sleeping, sensory and narrative audiovisual sequences are generated and display inside the brain, through a mechanism no one fully understands. By the activation of different areas, the mind links perceptions, memories, and emotions to create those sequences. Every night, somehow, the dreamer becomes a cinematographer that 'projects' audiovisual sequences internally. What is the relationship of the dreamer with these images? Where do they come from? How are they recalled? How do we represent they to ourselves after the initial internal experience is over? How are they remembered, interpreted, shared? The tension between the 'external' and 'internal' images and how they relate to each other, as well as the language and mechanisms of the dream generation, are still cryptic for human beings, who have been researching them through disciplines such as art, psychology, and neuroscience. </p>\n<p>In 2016, when I was moving from Chile to live in the United States I found a box with old personal journals. Checking them, I realized I had been writing dreams since 1995, which was more than 20 years of an analog dream archive. As I was about to start my studies of digital media at ITP I decided to digitize them and start an artistic research with them through new media technologies. That's how my thesis project began. Digital technologies seemed like a great tool to archive dreams and do a creative analysis of them, as well as to research them through text analysis, graphics, and audiovisual techniques. </p>\n<p>My thesis synthesizes this exploration process. On one side, there is a piece of electronic poetry projected on the walls through a 3D animation. I explored coding with string data and text analysis, using written dreams as the base content. Words are the most common way humans share their dreams with others, by narrating them. This piece represents for me the way we share and put dreams into a story. This creates a big gap between the narrated and the real dreams, which are actually inapprehensible. Dreams are not fully accessible to us; we recall moments, fragments, sometimes feelings or sensations, but never, and maybe fortunately, the whole sequences. </p>\n<p>On the other side, I researched with automated video techniques using the Vidpy Library to create an algorithm that match images through associations, exploring dream syntaxes and traditional editing rules to make small audiovisual sequences that are projected over a round structure. The sequences are slightly connected to the dreams users share through word associations. The videos are tagged with words, and depending on the words of the dream users have entered, random videos will be selected by the program to create the sequence.</p>\n<p>Reading the journal of the Chilean filmmaker Raúl Ruiz I found a quote from Wittgenstein that was very inspiring. “The unconscious does not have private property, it is not appropriable, it is a common fund”. That is how I decided to make an open database of videos. The piece is currently working with a database I made by downloading Instagram videos of people I follow. My next step is to create a function where people will be able to share images through the web platform. This database will always be mutating and exploring the concept of the collective unconscious that the internet also represents.</p>\n<p><i>Oneiric Lab</i> is a portable installation, that can be exhibited in galleries and museums of different countries, collecting new dreams and images on its journey. The web platform is where the database that feeds the installation lives and where the research process is exposed. </p>\n<p>Through the research and creative process of this thesis, the question about the dream image has become more and more present. New questions about the dream’s syntax and content have arisen and will keep arising. Dreams have their own codes and morality and represent the gap that exists between our conscious and unconscious experience. As Jorge Luis Borges states in a conversation with Ernesto Sábato published in 1976, \"Whatever it is, the man who dreams is a great poet and when he wakes up he becomes a poor man again.\" Through this piece, I want to create a bridge to make our conscious and unconscious perceptions speak to each other poetically, as a way to approach dreams through their own language and not the other way around. Believing that we should improve our poetical level of cognition, <i>Oneiric Lab</i> is a space to explore the collective dimension of dreams and how we connect to each other through them.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ThesisThumbnailImage1-2.png","title":"ThesisThumbnailImage1","alt":"Oneiric Lab Art Installation","caption":"Oneiric Lab Art Installation"},"topics":[{"name":"Installation","slug":"installation"},{"name":"Narrative","slug":"narrative"}],"video_presentation_url":"https://player.vimeo.com/video/269195199","video_documentation_url":"https://player.vimeo.com/video/266203934","project_url":"http://www.paulaleonvendagar.com/2018/04/20/oneiric-lab/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ThesisThumbnailImage1-2.png","title":"ThesisThumbnailImage1","alt":"Oneiric Lab Art Installation","caption":"Oneiric Lab Art Installation"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Thesis_BigImages5.png","title":"Thesis_BigImages5","alt":"Oneiric Lab Art Installation","caption":"Oneiric Lab Art Installation"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Thesis_BigImages.png","title":"Thesis_BigImages","alt":"Oneiric Lab Art Installation","caption":"Oneiric Lab Art Installation"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Thesis_BigImages3.png","title":"Thesis_BigImages3","alt":"Oneiric Lab Art Installation","caption":"Oneiric Lab Art Installation"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Thesis_BigImages_archive3.png","title":"Dream Archive web platform","alt":"Dream Archive web platform","caption":"Dream Archive web platform"}]}