{"post_id":634,"student_id":"33","student_name":"Scott Reitherman","student_slug":"scott-reitherman","advisor_id":"123","advisor_name":"Kathleen Sullivan","advisor_slug":"kms829","project_title":"Grand Central Immersion","project_question":"When you put someone in the center of a story they take more of an interest. And while sound is the most inherently immersive of our sensory experiences, overwhelmingly the emerging XR technology focuses on the visual display.\r\n<br />\r\n<br />\r\nBy exploring spatialized audio cues and 3D sound design as tools that are both narrative and which can modify behavior within public space, my Grand Central story leads users through an intimate exploration of the urban monument revealing historic anecdotes culled from the New York Times archive and prompts for imaginative wandering that peel back perceptual layers.\r\n<br />\r\n<br />\r\nIncreasing interest in AR represents an enormous opportunity for wonderful aural experiences, and a chance to evolve current immersive audio standards from static to interactive. Because while the fidelity of a VR headset experience is much higher than current AR hardware allows, it lacks the freedom of wide movement and is detached from physical reality.  This is why implementation of a bluetooth headtracker affixed to the headphones really improves the experience and brings to AR the audio capabilities that were previously only the affordances of a head-mounted display.  As the user rotates their head with six degrees of freedom around Grand Central station, my Unity iOS application renders a naturalistic aural soundfield comprised of base layer ambisonic recordings from the interior and exterior scenes of the station overlaid with monaural assets placed into the virtual geography. \r\n<br />\r\n<br />\r\nThere is a magic trick that already exists: hearing prerecorded ambisonic sound in headphones at the same space in which the audio was originally captured. It is at once naturalistic and surreal, delightfully obscuring the distinction between past and present and challenging our brains to encode/decode the psychoacoustic aural cues that we hear with what our eyes perceive. In this moment of blended reality there is a rich storytelling opportunity that lies at the intersection of podcast-style narrative and guided historical walking tour.  And much of this convincing of our brain relies upon the recently possible reliable rotational head-tracking in wireless headphones so as to support an intimate, cinematic experience.","short_description":"An investigation of immersive acoustic storytelling that engages our current definitions of augmented reality, <i>Grand Central Immersion</i> is a psychogeographic walking guide that explores the relationship between sound and public space via creative interactions with wireless headtracking and 3D audio.","further_reading":"<div><iframe src=\"https://player.vimeo.com/video/266520724\"></iframe></div>\n<p><a href=\"https://vimeo.com/266520724\">Grand Central Immersion: Teaser</a> from <a href=\"https://vimeo.com/user56945697\">Scott Reitherman</a> on <a href=\"https://vimeo.com\">Vimeo</a>.</p>\n<p>We have an inherent fascination with embodying the lives of strangers. Perhaps it’s simply an interesting escape when we imagine seeing through someone else’s eyes, or maybe we have some deep seated need to feel that we are not alone in our experience of what it’s like to be in the world. </p>\n<p>Wherever this part of our human condition comes from, New York City is a great place for wondering about other people, and perhaps no other public space here provides a better setting for this activity of wondering than Grand Central Terminal.</p>\n<p>Here 700,000 tourists and commuters zig-zag past each other every day, yet underneath the vibrancy of the place lie Grand Central stories from the past whose characters have a new chance to embody the present tense via the experience of an exploratory mixed reality tour guide. And wrapped around those historical and personal narratives are site-specific threads, like the technology of transportation and architectural psychoacoustics, elements I've explored in this work through the medium of 3D audio.</p>\n<p>My projects at ITP have often positioned the user as coauthor of interactive soundscapes that are in turns ambient and theatrical, and my thesis work has aspired to transition from those mediums of screen and visual display into the territory of the invisible and naturalistic.</p>\n<p>As my early interactive music pieces grew into projects meant to pair with site specific contexts, my research led me into the areas of acoustic ecology and soundscape as pioneered by R. Murray Schafer.  In making narrative audio for multichannel speaker setups I found an entirely new playground, one in which I could move field recordings and nondiagetic sound designs around a 3-dimensional space in service of a richer and more embodied storytelling experience.</p>\n<p>Furthermore, the design principles outlined in the visionary “The Coming Age of Calm Technology” by John Seeley Brown and Mark Weiser from Xerox PARC in the 90s have continued to resonate with me deeply, and I have attempted to translate into sound via the use of filters their advice for precognitive stimulation and lowered anxiety achieved via designing UI elements that stimulate the periphery of a user’s experience.  It has also informed the arc and user experience of Grand Central Immersion: after the introductory sections that take place in the central hall there are peripheral adventures the user can choose to wander off towards.</p>\n<p>Finally, as I discovered the work of the psychogeographer authors, sound artists and filmmakers, I found the crucial last set of references for <i>Grand Central Immersion</i>. Guy Debord’s ideas of wandering through urban space as a radical act of discovery and interaction were manifested in my epiphanic experience with Janet Cardiff’s “Her Long Black Hair,” an audio walk through Central Park which has remained the principle inspiration of my thesis.  </p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/GCI_thesisArchive1.jpg","title":"GCI_thesisArchive1","alt":"Grand Central Immersion, Scott Reitherman ITP Thesis","caption":"Grand Central Immersion, Scott Reitherman ITP Thesis"},"topics":[{"name":"Sound","slug":"sound"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/video/269195580","video_documentation_url":"","project_url":"http://www.electricsleep.net/grandcentralimmersion","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/GCI_thesisArchive1.jpg","title":"GCI_thesisArchive1","alt":"Grand Central Immersion, Scott Reitherman ITP Thesis","caption":"Grand Central Immersion, Scott Reitherman ITP Thesis"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ScottLookingIntoTrain-1024x573.jpg","title":"","alt":"Windows and Mirrors","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/MarcoLookingUp2-1-1024x576.jpg","title":"","alt":"Looking At and Thru the Roof","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/LindsayLookinDreamy-1024x570.jpg","title":"","alt":"Imaginative Wandering","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/LargestMachine-1024x576.jpg","title":"","alt":"The Largest Machine in the World","caption":""}]}