{"post_id":509,"student_id":"41","student_name":"Daniella Garcia-Rosales","student_slug":"daniella-garcia-rosales","advisor_id":"119","advisor_name":"Gabe Barcia-Colombo","advisor_slug":"gac277","project_title":"Curiosity Algorithm","project_question":"What occurs in the brain of a child when he/she perceives a soap bubble floating in thin air? How can we explain our shared capacity to wonder, have a sense of curiosity and the potential of discovery? \r\n<br>\r\n<br>\r\nFrom infancy, humans have a significant ability to infer the physical structure of the world, our brains intuitively explore possible interpretations of sensory stimuli and extrapolate beyond presented data. As an artist/designer immersed in the world of technology, I constantly wonder how could we benefit from understanding our innate drive for curiosity? Can we develop the tools needed to enhance our shared capacity to discover? \r\n<br>\r\n<br>\r\nToday we teach machines to “perceive” and learn based on algorithms that have little to do with the full complexity of human experience. However, it is believed that these technologies present an opportunity to understand the human brain and its underlying mechanisms. Many vital questions remain, particularly in our comprehension of human innateness. Curiosity or an intrinsic desire to learn and an engine for discovery seems essential to human experience, yet such spontaneous behavior remains an uncertain territory. \r\n<br>\r\n<br>\r\nI would like to approach this challenge from a speculative angle, informed by a thorough research on the pertinent fields. Designing and conducting a series of experiments, not intended to provide immediate answers to my initial hypothesis but as a new empirical methodology to question the logic behind our own data. This project might enable a more accessible and malleable understanding of the technologies that currently attempt to explore and determine our cognitive potential.\r\n<br>\r\n<br>\r\nTechnology has allowed us to make visible, what without us, might never have been seen. Can we design a curiosity algorithm that might lead us to our own discoveries? Can we redefine our own limitations? \r\n<br>\r\n<br>\r\nAn algorithm as a metaphor \r\nA metaphor as a tool\r\n <br>\r\n<br>\r\nThis project will entail a research approach and an experiential component, with an accompanying manual for empirical experiment design. Please find more information here: \r\n<br>\r\n<br>\r\nhttp://curiosity-algorithm.com/\r\n<br>\r\n<br>\r\n<i>“When you admire something you become larger than yourself. When you\r\nwitness beauty, you begin to have hope again.” Louise Bourgeois</i>","short_description":"How do we learn to formulate the right questions that lead us to our own discoveries? ","further_reading":"","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/uno.png","title":"uno","alt":"curiosity","caption":"a curiosity algorithm"},"topics":[{"name":"Education","slug":"education"},{"name":"Machine Learning","slug":"machine-learning"}],"video_presentation_url":"https://player.vimeo.com/video/270188170","video_documentation_url":"https://player.vimeo.com/video/265854188","project_url":"http://curiosity-algorithm.com","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/uno.png","title":"uno","alt":"curiosity","caption":"a curiosity algorithm"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/turingbubble.gif","title":"turingbubble","alt":"turingbubble","caption":"turing bubble"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/bubbles4.jpg","title":"what is air?","alt":"what is air?","caption":"what _ is air?"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/1b.jpg","title":"bubble microscopes","alt":"bubblemicroscopes","caption":"bubblemicroscopes"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/solbraille.png","title":"solbraille","alt":"light-braille","caption":"l"}]}