{"post_id":166,"student_id":"42","student_name":"David Temchulla","student_slug":"david-temchulla","advisor_id":"119","advisor_name":"Gabe Barcia-Colombo","advisor_slug":"gac277","project_title":"Beast of Burden","project_question":"For thesis I wanted to further my practice of developing interactive, data-driven sculptures that investigate the spaces between the art object and lived experience. \r\n<br />\r\n<br />\r\nMore specifically, I wanted to create works that take the promise of technology and incorporate the surrounding natural environment. In doing so, I aimed to deepen and extend methods I have used in previous work (e.g., Cosmic Breath, where data taken from a wind sensor that measures the power of an individual’s breath is used to activate motors that tug at stalks of wheat, simulating a powerful gust of wind blowing through a field) to develop a new body of work that focuses no longer on the individual, but on the collective.\r\n<br />\r\n<br />\r\nThese new works will manifest as a new form of social sculpture - one that perpetuates meaningful collective interactions between humans and the material world. Ultimately, I aim to create works that require an aggregation of small individual actions to demonstrate and explicate how the actions of many can create something monumental.","short_description":"An interactive sculpture that promotes collective action and collaboration amongst individuals. Through an aggregation of small individual gestures, the unified voice of three individuals becomes a monumental natural event- a thunderstorm. Inspired and based on the ideas of Joseph Beuys's Social Sculptures, I call it this work Collective Sculpture.","further_reading":"<p>For my first collective sculpture I wanted to create a work that can only fully be realized when a group of people come together and unify in one action. This action will be the sound of their voices. The sculpture is centered around three sound booths, about the size and scale of a phone booth. Each booth is sound proof providing privacy for the individual to freely expressing themselves inside. In the center of the three booths is a large thin sheet of metal. As the collective voices of the three individual participants get louder- the metal sheets on the outside will begin to shake, creating the sound of thunder (this is the technique used by Foley artist in films and plays). Inside the booths, LED lights provide indication for the volume of the individual’s voice, as well their counterpart’s volume levels in the other two booths. The louder the volume inside each individual booth, the brighter and more rapid the LED’s become, simulating a lightning storm.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Thumb-3.png","title":"Beast of Burden","alt":"Social Sculpture","caption":"Interactive Collective Sculpture"},"topics":[{"name":"Installation","slug":"installation"},{"name":"Sound","slug":"sound"}],"video_presentation_url":"https://player.vimeo.com/video/270188916","video_documentation_url":"https://vimeo.com/267311195","project_url":"http://www.davidtemchulla.com/beast-of-burden","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Thumb-3.png","title":"Beast of Burden","alt":"Social Sculpture","caption":"Interactive Collective Sculpture"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/960-1.png","title":"Beast of Burden","alt":"Interactive Sculpture","caption":"Social Sculpture  sfsafsafasasfda"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/540-2.png","title":"Beast of Burden","alt":"Interactive Sculpture","caption":"Social Sculpture/ collective interaction"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/960x540-3.png","title":"Beast of Burden","alt":"Social Sculpture","caption":"Sound Installation"}]}