{"post_id":87,"student_id":"43","student_name":"Hayeon Hwang","student_slug":"hayeon-hwang","advisor_id":"119","advisor_name":"Gabe Barcia-Colombo","advisor_slug":"gac277","project_title":"Expressive Tactile Controls","project_question":"Push buttons, sliders, switches and dials—we use such controls everyday, and yet we barely notice them. ‘Expressive Tactile Controls’ is a series of playful research experiments that ask: how could our relationship to tactile controls be augmented by giving these controls more personality? How would buttons that have a stronger, more evocative personality affect and improve our relationship with the applications they are built into? How would people react to buttons that ‘talk back?’\r\n<br />\r\n<br />\r\nThis question was approached by constructing and testing a series of experimental pushbutton prototypes able to express themselves with various tactile and kinesthetic feedback (vibration, tension, and movement), according to the user’s touch or environment. \r\n<br />\r\n<br />\r\nThe first series included controls designed to feel Stubborn, Sensitive/Impatient, Lazy, Timid, and Spontaneous. These ‘personality-enriched’ buttons were then used to provide users with a more intuitive tactile feedback, in accordance with the application they were serving.","short_description":"What if physical controls such as buttons, dials, and sliders had more expressive personalities? How could this inform and deepen our interaction with them? <i>Expressive Tactile Controls</i> is a series of reactive tactile controls designed to interact with their user in a variety of ways. This is a playful investigation into pushing the limits of our controls. \r\n","further_reading":"<p><b>Prototypes</b></p>\n<p><i>a. Stubborn</i></p>\n<p>This button was designed to offer resistance to being pressed, by demanding a variable actuation force from the user. The tension-resistance is adjustable by input values. It was built using a slotted link mechanism (also known as Scotch yoke) using a servo motor that generates tension from an attached spring. </p>\n<p><i>b. Impatient/Sensitive</i></p>\n<p>A highly sensitive button that actuates rapidly with only a small amount of force. It is made with a motorized slide potentiometer with a specially designed long knob. </p>\n<p><i>c. Lazy</i></p>\n<p>Operates slowly to reach peak value and restore the default state. A force sensitive resistor (FSR) sensor detects a trigger point, and it is moved by a linear actuator.</p>\n<p><i>d.Timid</i></p>\n<p>Actuates ahead of a user’s action. The top of the cap has a proximity sensor (or capacitive sensor) which detects the location of a fingertip. The button quickly hides from any approaching touch, using a solenoid.</p>\n<p><i>e. Spontaneous/free-spirited</i></p>\n<p>The button cap pops up when it is pressed. A solenoid triggers the movement.</p>\n<p><b>Graphic User Interface</b></p>\n<p>A control board web application was used to observe constant input and output values of haptic information and conveniently assign each individual tactile effect. Then, testing was carried out by utilizing these output values to control various electronic objects. The application was written using JS/HTML/CSS, and via duplex serial communication using Arduino and the P5.serialport library.  </p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thum1.gif","title":"thum1","alt":"thum","caption":""},"topics":[{"name":"Tangiable","slug":"tangiable"},{"name":"UX\\UI","slug":"uxui"}],"video_presentation_url":"https://player.vimeo.com/video/270189074","video_documentation_url":"https://player.vimeo.com/video/269559159","project_url":"https://hhayeon.com/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thum1.gif","title":"thum1","alt":"thum","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/tension.jpg","title":"Expressive Tactile Controls","alt":"Expressive Tactile Controls","caption":"Expressive Tactile Controls"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/control_2.gif","title":"Expressive Tactile Controls","alt":"Expressive Tactile Controls","caption":"Expressive Tactile Controls"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/timid.jpg","title":"Expressive Tactile Controls","alt":"Expressive Tactile Controls","caption":"Expressive Tactile Controls"}]}