{"post_id":148,"student_id":"46","student_name":"Lindsey Piscitell","student_slug":"lindsey-piscitell","advisor_id":"119","advisor_name":"Gabe Barcia-Colombo","advisor_slug":"gac277","project_title":"Pack Your Things and Go","project_question":"Gaston Bachelard says that “We cover the universe with drawings we have lived.” But where do we leave these drawings? How are they contained? How do we unlock them and what do they mean to us when we finally see or hear them again? \r\n<br />\r\n<br />\r\nSimilarly, when we leave a place that might contain memories, do we leave part of our identity behind? And how do emotions facilitate the recursion of such memories—especially when distanced from their context? I have always been curious to see how much of our identity is rooted in place and our ability to recollect. In order to explore this linkage, I have examined cognitive perception, emotional mapping, and the psychological impact of sound frequencies in order to inform eight sound sculptures I have crafted for this installation. \r\n<br />\r\n<br />\r\nEach sculpture is a 60-second abstract narrative expression of one of eight emotions—ecstacy, vigilance, rage, loathing, grief, amazement and terror—that starts frivolously but through time amplifies. It’s buttressed by a “behavioral frequency” and sounds that have been identified in a survey to elicit its designated emotion, as well as by my own artistic interpretation. Ultimately, each sculpture is in an expression of the emotion in what I have interpreted to be its purest form.\r\n<br />\r\n<br />\r\nI have using the action of packing as a framing mechanism for the user to interact with my installation. When the user enters, they are entering a space that is in the process of being “packed up”. Through a series of visual cues they are prompted to pick up any of eight objects placed throughout the space. When each object is picked up, a sound sculpture is unleashed. When the object is put back down, it is silenced. The user is given their own “packing box” and is asked to choose up to four sound sculptures to “bring with them” when they go. Asking the user to choose their objects is an exercise in asking one to choose one’s memories. The unique combination of the overlaid sounds in the packing box is an amalgam of memory and ultimately an acknowledgement of the individual's unique identity. ","short_description":"<i>Pack Your Things and Go</i> is a single person immersive sound interaction that prompts the user to explore and answer questions surrounding identity, memory and time.","further_reading":"<p>Further Reading: Sound Sculptures &amp; Mapping The Narrative</p>\n<p><b>Plutchik’s Wheel</b></p>\n<p>Robert Plutchik’s Wheel of Emotion maps the human experience into eight core emotions. At our most animalistic, all human experience can be reduced to being rooted in terror, amazement, grief, loathing, rage, vigilance, ecstacy and admiration. Typically, we do not reside in such base spaces, but rather in the “primary bipolar emotions” (named bipolar because opposite emotions are placed opposite each other on the wheel) that reside immediately outside the core wheel. Those emotions -fear, surprise, sadness, disgust, anger, anticipation, joy and trust- are much more familiar and can typically be used to identify our day-to-day feelings. We can also combine adjacent emotions on the primary bipolar layer of the wheel to get additional emotions. For example, joy and trust can combine to form the emotion of love. Even further outside the wheel are what might be described as superficial versions of the primary emotions: apprehension, distraction, pensiveness, boredom, annoyance, interest, serenity and trust.  </p>\n<p>As our emotions intensify over time, we travel from the exterior to the interior of each of the spokes on Plutchik’s wheel. Plutchik was motivated to map emotion in order to create a tool that could enhance emotional literacy for its users. </p>\n<p><b>“Behavioral Frequencies”</b></p>\n<p>Research has also been conducted that points to pure tone frequencies having emotional effects on test subjects subliminally. For instance, 11.3 HZ, the so-called ‘rage’ frequency, has been cited in scientific journals as having adverse effects on its subjects given long-term exposure. Similar reports have (allegedly) been conducted on behalf of government agencies as practicing methods of alleged ‘mind control’. This is not new. Ancient cultures have a history of mapping tones an purporting they’re elemental to achieving different states of being. The Solfeggio frequencies, a scale of six tones originally identified in the 10th century, are thought to have effects as wide-ranging as bone healing and achieving self-actualization. Though inconclusive, testing exposure to Solfeggio as well as other frequencies has lead to their inclusion in the sound sculptures I have crafted. </p>\n<p><b>Survey</b></p>\n<p>In addition to researching emotion, I conducted a survey amongst a diverse set of my peers to better understand recollection and emotion in their personal experiences. I received responses from almost 50 people, each of whom answered a series of questions including “What is a memory that, whenever you hear it reminds me of your childhood” and “What is a pleasant/unpleasant sound? What are the emotions that you affiliate with that sound” to see if there were any specific patterns of recursion. I then used the findings in aggregate to inform and fortify my sound sculptures.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/8W0B7922-1-1024x768.jpg","title":"8W0B7922-1","alt":"Brass lantern and mosaic box in larger box surrounded by dried flowers.","caption":"Thumbnail"},"topics":[{"name":"Installation","slug":"installation"},{"name":"Sound","slug":"sound"}],"video_presentation_url":"https://player.vimeo.com/video/270401987","video_documentation_url":"https://player.vimeo.com/video/266250391","project_url":"https://www.ljpiscitell.com/packyourthingsandgo","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/8W0B7922-1-1024x768.jpg","title":"8W0B7922-1","alt":"Brass lantern and mosaic box in larger box surrounded by dried flowers.","caption":"Thumbnail"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/8W0B7965-1-1024x576.jpg","title":"8W0B7965-1","alt":"Lifting a sound sculpture out of its box.","caption":"Users choose individual soundscapes to comprise their own unique sound sculpture."},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/8W0B7840-1024x576.jpg","title":"Image 2","alt":"Box filled with brass lantern and mosaic box surrounded by packing supplies.","caption":"Using the act of packing as a framing mechanism, the user is asked to choose the memories they cherish most."},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/8W0B7834-1024x576.jpg","title":"Slide Show Image 3","alt":"Still shot of packing box containing sound sculpture objects.","caption":"Abstract sound sculptures mapped to emotional frequencies serve to trigger unique memories in the mind's eye of the user."},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/8W0B7865-1024x576.jpg","title":"8W0B7865","alt":"Sound sculptures upright in box.","caption":"Reliving those triggered memories is familiar, but experiencing them in a new way serves to give the user a sense of time regained."}]}