{"post_id":113,"student_id":"5","student_name":"Chloe Gao","student_slug":"chloe-gao","advisor_id":"114","advisor_name":"Adaora Udoji","advisor_slug":"aeu4","project_title":"Ephemeral","project_question":"During my first summer in New York, many of my friends visited me and slept in my living room. Since my apartment is close to the Hudson River Park, I always took them to the park for a walk in the evenings. They shared with me their stories of the city: hopes, dreams; sweet and broken hearts. I have lived in the city for three years now, but not as many friends visited me since that summer. Sometimes they came, but they no longer slept in my living room. This project is for the ephemeral summer nights that will never happen again.\r\n<br />\r\n<br />\r\nInspired by site-specific kinetic sculpture, my thesis project Ephemeral explores the potential forms of kinetic sculptures, specifically in my thesis human forms in augmented reality. I chose a wireframe material because its transparent texture delivers the feeling of memory: it looked like a shadow in the day, and glowing particles at nights. \r\n<br />\r\n<br />\r\nUsers who download the app can see and explore the AR experience I created at the Hudson River Park west of Manhattan. Users have to go to the exact area in order for the virtual sculptures to show up. As the camera moves away, the sculpture vanishes.  The app Ephemeral is essentially an AR magazine of the city, and it will help you understand the city in a  unique, emotional and romantic way. \r\n<br />\r\n<br />\r\nThe app is written in Swift and ARkit, and uses Google Geo-Location API.","short_description":"<i>Ephemeral</i> consists of three site-specific AR installations. Each characterizes one emotion: lost and exploration, excitement, and desperation. It explores the technique of objectifying emotions into AR scenes at specific locations. Users see through a mobile app to watch these stories and experience the emotions.","further_reading":"","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Thumbnail-2.jpg","title":"Thumbnail","alt":"Thumbnail","caption":""},"topics":[{"name":"Installation","slug":"installation"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/video/270187894","video_documentation_url":"https://player.vimeo.com/video/265817161","project_url":"http://itp.cgao.me/p/select/ephemeral.html","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Thumbnail-2.jpg","title":"Thumbnail","alt":"Thumbnail","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/1.1.gif","title":"test at the riverside","alt":"test at the riverside","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/2.gif","title":"screen recording","alt":"riverside screen recording","caption":"riverside screen recording"}]}