{"post_id":469,"student_id":"54","student_name":"Woraya Boonyapanachoti","student_slug":"woraya-boonyapanachoti","advisor_id":"119","advisor_name":"Gabe Barcia-Colombo","advisor_slug":"gac277","project_title":"(Dis)connect","project_question":"Today's communication environment is heavily reliant on smartphones. These devices provide otherwise impossible forms of communication, but the consequence of its usage is not always real closeness. When you went to a restaurant a few years ago, you would normally see people talking to one another – having direct, face-to-face interaction. Nowadays, it is common to see a family sitting a table in silence, eyes staring at screens, while they have conversations with people not present in the room itself.\r\n<br />\r\n<br />\r\n<i>(Dis)connect</i> provides a designed virtual playground in which two players can uncover these hidden repercussions and reflect on their relationship with each other and with their phones.The experience is meant for the HTC Vive platform but it excludes the native Vive controllers, substituting them with smartphones. Using Unreal Engine and Socket.IO, the player's tap and scroll gestures are registered and used to impact their digital environment. This way, it is through their instinctive actions on a touch-screen interface that users progress through the experience.","short_description":"<i>(Dis)connect</i> is a speculative multiplayer virtual reality experience that explores how we connect with ourselves and with each other through our smartphones.","further_reading":"<p>Each of the players goes through a series of events that reflect on a different aspect of our obsession with our phones, each focusing on a specific impact of social media in our lives. Player 1 environment is progressively built on top of our dependence on being heard. On the need to be seen. On the edit and curated version, we create of ourselves, where we always look happy, clever, and interesting.</p>\n<p>Meanwhile, Player 2 faces the gamification of social media—the likes, the comments, the hearts, the claps, the friends, the followers. By tapping and scrolling, they have the power to increase their numbers and therefore be more admired, adored, envied. The moment they stop interacting with the phone, the numbers start going down and they have the choice to accept the zero or keep pushing for higher digits.</p>\n<p>The two players face each other in the physical world when starting the experience, but they can only see each other in the digital environment when and if they let go of using the phone. The players should walk away reflecting on how our ordinary use of technology has the apparent power of bridging spaces and yet, also builds walls between people who are right in front of us.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Thumbnail_2.jpg","title":"(Dis)connect","alt":"(Dis)connect","caption":""},"topics":[{"name":"Play","slug":"play"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/video/270191700","video_documentation_url":"","project_url":"https://woraya.me/disconnect","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Thumbnail_2.jpg","title":"(Dis)connect","alt":"(Dis)connect","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Slideshow_1.jpg","title":"(Dis)connect_1","alt":"(Dis)connect_1","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Slideshow_2.jpg","title":"(Dis)connect_2","alt":"(Dis)conect_2","caption":"(Dis)connect_2"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Slideshow_3.jpg","title":"(Dis)connect_3","alt":"(Dis)connect_3","caption":"(Dis)connect_3"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Slideshow_4.jpg","title":"(Dis)connect_4","alt":"(Dis)connect_4","caption":""}]}