{"post_id":512,"student_id":"55","student_name":"Wenqi Li","student_slug":"wenqi-li","advisor_id":"119","advisor_name":"Gabe Barcia-Colombo","advisor_slug":"gac277","project_title":"Metron Busker","project_question":"<i>\"It was in the streets that the demonstrations took place. It was in the streets that spontaneity expressed itself.\" — Harriet Hawkins</i>\r\n<br />\r\n<br />\r\nThe public arena of the street is where performers can insert new, dynamic, stirring, living experiences into a highly commercialized context. It is where moments of sociality and conviviality are created in everyday life.\r\n<br />\r\n<br />\r\nIn contrast to the absence of authorship that often defines graffiti or public art installations, street performance—especially busking—puts the spotlight directly on the author. A busker’s performance is shaped by their mood, their stories and their connection to the site of performance. Busking is a robust form of self-expression. \r\n<br />\r\n<br />\r\nStemming from my interest in this potential for self-expression and in acts of intervention to the public space, my thesis <i>Metron Busker</i> is an exploration of my creative approach toward busking. I use it to reposition myself as a busker delivering a performance as an escape from the burden of conflicting emotions.\r\n<br />\r\n<br />\r\nThe toolkit backpack equips me with a web application and networked electronics. The web application takes input parameters for algorithmic remixing, and the networked electronics boost the musical expression through street-ready speakers and screens. Together they broadcast the generative audio and video, live streaming straight to the audiences' smartphones.\r\n<br />\r\n<br />\r\nThe metal, black-framed backpack with its array of functional electronics serves as a metaphor of burden, connecting the stress of living in a tech-driven age with the physical feeling of carrying a heavy load. This toolkit can be used for all kinds of audio-visual performance seeking to utilize such a concrete expression of burden. It is the conflicting eagerness and fear, expectation and forbiddance from where my burden of anxiety arises. \r\n<br />\r\n<br />\r\nTo expose eagerness and fear to the public and harness them for listening pleasure is the busking way to overcome these feelings. The audiences will be subjected to an arc of intensity, experiencing the vulnerable, the overwhelming and the vital.","short_description":"<i>Metron Busker</i> is my strategy for intervening in the urban space as a street performer, using a networked toolkit. <i>Metron Busker</i> is a performance enabled by tools, and it is also the toolkit that enables the performance.","further_reading":"<p>As a valuable part of urban culture, buskers are capable of evoking civil dialogue in a highly political space, by the captivating attention in an entertaining format. Personally, <i>Metron Busker</i> empowers me to step into busking and exposition cross-cultural and countercultural themes. It lets me provide the appreciation of self-expression and in turn an appreciation of diversity.</p>\n<p>While in the public imagination, busking involves nothing more than an acoustic instrument, professional buskers do employ a range of electronic equipment in their performances—microphones, amplifiers, drum kits or mixers. Only rarely do more sophisticated equipment such as laptops, synthesizers and customized instruments get employed to perform electronic music. These are the tools that I know how to use, and my design is a way to integrate my knowledge into the field of public performance.</p>\n<p>My interviews with buskers show that some of them are musicians and have regular gigs and scheduled tours—they seek organic audiences. The balance of passion and work plays a significant role in their busking career. Others rely on busking as a main source of income, and one I have spoken to was even able to pay for recording studios and travel.</p>\n<p>But regardless of the busker’s approach to their performance, in our contemporary attention-driven landscape it is getting harder to find an audience. As we move deeper into an era of digital cash, streaming music and the solitary experience of headphones and smartphones, it’s becoming increasingly difficult to capture an audience with traditional forms of busking. Metron Busker seeks to respond to this challenge.</p>\n<p><b>Live stream delivery with video</b></p>\n<p>The performative content of <i>Metron Busker</i> is live streamed through the local area network to the smartphones of audiences. It adds a visual layer and interaction to the busking, and explores a way of working within the currently dominant framework of solitary experience.</p>\n<p>Audiences who connect to this free wifi will receive a pop-up window streaming video mashup. It gives <i>Metron Busker</i> the access to promote himself—Descriptions, links to social platforms and digital donation methods are attached.</p>\n<p><b>The Algorithmic Composition</b></p>\n<p><i>Metron Busker</i> brings algorithms to the street. It was programmed to sample and remix audio and video using the metronome, Markov chain and a minimalism composition inspired by Steve Reich. Thus it echoes and responds to the traditions of appropriation and improvisation so prevalent in busking.</p>\n<p><b>The Modular Electronics</b></p>\n<p>The modular design allows <i>Metron Busker</i> to unpack modules or rearrange them for visual expression. All modules are powered by rechargeable batteries.</p>\n<p><i>Algorithm Module: A MacBook running server to process assets<br />\nRouter Module: A portable wireless router routing wifi signal<br />\nScreen Modules/LED Modules: Raspberry Pi clients broadcasting visual content<br />\nController Modules: MIDI controller</i></p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/final-banner.png","title":"metron busker","alt":"a man wears a high tech backpack","caption":""},"topics":[{"name":"Performance","slug":"performance"},{"name":"Tool\\Service","slug":"toolservice"}],"video_presentation_url":"https://player.vimeo.com/video/270207215","video_documentation_url":"","project_url":"https://www.wenqi.li","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/final-banner.png","title":"metron busker","alt":"a man wears a high tech backpack","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Metron-Busker-1.jpg","title":"Metron-Busker-1","alt":"A man wear a backpack","caption":"The look of Metron Busker"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/metron-busker-2-2-new.jpg","title":"metron-busker-2-2-new","alt":"Performing at Union Square Park","caption":"Performing at Union Square Park"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/metron-busker-3-2-new.jpg","title":"metron-busker-3-2-new","alt":"performing at Washington Square","caption":"performing at Washington Square"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/screen-details.jpg","title":"screen details","alt":"screens details of Metron Busker","caption":"screens details of Metron Busker"}]}