{"post_id":519,"student_id":"57","student_name":"Yutong Zhang","student_slug":"yutong-zhang","advisor_id":"119","advisor_name":"Gabe Barcia-Colombo","advisor_slug":"gac277","project_title":"Self Pool","project_question":"<i>Self Pool</i> is an interactive collection of sculptures that invites the audiences to make a choice from two fishes in the same pool under the confusion of identifying the real ego.\r\n<br />\r\n<br />\r\nIn this surviving game, a fishing rod is standing in the middle of the two fish sculptures and each fish only owns part of the self. One is speaking with the absence of a face, asking viewers to come in help and not look at the other side, while a face shown on a screen is embedded in another’s head, silently moving its mouth. The power is open to the audiences. They need to reflect on which side them believe more in representing ego, the face or the voice.  \r\n<br />\r\n<br />\r\nIn order to save one side, audiences have to put their head into the fish head and lend a part of their own body. For the face-side, audiences need to accurately read the English scripts on the hidden screen in fish head and be judged by speech recognition. For the voice-side, audiences’ faces are asked to be put at the right position and fill the hole. Fishes get power based on how fast people finish the line or how long they keep their face still. This power is shown by the spinning fishing rod which will fish the less powerful side.\r\n<br />\r\n<br />\r\n<i>Self Pool</i> explores the complexity of self and the eternal confusion of it with misexpression and misunderstanding, where languages, faces, tones are just different mediums. Here self is demonstrated as a pool and moreover as a container of both the mobile “others” and the immobile anima. Shown as two fishes, different personae contained in one self are completed by the presence of “others.” At the same time, audiences become performers and a part of a collective body alongside  the fish sculptures.","short_description":"Which one is the real self? Body? Voice? Face? Or others’ judgements? How can audience’s body be used as a readymade material for the art piece and perform the role of “others”?","further_reading":"<p>The self is distinguishable from \"others.\" However, while people may create their self-image from the individual sees themselves, their self-image may also result from how others see the individual and how the individual perceives others see them or not. These three types may or may not be an accurate representation of the person. All, some or none of them may be true. </p>\n<p>So what could be the real representation of a person? Who is the person—myself?</p>\n<p>To explore the confusion of the real self, the project got inspired by the Chinese traditional performance <i>Shuang-huang</i>, which is a two-man act, with one speaking or singing while hiding behind the other who does the acting. During the performance, two performers consist one collective body and take use of the confusion of which one is the real or more dominant self. </p>\n<p><img src=\"http://p1.pstatp.com/large/31fa0003fe96f33f54e4\" /></p>\n<p>In <i>Self Pool</i>, face and voice are separated into two fishes body. The self-image showing how the individual sees themselves is represented as the fish sculptures. Audiences’ bodies are taken as a readymade material to complete the collective body and therefore audiences become a part of the sculpture and conceptually a part of the self when standing inside the fish body and reading or sharing face for the fish.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail2.jpg","title":"thumbnail2","alt":"Self_pool_thumbnail","caption":""},"topics":[{"name":"Identity","slug":"identity"},{"name":"Installation","slug":"installation"}],"video_presentation_url":"https://player.vimeo.com/video/270208139","video_documentation_url":"https://player.vimeo.com/video/265502627","project_url":"http://carlieyutongzhang.com/home/index/projects/cname/self_pool","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail2.jpg","title":"thumbnail2","alt":"Self_pool_thumbnail","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/AddImg1.jpg","title":"AddImg1","alt":"self pool scene","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/scripts.gif","title":"scripts","alt":"Scripts for audiences","caption":""}]}