{"post_id":88,"student_id":"58","student_name":"Alejandro Matamala","student_slug":"alejandro-matamala","advisor_id":"124","advisor_name":"Kathleen Wilson","advisor_slug":"ksw222","project_title":"Archetype","project_question":"Many creative professionals - from visual artists to musicians, writers to digital media artists -all face a similar problem. Most of the information about their artwork and projects lives within a few concentrated online publishing platforms and social networks, and these companies typically control access to the information and how it is presented. For artists of all kinds, this turns out to be a huge threat; not only in terms of the openness of the web and the artist’s ability to maintain control over their intellectual property but also as an impediment to creative expression and sustainable ways to archive and distribute artwork digitally. \r\n\r\nArchetype aims to address the centralization and standardization of creative expression of how works of arts often inhabit the web. An alternative, independent and experimental set of desktop publishing tools that enable artists to share their artwork online without having to depend on centralized publishing platforms or cloud computing services. \r\n\r\nThe project runs on a distributed peer-to-peer network using the DAT Protocol (https://datproject.org), which adds important characteristics to the publishing practice. It enables the publishing of content from any device connected to the network, including an artist’s individual personal computer. \r\n\r\nUnlike centralized models, where company-owned servers assume the right of publishing, a peer-to-peer protocol enables any computer, even an artist’s personal computer, the right to serve content,  allowing affordable and accessible alternatives to the display of information online. In addition, DAT, allows users to distribute data through an archive system, enabling features like going back and revert previous versions. Distributed archive systems follow a bottom-up model which makes interconnected data solutions possible. Artists’ collections of work can be integrated together allowing anyone interested to contribute and participate.","short_description":"<i>Archetype.cc</i> is a response to my thesis question: How can a peer-to-peer network offer new and beneficial ways for artists to display and share their work on the web? \r\n\r\nThe goal of the project is to design and prototype accessible, open source tools focused on the publishing of artistic material in a p2p network.","further_reading":"<p>During the initial phase of the Archetype project, I designed and coded three tools:  Archetype_01: CREATE, Archetype_02: FOLLOW AND SEED and Archetye_03: Archive. Archetype _01 lets users structure the information they would like to upload about their artwork to the network. Basically, it is a desktop application that allows artists to create and design an archive of artwork on their own computers. This tool allows the users – the artists – to create or turn any folder on their personal desktops into microsites. In this way, it provides artists with an alternative way to design the presentation of selected works online, in much the same way they might design a book of their artwork in print. The application also allows users to fork any website from the DAT network, embracing the idea of openness and collaboration.  </p>\n<p>Archetype_02 is also a desktop application. Unlike Archetype_01, it does not focus solely on the artists. In this case the application provides a tool for artists to reach out to interested participants like fans, followers or collectors and keep them up to date. Archetype_02 works by creating a personal list of an artist’s archives, which can also be downloaded to contribute as a seeder, a peer contributing to the distribution of the archive. The application runs a process task that checks for any new updates on the archive, allowing the ‘followers’ to know when new information from a particular artist is available. </p>\n<p>Archetype_03 is focused on the creation of personal collections. In this case, this application aims to be used by institutions or enthusiasts who want to create, back up and seed a curated selection of archives.  </p>\n<p>For the future, I plan to concentrate my research in a way that supports the prototyping and creation of products that address the specific interests and needs of each of the different types of participants involved. For example, a tool for museums and libraries to categorize their archives by specific topics. Also, an application for fans and collectors interested to save their collections and seed them to the larger peer-to-peer community. I also plan to explore a high-level application that can introduce digital publication and archiving alternatives to non-tech artists. </p>\n<p>Success within the peer-to-peer model requires the participation of a community, which I hope to critically engage in service of the preservation of culture and information. And in order to build solutions that work across platforms, it is important that future applications meet the needs of the whole community. In summary, as a continuation of this project, I expect to develop a series of interconnected tools to share resources and empower free and creative expression.</p>\n<p>Some examples can be found here:<br />\ndat://leon.archetype.cc // dat://ef8c563502c10af7fc6ff6a0f3d85a7a7e862939213abb1e2e618c9f61aae78b<br />\ndat://pixels.archetype.cc // dat://809f897059367559744a31ccfc0af8c1df5634553180753d76fbc1e10c06f767<br />\ndat://ceramics.archetype.cc // dat://2b46936d6b004ef39a782d965a7fb4c68469226bbedfc137b9e71d3c3e6c8027/<br />\ndat://gallery.archetype.cc</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/arche.jpg","title":"archetype","alt":"archetype","caption":""},"topics":[{"name":"Culture","slug":"culture"},{"name":"Tool\\Service","slug":"toolservice"}],"video_presentation_url":"https://player.vimeo.com/video/269232342","video_documentation_url":"","project_url":"https://archetype.cc","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/arche.jpg","title":"archetype","alt":"archetype","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/img1-1.jpg","title":"img1","alt":"Archetype","caption":"Archetype"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/img2.jpg","title":"img2","alt":"Archetype","caption":"Archetype"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/img3.jpg","title":"img3","alt":"Archetype","caption":"Archetype"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/img4.jpg","title":"img4","alt":"Archetype","caption":"Archetype"}]}