{"post_id":167,"student_id":"59","student_name":"Cristobal Valenzuela","student_slug":"cristobal-valenzuela","advisor_id":"124","advisor_name":"Kathleen Wilson","advisor_slug":"ksw222","project_title":"Runway","project_question":"As both an artist and newcomer to the field of machine learning, I am fascinated by what the technology can achieve yet somewhat overwhelmed by its complexity\r\n<br />\r\n<br />\r\nBut while commercial and political applications — such as speech detection and image recognition, can be found everywhere- experimentation with machine learning remains, for the most part, confined to computer scientists and engineers. For an outsider, with no previous computer science experience, trying to understand and use modern machine learning techniques to explore its creative potential can be overwhelming and deeply frustrating.\r\n<br />\r\n<br />\r\nMy ITP thesis project, Runway, is an invitation to explore some of these ideas. If models are the building blocks of machine learning, how can we create more accessible tools to access them? If we could have modern zinc paint tubes for digital artists, what would they look like?\r\n<br />\r\n<br />\r\nRunway’s main goal is to make the process of running and using a state of the art machine learning model as easy as possible. This project is not about creating the right training environment to deploy It is not about training an algorithm and it’s not about hyper-parameters or hard code data science. It is a project built around the simple idea of making models accessible.\r\n<br />\r\n<br />\r\nIn Runway, inputs are ways of triggering a pre-trained model to perform a certain operation. A model runs over the inputs and then outputs results. You can use these results in any way you want. Models are open-source and you can pick from a collection of trained models. Runway provides a library of models you can use any way you want.  Runway allows users to connect the inputs or outputs of those models to other software.","short_description":"<i>Runway</i> is an invitation to artists, designers, educators and anyone interested, to learn and explore machine learning through accessible tools. Machine learning is a complex field that will likely continue to impact our society for years to come and we need more ways of giving more people access to this technology.","further_reading":"<p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/7mCAKceSPIM?rel=0\"></iframe></p>\n<p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/V970mareICM?rel=0\"></iframe></p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail.jpg","title":"thumbnail","alt":"runway","caption":""},"topics":[{"name":"Machine Learning","slug":"machine-learning"},{"name":"Tool\\Service","slug":"toolservice"}],"video_presentation_url":"https://player.vimeo.com/video/269232475","video_documentation_url":"https://www.youtube.com/embed/Icb51twcNAo","project_url":"https://runwayml.com/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail.jpg","title":"thumbnail","alt":"runway","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/carousel_01.jpg","title":"carousel_01","alt":"runway demo","caption":"runway demo"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/carousel_02.jpg","title":"carousel_02","alt":"runway proccessing","caption":"runway proccessing"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/carousel_03.jpg","title":"carousel_03","alt":"runway model","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/carousel_04.jpg","title":"carousel_04","alt":"runway","caption":""}]}