{"post_id":644,"student_id":"60","student_name":"Diego Cruz Castillo","student_slug":"diego-cruz-castillo","advisor_id":"124","advisor_name":"Kathleen Wilson","advisor_slug":"ksw222","project_title":"The Future of Comics","project_question":"Comics are a unique way to tell stories and it's being part of our culture since the beginning of modern civilization. \r\n<br />\r\n<br />\r\nI love reading comic books since I can remember, and now I enjoy reading them with my 3-year-old son. I honestly want him to keep loving them as long as he wants.\r\n<br />\r\n<br />\r\nBut in our increasingly digital world, the industry is still strongly dependent in print sales. Current efforts for a digital transition have yet to gain significant traction.\r\n\r\nWe haven't seen successful efforts in fully embracing the mobile platform as distribution channel, and more important, mobile technologies as new storytelling tools.\r\n<br />\r\n<br />\r\nThere could be a number of reasons for this: status quo inertia, fear of the uncertain and the evident skillset gap between current comics creators and technologists capable of making mobile applications.\r\n<br />\r\n<br />\r\nI planned to fully tackle this last reason. And for that, I needed to build a tool that is easy to use but powerful enough for helping creators unleash mobile's full potential as a mainstream storytelling platform.\r\n<br />\r\n<br />\r\nMoreover, this tool can help them publish their work directly to Apple's App Store, without a publisher intervention, further democratizing distribution channels.","short_description":"Can comics survive a digital-only world?\r\n<br />\r\n<br />\r\nComics is a quintessential art that is relevant now more than ever. But we're living in a increasingly digital world where the print medium is slowly fading. It's my desire to help comics fully embrace digital and mobile as platforms for finding new audiences and keep telling great stories.","further_reading":"<p><b>Goals</b> </p>\n<p>- A free tool for making and publishing mobile comic books to Apple's App Store</p>\n<p><b>Target Audience</b></p>\n<p>- Comics creators and artists, who are looking to explore unknown territories and new platforms<br />\n- Independent Comics writers/artists who want to self-publish</p>\n<p><b>Research/Comparative Projects</b></p>\n<p>I've divided my research in 3 main themes: State of the Art, Comics Creation and Mobile Content Consumption.</p>\n<p>On State of the Art, I've identified two main players in the digital comics space: Comixology and Madefire. Both provide a digital platform for distributing Comics. Comixology only delivers digital version of comic books already designed for print, and then tries to adapt them for mobile use with its 'Guided View' feature, which trims, zooms in/out from panels slide to slide (Personally, I think it breaks the reading experience). Madefire does have a tool for making 'motion comics' from the ground up, but has failed to catch any momentum yet, and have recently pivot to a more traditional approach, not unlike Comixology. Both rely on a page-by-page/scene-by-scene presentation.</p>\n<p>For Comics creation, my main sources were Scott McCloud's 'Understanding Comics' and 'Reinventing Comics', and Will Eisner's 'Comics and Sequential Art'. They are golden resources for knowing what makes a Comic a Comic, and the different visual resources a creator has for telling the story it wants to tell, including notions of time, space, sound and mood. I've also taken ITP's Comics class, which proved to be critical for learning to make a comic book.</p>\n<p>For Mobile Content Consumption, I've how we read things on the Internet and on our phones. Buzzfeed, Twitter, Instagram, Snapchat are a few of the case studies. I've went into looking user preferred mobile interactions (case in point, people love doing everything in portrait, even recording video).</p>\n<p><b>Design - Project Features and Functionality</b></p>\n<p>Based on research, the established design goals were:</p>\n<p>- For creators: Easy tool, no coding/tech skills required. Comic panels would need to be drawn/produced beforehand and used as input.<br />\n- For output comic book: iPhone app, in portrait orientation. The comic book can be scrolled freely with one finger.<br />\n- Panel interactions: Readers can interact indirectly with panels through scrolling, triggering actions prior set on the creator tool. This is the heart of the project.</p>\n<p><b>Why react to scrolling?</b></p>\n<p>One of the most important traits of a Comic is its sequential nature. Freely citing Scott McCloud on his book 'Understanding Comics', your eye is a time machine, it can go forward, backward, sideways, and even consume all the timeline at once. As a reader, you have the control. That's something that motion comics or animated clips may steal from you. Scrolling is the digital version of this control.</p>\n<p><b>Process - Prototyping, Phases, Iterations</b></p>\n<p>+ Concept 1: Project aimed to readers as an innovative mobile comics experience</p>\n<p>The first concept envisioned for this project was initially aimed for mobile comic book readers. I was very focused on fixing the mobile reading experience. The original design goals were setting a new digital format for comic books and an iOS reader supporting it.</p>\n<p>There were a few observations to this approach:</p>\n<p>- It wasn't clear how distribution was gonna work. Do you download the files from a server? A subscription site? As email attachments?<br />\n- It wasn't defined how creators can make a file in that format. Is 3rd parties responsibility to create the tools for manipulating/creating the files?</p>\n<p>I realized the readers weren't actually my direct users, the creator were.</p>\n<p>+ Concept 2: Project aimed to creator as a tool for unlocking new ways of telling comic books stories</p>\n<p>The revisioned concept was focused now on building a tool for creators, so they can make mobile comic books with no digital/tech skillsets necessary. There were a good number of benefits with this approach:</p>\n<p>- Distribution is decided by the creator. They can either share their final work to a publisher or submit directly to the Appstore.<br />\n- The editing process is no longer undefined and now is central to the entire project.</p>\n<p><b>User Testing and Lessons Learned</b></p>\n<p>Concept 2 was tested at different stages:</p>\n<p>+ Stage 1: FramerJS web prototype</p>\n<p>This was a prototype around the reading experience and the scrolling reactions. Users were excited about the promising possibilities of having native mobile comic books.</p>\n<p>+ Stage 2: Xcode iOS prototype</p>\n<p>The next step was testing how a creator could create and edit their comic books for interactivity. Xcode (Apple's development tool) was used as a prototype UI.</p>\n<p>User gave positive impressions about the idea, but they weren't enthusiastic around Xcode itself, given its cluttered interface. That was a major hint that the project needed its own custom UI.</p>\n<p>+ Stage 3: Custom UI prototype</p>\n<p>Users in general seemed positively excited by the project, but they were unsure Xcode was the ideal tool to show to the creators.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail-1.png","title":"thumbnail","alt":"The Future of Comics","caption":"The Future of Comics"},"topics":[{"name":"Narrative","slug":"narrative"},{"name":"Tool\\Service","slug":"toolservice"}],"video_presentation_url":"https://player.vimeo.com/video/269232530","video_documentation_url":"","project_url":"","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail-1.png","title":"thumbnail","alt":"The Future of Comics","caption":"The Future of Comics"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/futureofcomics-archive.gif","title":"futureofcomics-archive","alt":"The Future of Comics","caption":"The Future of Comics"}]}