{"post_id":390,"student_id":"66","student_name":"Manning Qu","student_slug":"manning-qu","advisor_id":"124","advisor_name":"Kathleen Wilson","advisor_slug":"ksw222","project_title":"DING: Intuitive Comm Tool for Grandma","project_question":"Like most of the elderly population in China, my grandmother isn't a smartphone user. Operating technology can be a very frustrating experience for her. She loves to use the functionalities she is already familiar with, like making phone calls, however with her recent hearing loss, calling her on the phone became difficult. \r\n<br />\r\n<br />\r\nAfter failing to teach her how to send a voice message through existing APPs many times, I realized it’s not her fault that she isn't able to operate these 'simple' technologies, it is our fault for expecting her to use something that was not designed for her generation. DING is a project designed specifically for her and individuals of her generation by answering my question: \"how can I make it easier for my grandmother to stay connected with her family and loved ones?” \r\n<br />\r\n<br />\r\nThe project consists of a series of devices mounted to her wall in the form of photo frames, with each frame representing one of the family members. The frames are activated through a user-friendly app. My grandmother will be able to make easy video/phone calls, hear read-out texts and see caption of voice messages, and browse through our social media feeds with simply touching the frames.\r\n<br />\r\n<br />\r\nSome of the strongest barriers in communication between generations are due to the different tools we are primed to use. To bridge this gap, <i>DING</i> is capable of receiving data from other APPs through APIs, which means, I can send her messages with WeChat.\r\n<br />\r\n<br />\r\nOlder adults are a huge group of users but products/services designed for them are very rare. I wish more designers could take parts in this field after reading about my exploration. I believe design for the older adults is design for the future, a future we will all eventually experience.","short_description":"<i>DING</i> is a custom communication tool designed for my grandmother to help her connected to her family and loved ones. It’s a series of devices mounted on her wall like photo frames, running an easy-to-use APP. Each frame represents a different family member.\r\n","further_reading":"","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail-15.jpg","title":"DING_thumbtail","alt":"A picture of photo frame has D I N G on it.","caption":""},"topics":[{"name":"Tool\\Service","slug":"toolservice"},{"name":"UX\\UI","slug":"uxui"}],"video_presentation_url":"https://player.vimeo.com/vimeo/269233310","video_documentation_url":"","project_url":"","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail-15.jpg","title":"DING_thumbtail","alt":"A picture of photo frame has D I N G on it.","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/DC2.jpg","title":"Design Challenge","alt":"how can I make it easier for my grandma to stay connected with family members","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/slide-show-相框照片2.jpg","title":"Senario","alt":"A photo frame, plant, book and glasses on the table","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/界面展示正确尺寸3.jpg","title":"Easy-to-use APP","alt":"4 UI pages showing the simple functions","caption":""}]}