{"post_id":623,"student_id":"67","student_name":"Michael Simpson","student_slug":"michael-simpson","advisor_id":"124","advisor_name":"Kathleen Wilson","advisor_slug":"ksw222","project_title":"MLTK: Machine Listening Toolkit","project_question":"The <i>Machine Listening Toolkit</i> is a software toolkit for streamlining the use of machine listening algorithms. The toolkit was designed to be used in real-time applications and provides access to utilities and data structures that help alleviate the related burdens.\r\n<br />\r\n<br />\r\n <i>MLTK</i> currently includes an openFrameworks add-on, a collection of learning resources, and a standalone tool that can be used to visually explore representations of the  data and data flows. \r\n<br />\r\n<br />\r\nThe dashboard allows users to select, configure, and explore a vast array of relevant algorithms and have their output rendered in real-time as a graphic visualization. The dashboard can display a matrix of real-time visualizations which the user can arrange freely. The simultaneous view allows differences between graphs to become apparent and observed. This is useful as a way of better understanding the algorithms and their relationships to each other but also provides a real-time indication of how the algorithms perform and seem most appropriate for a certain task given the sound. The graphs can individually be explored in 3D to help reveal historical trends in the data visually. Visualizations can be selected on-the-fly to make their data stream available to external applications using OSC. Data can also be exported into flat files in several common data file formats.","short_description":"Sound is a multiplicity of qualities and features. What if a tool allowed us to easily extract and use more of these data points in real-time?\r\n<br />\r\n<br />\r\nThe <i>Machine Listening Toolkit</i> is a project aimed at easing the use of computational audition for creative purposes.","further_reading":"","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thesis_final_thumb.gif","title":"thesis_final_thumb","alt":"CATK_thumb","caption":"CATK_thumb"},"topics":[{"name":"Machine Learning","slug":"machine-learning"},{"name":"Sound","slug":"sound"}],"video_presentation_url":"https://player.vimeo.com/video/269233399","video_documentation_url":"https://player.vimeo.com/video/265682164","project_url":"https://mltk.mgs.nyc/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thesis_final_thumb.gif","title":"thesis_final_thumb","alt":"CATK_thumb","caption":"CATK_thumb"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thesis_final_1_cut.gif","title":"mgs","alt":"mgs","caption":"mgs"}]}