{"post_id":204,"student_id":"70","student_name":"Patrick Presto","student_slug":"patrick-presto","advisor_id":"124","advisor_name":"Kathleen Wilson","advisor_slug":"ksw222","project_title":"Decrypt.Ed","project_question":"<i>Decrypt.Ed</i> is an interactive and practical guide to understanding cryptocurrencies in an approachable way. Societies and communities at one time traded with salt or cowrie shells as these were seen as trusted forms of currency which everyone agreed held value. Eventually, multiple shifts gave rise to coins, banknotes, and later, plastic cards which act as proxies of value and offer consistency to the system of exchange. If is often the case that currencies, or our understanding of value, evolves faster than societies can adapt. \r\n<br />\r\n<br />\r\nMany things are gained as well as lost in the process, including elements of culture, languages, design, and politics. The process of adapting to a new currency often involves a steep learning curve. <i>Decrypt.Ed</i> is a project that evolved from an exploration of the ways in which value is understood, agreed upon, retained and exchanged and attempts to help newcomers up the cryptocurrency learning curve. ","short_description":"In the last couple of years, we have witnessed an evolution of a new kind of currency with the rise of technology-enabled cryptocurrencies. But do we really understand this new future? <i>Decrypt.Ed</i> is an interactive, visual guide that attempts to explain the basic concepts which are foundational to this potential future.","further_reading":"<p>As we all know, stories about the ups and downs of cryptocurrencies have been flooding the news for several years now, <i>Decrypt.Ed</i> began with a rethinking my own understanding of currency. There are over 1,500 cryptocurrencies currently in circulation which can be confusing for newcomers and those interested in understanding this new networked ecosystem. In order to breakdown this new world, I started by exploring existing currencies, and how my peers interact with them, which led me to an investigation of fiat currencies, such as banknotes. The physical nature of fiat currencies makes them particularly useful examples of assigned value in the sense that a simple and inexpensive piece of paper can be assigned any agreed upon value that doesn’t have anything to do with the actual cost of the paper assigned value. </p>\n<p>It’s also interesting to note that the design of banknotes across the 180+ fiat currencies in existence includes a wide range of unique physical properties, including variations in color, language, historical symbols, and even size. My research started on-the-ground at ITP by asking my graduate school peers, who are from a variety of countries, if they had any international currencies to spare which I could use for analysis. The simple act of communicating my thesis question and my interest in reviewing different currencies helped me gauge how little we tend to know about the money we use every day, not just in America but also in other countries. Questions emerged like ‘Who is this person on the Chilean banknote?’, ‘Why is there a lack of different figures on a Chinese Renminbi’? Or, ‘Why were certain Indian Rupee notes taken out of circulation?’</p>\n<p>After collecting over 20+ unique currencies in-person and through one-on-one conversations, I realized scaling my research was important. I turned to scripting programs to help me amass a dataset of over 8,000+ currencies from various countries and time periods. In addition to compiling this large, complex dataset, I began to read the work of financial historians and anthropologists such as Rebecca Sprang, Niall Ferguson, Bill Maurer, and Finn Brunton. Additionally, I used unsupervised learning techniques on my dataset with the intention of having artificial intelligence and machine learning speed up my learning and begin to identify patterns in my data. Whether it was using object detection systems like YOLO to find common objects in the banknotes, k-means clustering to discover repeating color palettes, or tsne to automatically find hidden structures and patterns across the whole dataset, this process allowed me to see currencies from a different point-of-view.</p>\n<p>What I discovered by doing this kind of creative semiotic analysis of the currencies in my dataset was that interpreting the past can help you understand the future. In his book How Would You Like to Pay? How Technology Is Changing the Future of Money, Bill Maurer wrote, “money is not just a technology. It is an extension of relationships, between ourselves and others, our pasts and futures, our world, and the worlds we can imagine.” One of the fundamental issues often highlighted when discussing cryptocurrencies with newcomers is that the foundational knowledge is not yet established. Cryptocurrencies as a topic is filled with technical jargon, economics, various user experiences, and dreaded financial-speak. For each new currency introduced or removed from the past, the layperson always needed to educate themselves. </p>\n<p>This understanding led me to the idea of creating a prototype like <i>Decrypt.Ed</i>, specifically targeted at newcomers. While doing the research for my thesis, I audited a joint course titled “Digital Currencies &amp; Blockchain,” taught jointly by faculty from NYU Stern &amp; NYU Law school. Once I realized that schools were introducing new courses to keep up with the changing landscape, I wanted to synthesize some of my own personal learnings into a guide. Decrypt.Ed is an interactive, visual guide that attempts to explain the basics of blockchain technology and cryptocurrencies, which are, in effect, synonymous with one another. Through prototyping and user testing, I discovered that complex topics are best understood visually with commonly understood analogies which resonate with users. Only when complex ideas can be reduced to a simple framework will it lead others to rethink their own understanding of new concepts and ideas.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Logo_3.png","title":"Logo_3","alt":"logo3","caption":""},"topics":[{"name":"Education","slug":"education"},{"name":"Machine Learning","slug":"machine-learning"}],"video_presentation_url":"https://player.vimeo.com/video/269233906","video_documentation_url":"","project_url":"https://www.patrickpresto.com/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Logo_3.png","title":"Logo_3","alt":"logo3","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/kmeansupdate.gif","title":"kmeansupdate","alt":"kmeansupdate","caption":"Kmeans color palette"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ObjectDetect.png","title":"ObjectDetect","alt":"objectdetect","caption":"Object detection in currency"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Tsne.png","title":"Tsne","alt":"tsne","caption":"Tsne run on 8000+ currencies"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Site.png","title":"Site","alt":"decrypted","caption":"Decrypt.Ed"}]}