{"post_id":350,"student_id":"73","student_name":"Swapna Joshi","student_slug":"swapna-joshi","advisor_id":"124","advisor_name":"Kathleen Wilson","advisor_slug":"ksw222","project_title":"MoleculAR : interactive chemistry kit","project_question":"Given the rapid rate and growing complexity of scientific breakthroughs, it is increasingly important for children today to be exposed to the basics of science long before plunging into the rigors of high school level classes. I developed a particular interest in pre-high school level chemistry after my mother, who is a middle school chemistry teacher, told me about the difficulties her students were having visualizing basic chemistry concepts on a molecular level.\r\n<br />\r\n<br />\r\n<i>MoleculAR</i> is a middle school chemistry kit that consists of physical cards representing the elements in the periodic table, a paper playground and an augmented reality app. The augmented reality component works like a magic window that converts the paper printed periodic table into other wordly, playful interactions. When the students scan individual element cards with their phones, the AR animations they see introduce them to different chemistry concepts, such as the electronic configuration and reactivity of elements. When two element cards are placed side-by-side on the paper playground, then scanned together, the resulting AR videos explain the formation of compounds and bonds. \r\n<br />\r\n<br />\r\nAlthough designed for use in a classroom environment, <i>MoleculAR</i> can also be used as a stand-alone kit for parents to use to introduce chemistry concepts to their children at home.","short_description":"<i>MoleculAR</i> is an interactive visual-spatial kit that helps middle school students visualize chemistry concepts on a molecular level. The kit is comprised of periodic table element cards, a paper playground and an AR app. The aim is to evoke curiosity by progressive disclosure and playful learning.\r\n\r\n","further_reading":"<p>In order to get a better sense of the problems middle school chemistry teachers and students face, I interviewed 12 middle school students and 5 middle school teachers.  In the course of these interviews, l discovered that students do not need to memorize the periodic table in middle school, but they do need to gain a basic understanding of it. After speaking with the teachers, I decided to focus on five core chemistry concepts related to the periodic table: (1)the significance of the periodic table, (2) the reactivity of elements, (3) the electronic configuration of elements, (4) the formation of compounds and (5) ionic, covalent bonds. </p>\n<p>The teachers I spoke with expressed some frustration with the design of many of the current materials available to them for their chemistry classes, including things like the use of simplistic ball and stick figures, animation videos and static diagrams that are not particularly engaging for middle school students. They discussed the importance of having learning tools and techniques that interest the students and pique their curiosity. Along these lines, I looked into the role that curiosity plays in learning and discovered that spatial experience and color segregation have been associated with increased memory and recall. I incorporated this in my prototype while designing the different element cards and color segregating the element families.</p>\n<p>The teachers also shared some of the more innovative and fun activities they have tried to introduce the basic concepts, such as asking the students to wear similar colored shirts and enact the behavior of atoms by holding hands for covalent bonds and give and take objects for ionic bonds. In addition to my teacher interviews, I looked at existing computer-based tools designed to teach chemistry, such as Jmole, which represents 3D molecules, and Chemdraw, which  helps students draw chemical reactions. For the most part, I found that the UI/UX for these products is not intuitive and the content isn’t easy for middle school students to understand.</p>\n<p>The final part of my research involved searching for new ways that emerging technologies might be beginning to play a role in teaching and learning. One of the more interesting Augmented Reality applications I discovered for use in teaching chemistry is 4D elements, which explains chemical reactions using building blocks. I also came across a research project in which augmented reality was used successfully in education to make lessons more engaging and information more apprehensible. The project was conducted in a class environment where a teacher explained molecular shape and size using AR. Project researchers found that 87% of the students showed an increased attention span when the teacher used this AR technique. </p>\n<p>With these findings in mind, I began designing my <i>MoleculAR</i> prototype. Each of the paper cards in the MoleculAR kit  represents a different element in the periodic table. The elements on each card are illustrated to show their particular characteristics, for example nitrogen is made of proteins shown as meat. The element families such as hydrogen family, Alkaline earth metals family are color-coded, which makes them easy to see at a glance. The cards have magnetic strips on the back which make it easy for students to put them up on a whiteboard or refrigerator. They can also choose to lay them out on a table or on the floor. </p>\n<p>The augmented reality experience unfolds as a camera-based interface guides users to position their phones over visual markers on the element cards. Once the scan is complete and the visual marker is recognized, the video associated with that particular marker (and element) begins playing on the user’s phone. By watching the videos, users can see the reactivity and electronic configuration of each element. For example, the specific number of circles they see in the AR videos shows the electronic configuration of the elements. The speed at which they’re moving in the video defines their reactivity. The AR videos associated with a particular element will play as long as the user’s camera continues to recognize the element’s corresponding marker correctly. Simply moving the phone’s camera over the marker on another element card will automatically play the AR video associated with the new element.</p>\n<p>To learn how compounds are formed, students need to first try placing two element cards together on the paper playground that comes with the MoleculAR kit and then try scanning the two cards, side-by-side, with their camera. If the pairing is successful, the students will see an AR video of the compound that’s formed by the two elements and the bond formation.  </p>\n<p>Once my initial prototype was complete, I conducted some preliminary user testing at the ITP Quick &amp; Dirty Show with 15 people of different ages. The feedback I got made me realize that I needed to define the rules of the activity more clearly. I also needed to revise the paper playground graphics, which were not clear. After making these revisions, I play tested my prototype with  8 middle school students. This time, I clearly defined the rules of the activity in advance and gave a preparatory lesson to the students about a narrative that introduces them to the different weird families of the periodic table and what their characters are. The narrative led them to help get the unhappy element families in the playground to play and form new bonds. The students seemed to thoroughly enjoy interacting with MoleculAR and gave me suggestions for how it might work with a group by adding gamification elements and having multiple devices working at the same time. Their parents were involved in this activity and enjoyed the playful chemistry lesson. Further project goals include determining the design considerations that will need to be made for teachers to use MoleculAR in group situations.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumb-1.jpg","title":"kid interacting with MoleculAR","alt":"kid interacting with MoleculAR","caption":"kid interacting with MoleculAR"},"topics":[{"name":"Education","slug":"education"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/video/269234320","video_documentation_url":"https://player.vimeo.com/video/265486473","project_url":"http://www.swapnajoshi.in/molecular","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumb-1.jpg","title":"kid interacting with MoleculAR","alt":"kid interacting with MoleculAR","caption":"kid interacting with MoleculAR"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/pic.gif","title":"augmented reality","alt":"augmented reality","caption":"scan the cards to see the reactivity and electronic configuration"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/pics3.jpg","title":"element cards","alt":"element cards","caption":"element cards with electrons"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/2-1.jpg","title":"students interacting","alt":"students interacting","caption":"user testing with middle school students"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/j.jpg","title":"water formation","alt":"water formation","caption":"scanning multiple cards for compound formation"}]}