{"post_id":507,"student_id":"75","student_name":"Yanlin Ma","student_slug":"yanlin-ma","advisor_id":"124","advisor_name":"Kathleen Wilson","advisor_slug":"ksw222","project_title":".5 Square Meter Land of My Hometown","project_question":"Can listening remotely to the sounds of the changing weather patterns in my hometown help me feel more emotionally connected? For people who live far away from their families and friends back home, a ten-minute phone call or a daily weather check isn’t always enough to help them feel connected. \r\n<br />\r\n<br />\r\nFor my thesis project, I’m trying to translate local weather data into sound effects and build a related set of installations designed to bring the experience of my hometown weather to me in-real-time. <i>.5 Square Meter Land of My Hometown</i> is an installation that simulates the sounds of my hometown in real time.","short_description":"An installation designed to translate local weather data into sound effects and bring the experience of my hometown weather to me in real-time.","further_reading":"<p>I left home six years ago and really miss my hometown and all the lovely people there.<br />\nI particularly miss the unique gratification of feeling my hometown weather with which I’m so familiar. Rather than seeing images of what’s happening back home, I’m more interested in hearing the local sounds. Toward this end, I’m also interested in figuring out the kinds of information about a place that sounds can provide. As many have noted, sound has been under-utilized as a medium for technology-based interactions and storytelling. </p>\n<p>The ecological approach [Designing Auditory Spaces to Support Sense of Place: The Role of Expectation, by Stefania Serafin] to auditory perception suggests that although we understand scientific descriptions of auditory perception, phenomenally we don’t ‘hear’ acoustic signals or sound waves. Instead, we hear events: The sounds of things moving, changing, beginning and ending, forever interdependent of the dynamics of the present moment. We ‘hear’ the sound of silence for example. We hear the semantics of<br />\nsound-producing objects, events and the environment. This is what we call everyday listening. </p>\n<p>I have been inspired by the ways in which Foley artists use everyday objects to simulate movie sound effects, which are added to the film during post-production. These effects include the sounds of things like footsteps, clothes rustling, crockery clinking, paper folding, doors opening, punches hitting, and glass breaking. Historical films often seem lifeless when screened without sound. Adding Foley effects helps bring those long dead images to life. By adding different sound effects to the same visual piece, the information and feelings conveyed can be totally different.</p>\n<p>.5 Square Meter Land of My Hometown is an installation, .5 square meter in size, comprised of four connected parts, each using a Foley effect to simulate the sound of a different weather pattern. The sound of rice dropping on cardboard, for example, simulates rain. The sound of rustling polythene tapes simulates soft wind. The sound of wood and cloth being rubbed together simulates strong wind. The sound of shaking metal sheets simulates thunder. Real-time weather feeds are used to activate the appropriate part of the installation, rain, soft wind, strong wind, or thunder, and thereby bring me the feeling of my hometown wherever I am through the simulated sounds of the local weather patterns back home.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail-1.jpg","title":"thumbnail","alt":"thumbnail","caption":""},"topics":[{"name":"Data","slug":"data"},{"name":"Installation","slug":"installation"}],"video_presentation_url":"https://player.vimeo.com/video/269234428","video_documentation_url":"","project_url":"https://www.yanlinma.com","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail-1.jpg","title":"thumbnail","alt":"thumbnail","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/image1.jpg","title":"image1","alt":"","caption":"image1"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/image2.jpg","title":"image2","alt":"image2","caption":"image2"}]}