{"post_id":523,"student_id":"79","student_name":"Danni Huang","student_slug":"danni-huang","advisor_id":"129","advisor_name":"Nancy Hechinger","advisor_slug":"nh19","project_title":"Jamais Vu","project_question":"Memory is a completely personal experience, constructed from nothing but pure perception. And since memories are always retroactively altered, the perspectives that are based upon them are also never solid and always shifting. Being interested in reading myself through the shifting terrain of subconsciousness and unconsciousness, I started to record my dreams on a regular basis to track their patterns over time.\r\n<br />\r\n<br />\r\nI found it interesting that many of my dreams were of a looping nature, with no beginnings or ends. My project is an attempt to transport the looping nature of these dreams to the waking world via virtual reality, to allow for more lucid exploration of the meaning of loops in our lives. \r\n<br />\r\n<br />\r\nWe are so close to our own life that most of us don’t see the structure of it; we live unaware of the loops in which we live. In <i>Jamais Vu</i> I shortened the cycle of the loops, set an observation distance between us and them and created an immersive virtual world full of repetitions of those endless loops. It consists of four looping scenes that are based on dreams of mine. Together, these four scenes represent the repetitions that fill our life through a series of immersive metaphors: a loop of time, of matter, of energy and of human behaviors. ","short_description":"An experimental VR meditation that consists of repetitive loops inspired by dreams. Drawing on the surrealist approach, <i>Jamaias Vu</i> aims to provide a rich metaphorical representation of our unconscious by transporting the looping feeling of our dreams into the waking world.","further_reading":"<p>My research approach includes the surrealism art of  Dali, Rene Magritte, and Max Ernest, tried to understand their aim to \"resolve the previously contradictory conditions of dream and reality into an absolute reality, a super-reality”. To learn more about dreams, I read <i>Insomniac Dreams, Experiments with Time</i> by Vladimir Nabokov. <i>Einstein’s dream</i>, written by Alan Lightman, and <i>Story of Your Life</i> by Ted Chiang inspired me a lot on the philosophy of loop and time.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail-12.jpg","title":"thumbnail","alt":"0","caption":""},"topics":[{"name":"Narrative","slug":"narrative"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/vimeo/270188760","video_documentation_url":"","project_url":"https://dannnni.com/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail-12.jpg","title":"thumbnail","alt":"0","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/rain.gif","title":"rain","alt":"1","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/piano.gif","title":"piano","alt":"2","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/sun.gif","title":"sun","alt":"3","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/number.gif","title":"number","alt":"4","caption":""}]}