{"post_id":134,"student_id":"80","student_name":"Jarrett C Slavin","student_slug":"jarrett-c-slavin","advisor_id":"129","advisor_name":"Nancy Hechinger","advisor_slug":"nh19","project_title":"Spectrum","project_question":"What does life look like through the bipolar lens?\r\n<br />\r\n<br />\r\nSpectrum is a mobile audio app that places the user in the shoes of a bipolar mind through various situations &amp; thoughts.  The user adjust a slider to hear three different perspectives, (depressed, baseline, and manic) on the same subjects, from the same mind experiencing different mood states.  \r\n<br />\r\n<br />\r\nThis version of 'Spectrum' is comprised entirely of my own personal thoughts, re-living various events in specific situations through each of the 3 primary lenses of the bipolar spectrum.\r\n<br />\r\n<br />\r\n'Spectrum' serves as a prototype that could eventually expand to include the thoughts of several different bipolar individuals. For now, for the sake of focus and scale, I choose to focus on expressing my own personal perspective.\r\n<br />\r\n<br />\r\nFor anyone who has ever struggled to understand what it means to be bipolar, 'Spectrum' seeks to increase empathy, understanding, and communication.  Whether you are bipolar yourself, seeking to relate &amp; compare your own experience to mine, or if you are not bipolar but would like to better understand &amp; empathize with those in your life who are, 'Spectrum' offers a valuable, insightful experience.","short_description":"Can I convey the bipolar experience in a way that is immersive, authentic, and effective? Can I increase empathy &amp; understanding for this perspective and its difficulties?","further_reading":"<p><b>Why Spectrum?</b></p>\n<p>Since being diagnosed with bipolar disorder after suffering a manic psychosis as an adult at age 23, my life has been impacted in a big way, often beyond my control.</p>\n<p>During manic episodes, I have inadvertently alienated friends and family members, creating a gap of understanding that has resulted in many people formerly close to me choosing to cut off contact or treat me as a degenerate, a broken soul, a hopeless child. These harsh reactions have left me in a difficult place-- And those I do still maintain contact with are constantly on the lookout for an onset of mania--- If I seem too happy, they get worried-- if I seem sad, they also get worried. I feel the need to be overly self-conscious when speaking to these people, and instead of revealing my true feelings, I end up telling them whatever I think will most rest their minds at ease. Needless to say, my relationships have become tense, and often unpleasant.</p>\n<p>Part of this fallout is due to the fact that I have found it quite challenging to communicate my experience in a way that allows people to really understand and empathize with my condition. Bipolar disorder, which affects 5.7 million people in the US (2.6% of people 18 or older), is a scary and heavily stigmatized label, often associated with insane asylums, serial killers, and drool-inducing medications. The media portrays mental illness as horrifying, the stuff of urban legends and \"glad-that-isn't-me\"-style anecdotes.</p>\n<p>The truth, however, is that there are many more bipolar people- often undiagnosed- amongst us than one may care to realize. Bipolar is often the fuel for passion &amp; creativity, the weaver of dreams. Manic episodes are often described as peak experiences in one's life, a description that defies an outsider's observation of madness, alienation, and hospitalization.</p>\n<p>So what exactly goes through the mind of a bipolar individual, and is it possible to convey that content in a format that anyone can understand, digest, and empathize with?</p>\n<p>On a certain level, this empathy is only truly possible through direct brain manipulation-- drugs, or some future brain-jack device that actually tweaks your neurons. So much of the bipolar experience transcends words, and can only be expressed in raw emotion. However, there is an element of the bipolar experience that we can attempt to capture: The word-translated thoughts associated with a bipolar's reaction to various situations, and the vast difference between a bipolar's reaction to the same exact stimuli depending on the mind's current mood state.</p>\n<p>It is with that hope that I present \"Spectrum,\" my attempt to capture my situational bipolar thoughts within the confines of a mobile audio app-- each thought juxtaposed with its own inverse-- that is, the manic version of the depressed thought, and vice versa, along with the \"baseline\" (neutral) version of the thought, all mapped to the same button.</p>\n<p>My hope is to provide some level of empathetic access into the makeup of my mind, triggering some sort of reaction or identification in each user, increasing their depth of understanding of bipolar states. </p>\n<p><b>Design Decisions</b></p>\n<p>“Spectrum” began it’s conception as a 360-video VR project.  The plan was to have the user gaze at different elements of a 360 degree videoscape, triggering audible thoughts that would change depending on the position of the adjustable “mood slider.”  After some experimentation with 360 video in VR, I found that the fidelity of affordable 360 video was relatively low, and the limited, inflexible pipeline for working with 360 video in Unity would likely drag down my production and force me to focus completely on tech rather than content.</p>\n<p>Early on, I received a suggestion that would prove to be invaluable:  Why not make “Spectrum” a mobile audio app, and instead of 360 video in VR, let the user’s physical environment serve as the visual background?  By prompting the user to physically place themselves in the given situation, the audio could supplement his or her own reality, and provide a potentially richer, more personal experience.</p>\n<p>At this point I decided to go in the all-audio direction, allowing me to focus on user experience, content generation, and iteration.  “Spectrum” essentially became an adjustable sound-board, with buttons to open “situations” (such as “on the subway,” “walking in the city,” or “alone in bed”), which would lead to a board of dialogue buttons, triggering audio that would change depending on whether the slider was positioned to the left (depressed), middle (baseline) or right (manic).</p>\n<p>As for the visual interface, I decided to keep it simple and clean.  To represent the shifting moods, I made the background of the app shift from black, through grey, to white as the slider moves from left to right, the color proving (through user testing) to be more effective than other symbols I had initially conceived, such as “happy face” versus “sad face” or “fire” versus “ice.”</p>\n<p>All in all, I am happy with these design decisions-- yes, it allows the user to potentially play a sound board without actually being in the physical situation, but this tradeoff is worth it for the possibility that they actually do place themselves in the given situation, creating a far more powerful aesthetic than can be currently achieved in VR. </p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/spectrumThumbnail.jpg","title":"spectrumThumbnail","alt":"thumbnail","caption":""},"topics":[{"name":"Health","slug":"health"},{"name":"Identity","slug":"identity"}],"video_presentation_url":"https://player.vimeo.com/video/270189255","video_documentation_url":"","project_url":"https://jarrettslavin.com/2018/04/16/spectrum-more-resources/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/spectrumThumbnail.jpg","title":"spectrumThumbnail","alt":"thumbnail","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/spectrumMoreImages2.jpg","title":"spectrumMoreImages2","alt":"screenshot","caption":"screen"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/spectrumMoreImages1.jpg","title":"spectrumMoreImages1","alt":"poster","caption":"poster.."}]}