{"post_id":125,"student_id":"82","student_name":"sejo vega-cebrián","student_slug":"sejo-vega-cebrián","advisor_id":"129","advisor_name":"Nancy Hechinger","advisor_slug":"nh19","project_title":"everything must go ( … )","project_question":"<i>everything must go ( … )</i> is an immersive experience that happens in a dark room and lasts around one hour. the panel members - silence, pre-recorded laughter, and cyborg in existential anxiety - have their spots indicated onstage by dim lights. only the third participant has a human shape. during the discussion, the moderator performs chance operations live to decide how the interventions should develop. in the first part the conversation is reserved for the three participants and the moderator's random remarks; for the second part the audience is repeatedly invited to contribute with questions.\r\n<br />\r\n<br />\r\na companion booklet is provided for consultation as a logocentric aid, for those who prefer words as a source of meaning. this booklet contains a comprehensive collection of the scripts, ideas, attempted descriptions of the work, and other fragments of text surrounding the genesis of the experience.\r\n\r\nthe creation process started with me being overwhelmed by the climate breakdown and other contemporary crises verging on total collapse(s). it took its short title, <i>everything must go</i>, from a <a href=\"http://www.monbiot.com/2017/11/24/everything-must-go/\">column of the journalist and environmentalist george monbiot</a>.\r\n<br />\r\n<br />\r\nin my research i tried to trace back in ideologies and worldviews the origins of \"the problem\", also exploring the difficulties of letting go of the life i take for granted. the process became an acknowledgement of the complexities and contradictions that exist when trying to confront these deep issues. this situation led me to a renewed way of looking at the world, and it also made me decide to extend the title of the work. \r\n<br />\r\n<br />\r\nimportant references during the process were the works of john cage, the theater of the absurd, existentialism, and posthuman philosophy. the research also included dipping into readings about zen buddhism, the tao, and the limitations of western thought.\r\n<br />\r\n<br />\r\nthe project is a free cultural work, and it was entirely built with free (libre) software.","short_description":"<i>everything must go, or a journey to obtain an all-access pass to existential anxiety and attain some kind of enlightenment</i>, is a performance in the form of a panel discussion about radical change (?). the participants are silence, pre-recorded laughter, cyborg in existential anxiety, and a chance-based computerized moderator.","further_reading":"<p><b>multimedia</b></p>\n<p>the following is a <a href=\"https://archive.org/details/everythingmustgotrailer\">trailer for the event</a> (0:00:59)<br />\n[video src=https://archive.org/download/everythingmustgotrailer/everythingmustgo-trailer_.mp4][/video]</p>\n<p>the event was performed three times; twice in the immersion room of the avery fisher center in bobst library (2018-03-22, 2018-04-08), and once in the studio g05 of abrons arts center (2018-04-14). here are the video and audio recordings of those events:</p>\n<ul>\n<li>third showing: <a href=\"https://archive.org/details/everythingmustgo-thirdshowing-20180414\">video recording of the full performance</a> (1:16:34) - <a href=\"https://archive.org/details/everythingmustgo-thirdshowing-20180414-60x\">60x sped up version</a> (0:01:16)</li>\n<li>second showing: <a href=\"https://archive.org/details/everythingmustgo-secondshowing-20180408\">video recording of the full performance</a> (0:56:05)</li>\n<li>first showing: <a href=\"https://archive.org/details/everythingmustgo20180322\">audio recording of the full performance</a> (1:11:13)</li>\n</ul>\n<p>the companion booklet is 86 pages long. it can be <a href=\"https://archive.org/details/everythingmustgobook\">downloaded for free</a> and a <a href=\"http://www.lulu.com/shop/sejo-vega-cebri%C3%A1n/everything-must-go-or-a-journey-to-obtain-an-all-access-pass-to-existential-anxiety-and-attain-some-kind-of-enlightenment/paperback/product-23581404.html\">paperback version can be bought online</a>.</p>\n<p><b>context</b></p>\n<p>i would say that this work is my poetic response to the times we are living in. </p>\n<p>for me, during this semester, any attempt of talking about the project has been felt incomplete and unsuccessful. i now prefer to let the work somewhat speak by itself (as they say, i would not be performing it if i could instead talk and write about it.)</p>\n<p>in any case, here are some key terms that may <i>and</i> may not guide the reading and understanding of where i have been coming from in this work. they emerge from my research, feedback i received, and the constant conflicts and questions that i decided to embrace. from my point of view, all of them get relatively reflected during the event:</p>\n<p>radical change<br />\n(anti|post)logocentrism<br />\n(anti|post)anthropocentrism<br />\n(anti|post)western thought<br />\nunmanageable complexities<br />\nrealization of the absurd<br />\ntechnological distortion<br />\ncontrol as illusion<br />\nchance operations<br />\nattempted monism<br />\ncontradictions<br />\nexistentialism<br />\nintrospection<br />\nsolidarity<br />\nlistening<br />\ndoubt<br />\nirony</p>\n<p>at of this moment, being cognizant of this as an ongoing process, i would say the following:<br />\n<i>it is better to get acquainted with the existential abyss, questioning and attempting to meet with our own personal and experiential truths, laughing and enjoying the process, than to waste the “gift” of our consciousness living under the arbitrary constraints of other (probably dead) fellow humans. it might be better to embrace the purposelessness of life to then create and live an authentic life™. i'm probably wrong. who am i to decide it.</i></p>\n<p>my (anti?)conclusion for this process would be:</p>\n<p><i>the best thing one can do is to doubt everything.<br />\nmaybe.<br />\n:)<br />\n</i></p>\n<p><b>software</b></p>\n<p>from a technical standpoint, the whole event is guided by a program built in pure data, that works as a chance-based finite state machine. this program is the moderator: performing chance operations live to decide several parameters of the event, and controlling the audio samples playback and audio output.</p>\n<p>as an input, the program can receive two types of network messages and keyboard commands 1) to start the event, and 2) to indicate that the audience has asked a new question. every other aspect of the sequence of events is determined by the program based on predefined constraints. besides those control inputs, the software also receives and processes the audio coming from the microphone where the cyborg in existential anxiety speaks.</p>\n<p>the main output of the program is the audio line with a mix of sound effects, the moderator voice, the pre-recorded laughter, and the cyborg in existential anxiety voice.  it also outputs a recording of the aforementioned audio, and a couple of midi commands to turn on or off the small digital candle on stage. the other stage lights are controlled via dmx by the human stage manager (mel) following the cues of the moderator.</p>\n<p>the parameters that are randomly decided during each event are: the duration of the two sections of the panel, the duration of each intervention of the panelists (with the maximum set at 4:33 minutes), the sequence of panelists' participations, the amount of random remarks between each intervention, and the actual remarks that are said by the moderator. the distortion of the voice of the cyborg in existential anxiety is also controlled by chance, with a constant change of parameters like oscillators frequencies, gains, and delays.</p>\n<p><b>free cultural work</b></p>\n<p>the work is licensed under the <a href=\"https://creativecommons.org/licenses/by-sa/4.0/\">creative commons attribution-sharealike 4.0 international license</a>, so it can be considered a <a href=\"http://freedomdefined.org/Definition\">free cultural work</a>. therefore you or anyone else can share, copy, perform, redistribute, adapt, remix, transform, build upon the work for any purpose, even commercially, as long as you attribute it and share the result with the same license.</p>\n<p>all the resources can be found in a <a href=\"https://github.com/sejomagno/EverythingMustGo\">github repository</a>.</p>\n<p><b>free (libre) software</b></p>\n<p>the software of the work is licensed under the <a href=\"https://www.gnu.org/licenses/gpl-3.0.en.html\">gnu gpl 3.0</a>.</p>\n<p>the whole project was made using <a href=\"https://www.gnu.org/philosophy/free-sw.html\">free (libre) software</a> only, in a computer running <a href=\"http://parabola.nu/\">parabola</a>, a gnu/linux-libre operating system.</p>\n<p>the texts were written and edited in <a href=\"https://www.vim.org/\">vim</a>, with further manipulation in bash with utilities like shuf, tr, sed, and cat.</p>\n<p>the software for the flow of the performance and live audio manipulation was made using <a href=\"http://puredata.info/\">pure data</a>. the speech synthesis for the moderator was done using <a href=\"http://www.cstr.ed.ac.uk/projects/festival/\">festival</a>. audio edition was done with <a href=\"http://www.audacityteam.org/\">audacity</a>.</p>\n<p>image manipulation was done using <a href=\"https://www.imagemagick.org/\">imagemagick</a>, <a href=\"https://www.gimp.org/\">gimp</a> and/or <a href=\"https://inkscape.org/\">inkscape</a>. slideshows and other documents were created with <a href=\"libreoffice.org\">libreoffice</a>, and the resulting pdf files were manipulated with <a href=\"https://www.pdflabs.com/tools/pdftk-the-pdf-toolkit/\">pdftk</a>. video edition was done with <a href=\"https://kdenlive.org/\">kdenlive</a> and <a href=\"https://ffmpeg.org/\">ffmpeg</a>.</p>\n<p>some software experiments were done with <a href=\"https://processing.org\">processing</a>, and the digital candle runs with <a href=\"https://arduino.cc\">arduino</a>.</p>\n<p>version control was done using <a href=\"https://git-scm.com/\">git</a>. the companion booklet was typeset with <a href=\"https://www.latex-project.org/\">latex</a>.</p>\n<p><b>bibliography</b></p>\n<p>Berardi, Franco. The Uprising: On Poetry and Finance. Semiotext(e), 2012. </p>\n<p>Boal, Augusto. Teatro del Oprimido/1 Teoria y Práctica. Editorial Nueva Imagen, 1980. </p>\n<p>Braidotti, Rosi. The Posthuman. Polity Press, 2013. </p>\n<p>CAConrad. Ecodeviance (soma)tics for the future wilderness. Wave Books, 2014. </p>\n<p>Cage, John. A Year From Monday. Wesleyan University Press, 1967. </p>\n<p>- Silence: 50th anniversary edition. Wesleyan University Press, 2011 . </p>\n<p>Eisler, Riane. The Real Wealth of Nations. Berret-Koehler Publishers, 2007. </p>\n<p>Ende, Michael. Momo. Doubleday and Company, Inc., 1984. </p>\n<p>Esslin, Martin. The Theatre of the Absurd. 3rd ed. Vintage Books, 2004. </p>\n<p>Hoff, Benjamin. The Tao of Pooh. E.P. Dutton, Inc., 1982. </p>\n<p>Jaeger, Peter. John Cage and Buddhist Ecopoetics. Bloomsbury, 2013. </p>\n<p>Kingsnorth, Paul and Dougald Hine. Uncivilisation: The Dark Mountain Manifesto. 2009. </p>\n<p>Lent, Jeremy. The Patterning Instinct. Prometheus Books, 2017. </p>\n<p>McLuhan, Marshall and Quentin Fiore. The Medium is the Massage: An Inventory of Effects. Bantam Books, Inc., 1967. </p>\n<p>Monbiot, George. How did we get into this mess? Verso Books, 2016. </p>\n<p>- Out of the Wreckage: A New Politics for an Age of Crisis. Verso Books, 2017. </p>\n<p>Morton, Timothy. Humankind - Solidarity with nonhuman people. Verso, 2017. </p>\n<p>Nisbett, Richard. The Geography of Thought. The Free Press, 2003. </p>\n<p>Pareja, Anabella. Mientras pienso en otra cosa: Apuntes coreograficos en extincion. Centro de Cultura Digital, 2017. </p>\n<p>Parra, Nicanor. Antipoems: How to look better and feel great / antitranslation by Liz Werner. New Directions Books, 2004. </p>\n<p>- Nuevos Sermones y Predicas del Cristo de Elqui. Ediciones Ganymides, 1979. </p>\n<p>- Sermones y Predicas del Cristo de Elqui. 2nd ed. Ediciones Ganymides, 1979. </p>\n<p>Shawn, Wallace. Essays. Haymarket Books, 2009. </p>\n<p>Squiers, Anthony. An Introduction to the Social and Political Philosophy of Bertolt Brecht. Rodopi, 2014. </p>\n<p>Suzuki, Daisetz Teitaro. An Introduction to Zen Buddhism. Rider &amp; Company, 1949. </p>\n<p>- Zen Buddhism. Image Books Doubleday, 1996. </p>\n<p>Suzuki, Shunryu. Zen Mind, Beginner’s Mind. Weatherhill, 1999.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail.png","title":"thumbnail","alt":"image of a dimly lit dark table in a dark room. it contains the following elements: a laptop with a small lamp over it, a microphone, a small booklet, and three glass cups","caption":""},"topics":[{"name":"Performance","slug":"performance"},{"name":"Society","slug":"society"}],"video_presentation_url":"https://player.vimeo.com/video/270189609","video_documentation_url":"","project_url":"https://eccs.world/everythingmustgo","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thumbnail.png","title":"thumbnail","alt":"image of a dimly lit dark table in a dark room. it contains the following elements: a laptop with a small lamp over it, a microphone, a small booklet, and three glass cups","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/slide1.png","title":"slide1","alt":"image of a dimly lit dark table in a dark room. it contains the following elements: a laptop with a small lamp over it, a microphone, a small booklet, and three glass cups","caption":"the setting for the panel discussion: the computerized moderator, the microphone and booklet for the cyborg in existential anxiety, and glass cups to acknowledge the three panel members."}]}