{"post_id":276,"student_id":"83","student_name":"Kar Rosen","student_slug":"kar-rosen","advisor_id":"129","advisor_name":"Nancy Hechinger","advisor_slug":"nh19","project_title":"The Quantum Carnival","project_question":"Step right up, and enter the Quantum Carnival!\r\n<br />\r\n<br />\r\nQuantum Carnival is a proposal for a museum exhibition that  presents key principles of quantum physics in the form of a carnival sideshow performance.\r\n<br />\r\n<br />\r\nConcepts like Schrödinger’s Cat experiment, the double slit experiment, relativity, Heisenberg’s principle of uncertainty, multiverse theory/butterfly effect, probability, and others are shown as sideshow acts or staged as carnival games.\r\n<br />\r\n<br />\r\nA central goal of this project is to cut through the widespread perception that  quantum physics is too complex for most people to understand, by offering an introduction to this important and fascinating scientific field in an engaging and playful way.\r\n<br />\r\n<br />\r\nThe smoke-and-mirror aesthetics of turn-of-the century fairgrounds is well-suited to explaining principles of quantum physics, due to its penchant for playfully blurring the lines of reality and uncertainty. Embracing the performative, welcoming, and down-to-earth tone that has come to define this unique part of American culture allows audiences an immediate, appealing connection to quantum physics - which, just like the sideshows that dotted the boardwalks and campgrounds of the early 20th century, is full of mind-bending wonder that can truly astound.\r\n<br />\r\n<br />\r\nMinimal Viable Product is a design booklet and a prototype of one of the interactive demonstrations: The Great Heisenberg’s Uncertainty Chest, a game where audiences are asked to guess if a light (programmed to a random state) concealed within a closed trunk is on or off. I will demonstrate the trunk but without the performative element it would have in the exhibit, where a facilitator would be there acting like a performer running the carnival game.","short_description":"A proposal for a museum exhibit that explains quantum physics principles framed as a boardwalk carnival sideshow.","further_reading":"<p>I like to learn weird things. I like to learn and to teach. I want learning to be fun-- and that journey to knowledge can be just as fun and rewarding as the knowledge gained. I also wanted to be a scientist growing up and yet somehow wound up in art school. Life’s weird that way.  I still feel that part of me that wants to be that researcher to be both artist and scientist; to blend what I love and know I am good at. With this project I  can show off my skills not only as an artist, designer, and technologist but also satisfy that dream in some little way. I want to find way to make complex ideas understandable an compelling to a general audience. I believe that working on exhibits will accomplish that goal.</p>\n<p>My research approach was through books, articles, and videos on the topics and principles I was trying to illustrate as well as turn of the century sideshows, the Showmen of the day (P.T. Barnum the grandest  of them all) early curators of Cabinets of Curiosities, and early museum exhibits. Visits to science museums to see what current interactive museum exhibits are on display actually do to make learning fun, such as the New York Hall of Science and the Exploratorium, and virtual visits to those I cannot feasibly reach. I will and have been consulting with people at ITP and outside of the program on the topics of Illusion, Reality, Quantum Physics, and the practical skill of Fabrication and Electronics to make sure this concept is actually feasible to do as well keeping the heart of fun exploration I intend.</p>\n<p>The Trunk of Uncertainty is a prototype of one of the interactive exhibits. It is an antique wooden trunk I found in  a junk shop that I restored and modified so that I could place  an electronic component inside.Hidden beneath a felt false door lies the 3.7 volt lithium potassium battery and Trinket M0 microcontroller that is wired to an LED light bulb and a switch. When the switch is pressed the microcontroller is programmed to randomly generate a number between 0 and 5000. If the number is below 2500, it will remain off, if it is above 2500 it turns on. While not truly random, it  generates something that is close to it.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thesis_archive_thumb.jpg","title":"thesis_archive_thumb","alt":"A brown wooden trunk stands before a red curtain. White light emits through the cracks of the open trunk top.","caption":""},"topics":[{"name":"Education","slug":"education"},{"name":"Play","slug":"play"}],"video_presentation_url":"https://player.vimeo.com/video/270189849","video_documentation_url":"","project_url":"http://www.karrosen.com","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thesis_archive_thumb.jpg","title":"thesis_archive_thumb","alt":"A brown wooden trunk stands before a red curtain. White light emits through the cracks of the open trunk top.","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thesis_archive1.jpg","title":"thesis_archive1","alt":"Two posters sit on a white background. The first one is a typographic poster in red, yellow, blue, and black, styled like an old fashioned carnival poster that reads The Great Heisenberg's Quantum Carnival: A museum attraction like no other. Everything is an uncertainty, and nothing is certain. Kar Rosen ITP Thesis 2018. The second poster is a hand painted poster. Framed by red curtains, and a green background, a headless man pops out of an open brown wooden trunk. Intead of a head is a yellow question mark and he doffs his black top hat off to the audience. Above a yellow banner reads \"The Trunk of Uncertainty\".","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thesis_archive2.jpg","title":"thesis_archive2","alt":"A brown wooden trunk sit surrounded by black fabric. It is decorated with antique brass corners and latches. The corners are black leather with antique brass hobnails driven into it.","caption":"A brown wooden trunk sit surrounded by black fabric. It is decorated with antique brass corners and latches. The corners are black leather with antique brass hobnails driven into it."},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thesis_archive3.jpg","title":"thesis_archive3","alt":"Sitting on black fabric, a small wodden box lies open to reveal a red velvet lining. It's cover reads \"The Great Heisenberg's Amazing Quantum Acrobats. A sight no one can miss!\"","caption":"Sitting on black fabric, a small wodden box lies open to reveal a red velvet lining. It's cover reads \"The Great Heisenberg's Amazing Quantum Acrobats. A sight no one can miss!\""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/thesis_archive4.jpg","title":"thesis_archive4","alt":"","caption":"A layout of a fictional exhibit with the visitor flow. Fist has the ticket seller outside, then the first room is the sideshow. It leads to the room of reactivity, which opens up to the Quantum Zoo. That in turn leads to the carnival games and souvenir area, as well as the exits."}]}