{"post_id":191,"student_id":"85","student_name":"Melissa Parker","student_slug":"melissa-parker","advisor_id":"129","advisor_name":"Nancy Hechinger","advisor_slug":"nh19","project_title":"Honeybee Training Academy","project_question":"The first activity in <i>Honeybee Training Academy</i> is called 'Pollination Protocol.' Giant fabric flowers with embedded arcade buttons are spread out in a large space. One at a time, the children run between the flowers, pollinating them by pushing the buttons. Their path and current distance is visualized and displayed in real time using a projector. Once all the flowers have been pollinated, the total distance the children traveled is displayed along with a 'leaderboard' showing the best scores of their classmates.\r\n<br />\r\n<br />\r\nThe objective of this lesson is to teach kids the basics of permutations. Pollination Protocol is an adaptation of the Traveling Salesman Problem. When honeybees are collecting pollen from different clusters of flowers, it is important for them to fly the path with the shortest total distance in order to conserve energy. This is an extremely difficult math problem! For ten clusters of flowers, there are almost two million unique paths that a bee could take. Thanks to evolution, bees’ collective intelligence allows them to instinctively find the optimal order of flowers to visit. Humans, of course, do not have this innate ability. <i>In Honeybee Training Academy</i>, kids will tackle this classic math problem head on.","short_description":"A classroom-adaptable installation where children learn about math by role playing as honeybees.","further_reading":"<p>My original thesis question was: How can I make math fun and engaging for kids? When I worked as a high school math teacher, I witnessed math anxiety every day. I was teaching at one of the best high schools at New York City, and yet students would frequently apologize for “being dumb” because they were struggling with concepts like trigonometric equations. This was extremely distressing! At the time I didn’t have the ability to experiment with the curriculum, but I felt that if I could make the subject matter more fun and entertaining, the kids would be less preoccupied with their own perceived intellectual deficiencies, and more likely to learn something.</p>\n<p>At the beginning of my research phase I visited an institution known for 'fun math' implementation—the National Museum of Mathematics (MoMath). They succeeded in creating a space where kids can run around and enjoy themselves. For example, there is a body-tracking live video exhibit where kids are shown what they would look like if their bodies were fractals. There is another where they step on a huge LED floor to generate Voronoi diagrams. The centerpiece of the museum is a track built for tricycles with square wheels. In my opinion, the square-wheeled tricycle is the most successful of these three, because it poses a very clear question for kids to consider: “How does it work?” From an instructional standpoint, however, it might be more valuable to hand a child some materials and ask them to redesign the wheel. </p>\n<p>David Hawkins advocates for this technique in his essay, <i>Messing About in Science</i> [1]. He describes an elementary science class he taught where he gave pairs of students frames that could support weighted strings—an exploratory study of pendulums. As he says, messing about “becomes a way of working that is no longer childish though it remains always childlike, the kind of self-disciplined probing and exploring that is the essence of creativity.” MoMath’s square-wheeled tricycle was a creative feat for the constructor, but does not give the children their own chance to create.</p>\n<p>In the essay <i>Situating Constructionism</i>, Seymour Papert and Idit Harel introduce the idea of soap-sculpture math [2]. Soap-sculpture math is a combination of math and art, where there is a tangible and desirable product of student work. This is a constructionist framework for learning. One of the goals of constructionism is to shift the balance of power between teacher and student—so the flow of information is not one-directional, and students are able to produce their own knowledge.</p>\n<p>After visiting MoMath and reading Hawkins and Papert, I realized that I had an important choice. I could focus my efforts on designing something “fun” irrespective of its instructional merits. The justification for this would be to simply foster positive math associations at a young age. Or I could attempt to design an installation that actually encourages mathematical problem solving. I decided to pursue the latter. My thesis question then became: Can we teach kids advanced mathematical concepts through play? I proposed to answer this question by encouraging children to harness the mathematical powers of honeybees.</p>\n<p>Here are the most important design aspects of <i>Honeybee Training Academy</i>:</p>\n<p><b>Role Play</b></p>\n<ul>\n<li><span>This creates a fun learning environment and also makes it less risky to participate when you are inhabiting the “character” of a worker bee in training.</span></li>\n<li><span>Introduces a “high stakes” scenario as an engagement technique. When mathematics is abstracted, it can be difficult to persuade students why permutations is an important and relevant concept. For honeybees, this is a life or death situation!</span></li>\n</ul>\n<p><b>Multidisciplinary Approach</b></p>\n<ul>\n<li><span>This lesson could be used in a math, science, or physical education class.</span></li>\n<li><span>This approach provides an entry point for students who might be anxious about math, but really enjoy science class or gym.</span></li>\n</ul>\n<p><b>Kinesthetic Approach</b></p>\n<ul>\n<li><span>There are many excellent examples of kinesthetic math learning, like Marcia Wade’s </span><i><span>Math &amp; Movement </span></i><span>program, or Gunning, Marrero and Dashoush’s lesson, </span><i><span>How Big is a Whale? </span></i>[3,4]. Many of these are used to reinforce math concepts and techniques taught in a traditional setting, like classifying angles or using nonstandard units of measurement.</span></li>\n<li><span>Instead of math practice, </span><i><span>Honeybee Training Academy</span></i><span> introduces high-level mathematics not usually seen in an elementary curriculum. However, a teacher can still integrate national math standards into its implementation. For example: data collection, graphing, and measuring distance.</span></li>\n</ul>\n<p><b>A Level Playing Field</b></p>\n<ul>\n<li><span>Introducing a math problem that humans have not fully “solved” themselves (trying to find the optimal path between a few dozen points could take a computer years</span> <span>to determine) reduces the stigma of “not getting it.”</span></li>\n<li><span>Because humans have only discovered a “brute-force” solution, kids can be encouraged to come up with their own heuristics [5].</span></li>\n</ul>\n<p><b>Repeated Interaction</b></p>\n<ul>\n<li><span>Hawkins says, “all of us must cross the line between ignorance and insight many times before we truly understand.” </span></li>\n<li><span>Students’ data is saved and their distances recorded as “scores” so they are motivated to try to improve their score and optimize their total distance.</span></li>\n<li><span>Repeated interaction encourages students to recognize patterns between paths and make predictions about which paths will have longer or shorter distances.</span></li>\n</ul>\n<p><b>Classroom Use</b></p>\n<ul>\n<li><span>The original </span><i><span>Honeybee Training Academy</span></i><span> uses physical computing to interpret signals from arcade button sensors and visualize that data. However, it also exists as a stand-alone web application, so teachers can set up “flowers” in their classrooms or gymnasiums using any colorful objects and still be able to track student’s path by clicking on the corresponding flower as they run through the course.</span></li>\n</ul>\n<p>Documentation for <i>Honeybee Training Academy</i> can be viewed <a href=\"http://www.mejiasparker.com/category/thesis/\">here</a>.</p>\n<p><i>Works cited:</i></p>\n<p>1. Hawkins, David. \"Messing about in science.\" Science and Children (1965): 5-9.<br />\n2. Papert, Seymour, and Idit Harel. \"Situating constructionism.\" Constructionism 36.2 (1991): 1-11.<br />\n3. Wade, Marcia. \"Math and movement: Practical ways to incorporate math into physical education.\" Strategies 29.1 (2016): 10-15.<br />\n4. Gunning, Amanda M, et al. “How Big Is a Whale? A Kinesthetic Integrated Science and Mathematics Lesson.” Current: The Journal of Marine Education 31.1 (2017): 16–21.<br />\n5. Nilsson, Christian. \"Heuristics for the traveling salesman problem.\" Linkoping University (2003): 1-6.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/archive-site-thumbnail.png","title":"archive-site-thumbnail","alt":"A giant fabric flower with 15 inch pink petals and a yellow arcade button in the center.","caption":""},"topics":[{"name":"Education","slug":"education"},{"name":"Play","slug":"play"}],"video_presentation_url":"https://player.vimeo.com/vimeo/270190064","video_documentation_url":"https://player.vimeo.com/video/265281890","project_url":"http://www.mejiasparker.com/category/thesis/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/archive-site-thumbnail.png","title":"archive-site-thumbnail","alt":"A giant fabric flower with 15 inch pink petals and a yellow arcade button in the center.","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/archive-site-path.png","title":"archive-site-path","alt":"Visualization of pollination path. 7 circles and a one beehive connected by a white line.","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/archive-site-leaderboard.png","title":"archive-site-leaderboard","alt":"Leaderboard. Shows the total distance, which was 35 feet. It says New Leader in the center, and below that it shows a high score table.","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/archive-site-usertest.png","title":"archive-site-usertest","alt":"Children interact with the web application. They are comparing the distances of different paths.","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/archive-site-press.png","title":"archive-site-press","alt":"The creator presses the center of a pink giant fabric flower to demonstrate that it lights up and records the data. She is smiling.","caption":""}]}