{"post_id":332,"student_id":"87","student_name":"Sharif Al-hadidi","student_slug":"sharif-al-hadidi","advisor_id":"129","advisor_name":"Nancy Hechinger","advisor_slug":"nh19","project_title":"Odyssey","project_question":"<i>Odyssey</i> is a set of features of a proposed larger application suite meant to assist authors, writers, journalists, and students write and organize all their research in one location. This version of the application focuses solely on audio/video transcription. <i>Odyssey</i> seeks to fill a gap within the market for writing tools, as well as improving the experience and helping users save time through automation. I developed a tool to accurately and quickly transcribe multimedia files using two APIs: IBM Watson and Google Speech. Users are provided time stamped and color coded transcripts in order to easy find and correct inevitable mistakes. A user can click on a word within the transcript to start playing the specific audio/video file from that point. This serves two purposes: to retrieve correction recommendations for edits as well as allowing for users to resume a file from a specific location within the file. ","short_description":"<i>Odyssey</i> is an online tool that helps writers, podcasters, and interviewers upload and transcribe their audio or video files making it easy to search through files.","further_reading":"<p><b>User Interviews</b></p>\n<p>During my initial research for Odyssey as a research and writing tool I found that all of the top rated tools all lacked one key feature that often accompanies research: transcription. Although products such as Zotero and Evernote provide wonderful features for organization and file organization, they lack the ability to quickly find what you look for within multimedia files.</p>\n<p>I conducted interviews initially with three individuals Ana(student), Yassir(Physician), and Leena(Psychologist). When asked about tools they use for their research and writing process, the top mentions were Google Docs, Evernote, and Authero. The features they enjoyed most are the clean design, seamless syncing across devices, and the ability to collaborate. Upon further research with more perspective users I was able to create Personas and User Journeys to identify the biggest pain point in the process for the users.</p>\n<p>Sifting through hours and hours of audio and video files searching for the mention of a topic or keyword leads to wasted time. By providing a tool that allows for quick and accurate transcription, users are able to quickly and easily search for keywords or topics they are searching for. After speaking with journalists and podcasters about their pain points in the research process the primary issue was searching through audio/video interviews or recordings looking for a topic. Providing accurate transcript quickly allows for the user to save time, and focus on their work.</p>\n<p><b>Odyssey Competitor Research</b></p>\n<p><i>Odyssey</i> was born out of the pain point my perspective users described. The ability to upload interviews, talks, conversations and other recordings while receiving written timestamped text documents. The average cost of manual transcriptions lies between $100-200 per hour of audio or video with high turnaround times. The use of software to improve speeds, multiple languages, and lowering costs will help users improve  The use of deep learning neural networks, natural language speech to text technology is readily available and constantly improving. Creating a platform that takes advantage of these advancements automating traditional manual tasks to improve performance and reduce time requirements to complete tasks.</p>\n<p>While <i>Odyssey</i> compares rather closely with many of the competing companies it stands out due to some of its key features. Keeping costs low, accuracy high, and quick results is the highest priority. It is for these reasons that we provide access to the service at cost, in the most efficient way possible. Utilizing natural language processing through neural networks Odyssey is able to improve accuracy over time as the data set improves through use. Using both <i>Google Speech<i> in conjunction with <i>IBM Watson<i> allows for increased accuracy and increased recommendations for editing corrections.</p>\n<p>The benefits of <i>Odyssey</i> come from the strategy of transcription, utilizing multiple speech recognition services of Google Speech and IBM Watson, we are able to provide an accurate transcription of the audio provided. Odyssey’s turnover rate far surpasses the competition by providing transcripts within 5 mins of upload, we are able to do this by dividing the files into 30 second segments before transcribing, allowing for multiple files to be read simultaneously </p>\n<p><b>Process of transcription:</b></p>\n<p><b>User Uploads File</b><br />\nUser will be able to drag and drop multiple files or select files from their computer locally.</p>\n<p><b>System will divide file</b><br />\nApplication will strip audio from video files, and divide the audio into 30 second segments.</p>\n<p><b>Asynchronously send segments to IBM Watson and Google Speech</b><br />\nTo improve speeds, Odyssey will send multiple files simultaneously to be transcribed.</p>\n<p><b>Return results</b><br />\nResults are then returned</p>\n<p><b>Compare the results(favor Google due to accuracy)</b><br />\nComparing Google and IBM results to determine most accurate responses for questionable word choices.</p>\n<p><b>Show results with highlighted words with low confidence score(Watson/Google)</b><br />\nTranscripts returned with possible errors highlighted.</p>\n<p><b>Allow users to edit, play, or export PDF of their transcript</b><br />\nUsers are then able to correct any possible mistakes and save their final file. After which they are able to export to PDF.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Odyssey-Logo.png","title":"Odyssey Icon","alt":"Odyssey Icon","caption":""},"topics":[{"name":"Data","slug":"data"},{"name":"Tool\\Service","slug":"toolservice"}],"video_presentation_url":"https://player.vimeo.com/video/270190888","video_documentation_url":"https://player.vimeo.com/video/265455194","project_url":"https://www.sharifhadidi.com","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Odyssey-Logo.png","title":"Odyssey Icon","alt":"Odyssey Icon","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/odyssey-sitemap-1.png","title":"Odyssey Sitemap","alt":"Odyssey Sitemap","caption":"Odyssey Sitemap"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Odyssey-wirefram.png","title":"Odyssey-wireframe","alt":"Odyssey home wireframe","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Annotations.png","title":"Annotations","alt":"Transcript Annotations","caption":"Showcasing annotations"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/odyssey-gif.gif","title":"odyssey gif","alt":"Annotation Example","caption":"Odysseys annotation functionality"}]}