{"post_id":327,"student_id":"88","student_name":"Sean Kim","student_slug":"sean-kim","advisor_id":"129","advisor_name":"Nancy Hechinger","advisor_slug":"nh19","project_title":"Mindfulness Over Matter","project_question":"Meditation helps us achieve oneness with the world by removing our distracting desires. Breathing and time are all we need for meditation. After all, Shakyamuni Buddha founded Buddhism and popularized meditation without any high-tech tools. However, in the 21st century, people are increasingly dependent on technology. For most, meditation seems mysterious and irrelevant. <i>Mindfulness Over Matter</i> is a series of educational technologies that seek to make meditation accessible and entertaining, and inspire people to think about mindfulness. \r\n<br />\r\n<br />\r\nA brief overview of the technologies I have developed in my search to raise awareness about mindfulness:\r\n<br />\r\n<br />\r\n<b>Rat Race</b>\r\n<br />\r\n<br />\r\nA fun and engaging art installation/ game that is a satire of our hyper-competitive society. The more you relax, the faster your robot moves. \r\n<br />\r\n<br />\r\n<b>WAVR</b>\r\n<br />\r\n<br />\r\nAn EEG + VR headset that uses brainwave states to determine the virtual environment. Depending on the state of the user’s mind, their sensory (visuals, sounds, smells, motions) experience changes.\r\n<br />\r\n<br />\r\n<b>Mindfulness Fountain</b>\r\n<br />\r\n<br />\r\nAn EEG + AR Headset experience that simulates human delusions, and how meditation can help reveal true reality. The Washington Sq. Park Fountain can be compared to our minds. At times, the fountain flows full of water. Sometimes, there are musicians or magicians performing in the center. Other times the fountain is the center for political protests. Despite the many different experiences and occurrences in the fountain, it is really only a fountain. Similarly, our minds continuously come up with various thoughts and desires. \r\n<br />\r\n<br />\r\nFor this experience, I fill the fountain with various scenarios: water, magma, earthquake, and blizzards (using virtual augmentations). The EEG sensor measures the user’s level of concentration. If the user focuses, the distracting scenery disappears, so that in the end only the fountain is left. The more the user relaxes, the faster he/she can reach the true state of reality. ","short_description":"<i>Mindfulness Over Matter</i> is series of educational technologies that seek to generate interest about meditation and the importance of mindfulness. With art installations, unique gadgets, and interactive games that combine Mixed Reality and Brain-Computer Interfaces, this project aims to reach a broad audience and revolutionize how we approach mental well-being.","further_reading":"<p>In the winter of 2013, I had the opportunity to stay with Buddhist monks in South Korea. At the time, my life was very stressful and hectic, so I decided to spend time away from society. The temple was located in a very rural place 7 hours away from Seoul, completely isolated from everything. There was no electricity or central heating, and of course no internet or phone reception. While at the temple, I had the chance to learn meditation techniques and the power of mindfulness. I became aware of the world around me, and realized that our thoughts and our limited view of the world is what causes suffering. Living in one of the biggest cities in the world, I think that mindfulness would be of enormous benefits to New Yorkers.</p>\n<p>My understanding of New Yorkers comes from being an NYU student and having volunteered as a digital campaign assistant for the NY Regional Office of the U.S. Department of Commerce Census Bureau in 2010. It was at this time that I examined the demographics of New York City, and came to realize how tense and busy New Yorkers are through in-person meetings for the census. I also researched how to effectively appeal to different populations based on demographics.</p>\n<p>Many students and professionals in NYC are stuck in an everlasting rat race to the top. Meditation is a technique that can help people anchor their minds so that they are not overwhelmed with anxiety, and are able to regulate their emotions.</p>\n<p>Through my education at ITP, I have gained the knowledge and technology background to create engaging technologies. Since becoming a Dalai Lama Fellow, I’ve received mentoring and a network that provides guidance on how to best introduce mindfulness into society. While at ITP, I’ve continuously communicated with the fellowship for feedback and advice to help develop more meaningful projects. People sense that technology is one of the contributing factors to our hectic and anxious lives. The intention behind the design and use of technology makes all the difference: I firmly believe that technology has the power to raise awareness about mindfulness on a mass scale.</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/s3.jpg","title":"sean_thumbnail","alt":".","caption":"Mindfuness Over Matter _"},"topics":[{"name":"Education","slug":"education"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/video/270190986","video_documentation_url":"https://player.vimeo.com/video/265523783","project_url":"https://www.meditaSean.com/mom","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/s3.jpg","title":"sean_thumbnail","alt":".","caption":"Mindfuness Over Matter _"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Screen-Shot-2018-05-07-at-6.20.51-PM-1024x578.png","title":".","alt":".","caption":"."},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ratrace01.jpg","title":"ratrace01","alt":".","caption":"."},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/wavr01.jpg","title":".","alt":".","caption":"."},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/ss0003.png","title":"","alt":".","caption":"."}]}