{"post_id":474,"student_id":"90","student_name":"Shivanku Kumar Fnu","student_slug":"shivanku-kumar-fnu","advisor_id":"129","advisor_name":"Nancy Hechinger","advisor_slug":"nh19","project_title":"NewChat: All the News That's Fit to Chat","project_question":"Social content curation is a great way to discover interesting content on common topics of interest among friends. When there are 40,000 articles getting published every week on one topic, as was recorded for Bitcoin in December 2017, we need some help from our friends to identify which ones are important. Social media platforms started off as great tools to do this. But content sharing on social media has declined by 50% over the last couple of years, with fewer people sharing most of the content. \r\n<br />\r\n<br />\r\nThis trend has increased the possibility of bias in content on these platforms, and eroded their utility as conduits for healthy media consumption. As content sharing on social media declines, private sharing on chat apps has increased. In fact, 65% of total content shared was on private chat applications in 2017. <i>NewChat</i> is an application that embraces the increasing tendency toward private sharing, by exploring the content curation opportunities this social shift presents.\r\n<br />\r\n<br />\r\nAnd it’s not just about the quantity of content. The quality of content shared on chat applications is much different than that on social media platforms. When you replace the functionality of broadcasting one’s message, a common feature among all social networking platforms, with peer to peer conversations, the motive of sharing changes which has a huge impact on the kind of people who share content.\r\n<br />\r\n<br />\r\nUnlike social media, chat applications do not have a concept of popularity which invites a diversity of people to share the content that interests them. Which is not to say that content on chat apps is always better, we have heard of the cases of fake news spreading through WhatsApp forwards. This makes testing chat apps as content curation platforms very interesting. <i>NewChat</i> explores this possibility by introducing the concept of public feed and system recommendations into a chat environment.","short_description":"This project looks at the current challenges in news consumption. Content overload combined with inefficient content curation is identified as the root cause of the problems. A new platform is proposed which aims to make social collaboration inclusive and effective, it is a mobile app called <i>NewChat</i>.","further_reading":"<p>You can try out the prototype here:<br />\nhttps://marvelapp.com/87e6e1h<br />\n<iframe src=\"https://marvelapp.com/87e6e1h?emb=1&amp;iosapp=false&amp;frameless=false\" width=\"390\" height=\"755\"></iframe><br />\nThe release of the app will be announced on my personal website, https://www.shivanku.com/</p>\n<p><b>Example of a failed iteration</b><br />\nThis project deals with the challenges of making news consumption easy, efficient and meaningful. At the center of the proposed solution is the observations that collaboration is key to effective news consumption. When you get a news story from a friend, you not only get valuable context on quality of that content, you also get a chance at converting that content into action. Various approaches were iterated over in order to achieve this collaboration. Here is one that was dropped after testing:<br />\nhttps://marvelapp.com/32637e3<br />\n<iframe src=\"https://marvelapp.com/32637e3?emb=1&amp;iosapp=false&amp;frameless=false\" width=\"390\" height=\"755\"></iframe></p>\n<p>The idea behind the above proposal was that people realize each other’s expertise and assign each other topics to report on. This solution falls short of reality due to several reasons, for example it is difficult to make these assignments and excite people to share content on this platform. So a revision was made in order to develop collaboration in an ecosystem where content sharing is happening already, the chat ecosystem.</p>\n<p><b>Why focus on news consumption?</b><br />\nThe lack of trust in news media is not a new phenomenon. People have been skeptical of the motives of corporate owned mainstream media much before internet came along. The ever growing examples of their propagandist nature and their failure to provide even remotely proportionate coverage to the lives of bottom 98% of the world population, has diminished the value of their word. Yet, the sheer amount, ubiquity and veneer of authority of news stories from such sources makes them difficult to ignore. There is no other reason to run news channels 24x7 and publish over 500 news stories per week (which a typical mainstream news outlet easily does) but to compensate for this trust deficit with insane amount of repetition.</p>\n<p>Be that as it may, in the age of internet, in theory, we have the luxury to ignore the mainstream completely because professional journalism can exist outside the corporate control. And it does. But if we thought extracting truth from a pile of misinformation was a challenge with the mainstream media, we were not prepared for what the internet had to offer. The worst forms of bigotry, hate speech, obscenity, manipulation, misinformation and conspiracy theories, the likes of which we had never seen expressed so freely and at such a scale. And then there are the big monopolies of internet. The same corporate control over information that we escaped from followed us into the world of internet, this time with network effects so its difficult for us to leave.</p>\n<p>So we now have a problem at our hands. It has become extremely difficult to stay informed about our own society. To separate facts from fiction, objectivity from propaganda, radicalism from bigotry.</p>\n<p>But why is this important? Why should we worry about the information we receive? What difference does it make? Aren’t human beings poor thinkers who reject new information based on their morals or confirmation biases anyway? Do we even want objective facts or are we just looking to be entertained?</p>\n<p>Yes, there are fallacies in our thinking but historically we have devised several thinking techniques and exercises to overcome those fallacies when we have to. One such example is the concept of “design thinking” popularized by IDEO. Several product companies use this approach to shed their biases and understand the real needs of their users. Similarly there is the tradition of scientific thinking. The rigorous regime of observation, experimentation, peer review etc ensures that scientists do not fall for their own confirmation biases. The author of a seminal book on this topic and a professor at NYU Jonathan Haidt himself directs us to a possible approach to overcome our moral elephant (a reference from his book The Righteous Mind):</p>\n<p>each individual reasoner is really good at one thing: finding evidence to support the position he or she already holds, usually for intuitive reasons. We should not expect individuals to produce good, open-minded, truth-seeking reasoning, particularly when self-interest or reputation concerns are in play. But if you put individuals together in the right way, such that some individuals can use their reasoning powers to disconfirm the claims of others, and all individuals feel some common bond or shared fate that allows them to interact civilly, you can create a group that ends up producing good reasoning as an emergent property of the social system.</p>\n<p>A more fundamental question asked earlier was what difference does all this make? Don’t people even in democratic countries have very limited control over the policies of their government? Don’t most people only participate in the democratic process, if at all, once every four-five years during elections. And then too they don’t vote based on objective analysis of the policies of the candidates. So what difference does it make? Noam Chomsky was asked this question in an interview in 1988, his complete answer is worth listening to. One example he gave that is quite striking was that of progress in minority rights in 1960s America. Media did not tell individuals in minority communities that the system was acting against them, but it was crucial in telling them that they were not alone. Which lead to a movement and to change. When media stops doing that, it becomes a tool to hide information and isolate people. As Robert Reich puts it in his documentary Saving Capitalism:</p>\n<p>All social change occurs when people become aware of a tension between the ideals that they carry around in their heads about how the system really ought to work, and the reality they see around them. And when that tension becomes too great, that dissonance becomes too tense, they are willing to take action</p>\n<p>In conclusion, our vision was to create a product around consumption of news that solves a couple of key problems:</p>\n<ul>\n<li><b>Pollution of the information space.</b> How can we effectively manage the sheer quantity of news in ways that lets users get information from a diverse set of sources. In her book Twitter and Tear Gas, Zeynep Tufekci makes a striking observation that governments have learnt that the best way to censor the internet is by polluting the information space to an extent that it becomes useless. The voices of good independent reporting gets lost in that pollution. Important topics that need attention get overrun when the mind space is hijacked by agenda set by few big corporations. Examples of solution in this area would be devising an effective rating system for news stories, creating a platform for independent journalists to publish and get viewership, designing a dashboard or a bird’s eye view of the information space for the consumers and so on.</li>\n<li><b>Fallacies of human thought process. How can we create constructive news consumption habits so that users can understand and avoid their own biases as well as the biases of the content creators. Designing systems that encourages readers to question the facts presented, question the motives and background of the author, look for historical context, discover the parts of story that are not being told and be able to engage in a dialog with the author and fellow readers is important. Existing systems like quora, wikipedia, github are some sources of inspiration that such a dialog is possible.<br />\nNewChat proposed as it is now is just the beginning of the process to accomplish these objectives.</b></li>\n<p>Useful Links:<br />\nhttps://www.newsdeeply.com<br />\nhttps://www.theatlantic.com/business/archive/2017/11/media-apocalypse/546935/<br />\nhttps://thenextweb.com/insider/2018/01/26/swedish-startup-strossle-wants-to-make-journalism-pay-again/<br />\nhttps://strossle.com/blog/lasindex-2017-2/<br />\nhttps://blog.prototypr.io/hyperloop-interface-around-the-world-in-a-minute-93552c1dcf64<br />\nhttp://www.bbc.com/news/technology-42872603<br />\nhttps://www.indiabudget.gov.in/previouses.asp<br />\nhttp://www.pewglobal.org/2018/01/11/publics-globally-want-unbiased-news-coverage-but-are-divided-on-whether-their-news-media-deliver/<br />\nhttp://www.journalism.org/essay/searching-for-news/<br />\nhttp://www.journalism.org/2016/07/07/the-modern-news-consumer/<br />\nhttps://www.marketwatch.com/story/how-biased-is-your-news-source-you-probably-wont-agree-with-this-chart-2018-02-28<br />\nhttps://beta.techcrunch.com/2016/05/26/most-people-get-their-news-from-social-media-says-report/<br />\nhttps://techcrunch.com/2018/03/20/google-news-initiative/<br />\nhttps://medium.com/facebook-design/designing-new-ways-to-give-context-to-news-stories-f6c13604f450<br />\nhttps://techcrunch.com/2018/04/09/bots-on-twitter-share-two-thirds-of-links-to-popular-websites-pew/?utm_source=tctwreshare&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+Techcrunch+%28TechCrunch%29&amp;sr_share=twitter<br />\nhttps://www.wsj.com/articles/the-secret-to-better-social-media-fewer-friends-1523376444<br />\nhttp://www.niemanlab.org/2014/11/heres-some-remarkable-new-data-on-the-power-of-chat-apps-like-whatsapp-for-sharing-news-stories/<br />\nhttp://www.businessinsider.com/the-messaging-app-report-2015-11/?IR=T<br />\nhttps://www.buzzfeed.com/craigsilverman/viral-fake-election-news-outperformed-real-news-on-facebook?utm_term=.ymgMjLzkP#.yp8K2Bx6d<br />\nhttps://getsocial.io/</p>\n","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Thumbnail-3.jpg","title":"new chat","alt":"This is a placeholder logo for the app","caption":""},"topics":[{"name":"Society","slug":"society"},{"name":"UX\\UI","slug":"uxui"}],"video_presentation_url":"https://player.vimeo.com/video/270191244","video_documentation_url":"","project_url":"https://www.shivanku.com/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Thumbnail-3.jpg","title":"new chat","alt":"This is a placeholder logo for the app","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Carousel_img1.png","title":"Carousel_img1","alt":"This is an image depicting the chat page in the NewChat app","caption":"This is an image depicting the chat page in the NewChat app"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Carousel_img2.png","title":"Carousel_img2","alt":"This is an image depicting the public feed in the NewChat app","caption":"This is an image depicting the public feed in the NewChat app"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Carousel_img3-1.png","title":"Carousel_img3","alt":"This is an image depicting the chat page n NewChat app","caption":"This is an image depicting the chat page n NewChat app"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Carousel_img4-2.jpg","title":"Carousel_img4","alt":"This is an image depicting the user testimonies","caption":"This is an image depicting the user testimonies"}]}