{"post_id":622,"student_id":"93","student_name":"Zachary Coble","student_slug":"zachary-coble","advisor_id":"129","advisor_name":"Nancy Hechinger","advisor_slug":"nh19","project_title":"Wikibabel","project_question":"<i>Wikibabel</i> examines contemporary epistemology through an alternate version of Wikipedia. The site, a searchable database that is aesthetically and functionally similar to Wikipedia, is created with a process that uses machine learning to analyze the entirety of the online encyclopedia for its linguistic and structural style and then creates new articles based on those patterns. The project employs parody and satirical critique to explore how the conflict between the encyclopedia’s quest for \"neutral point of view\" and shifts in credibility brought about by the social web struggle to convey complex and controversial topics within the rigid article template’s Harvard Outline format.\r\n<br />\r\n<br />\r\nWhile close reading of <i>Wikibabel</i> reveals that the pages are grammatically correct, although it rarely produces a coherent article that would find a home in most encyclopedias. However, as Aristotle noted, nature abhors a vacuum, and when reading a <i>Wikibabel</i> article, the reader takes cues from its appearance as an encyclopedia to fill in the missing meaning. As a digital sculpture that strips down the encyclopedia to its bare essentials - the aesthetic cues, the article template, and the linguistic style—<i>Wikibabel</i> introduces a new system of knowledge with results that are amusing, confusing, and if you are not paying close attention, entirely believable.","short_description":"Can an algorithmically generated encyclopedia create a believable system of knowledge?","further_reading":"","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/putin-320x240-fish.jpg","title":"Wikibabel","alt":"Wikibabel","caption":"Wikibabel"},"topics":[{"name":"Culture","slug":"culture"},{"name":"Machine Learning","slug":"machine-learning"}],"video_presentation_url":"https://player.vimeo.com/video/270192162","video_documentation_url":"","project_url":"http://zachcoble.com","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/putin-320x240-fish.jpg","title":"Wikibabel","alt":"Wikibabel","caption":"Wikibabel"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/wikibabel-3.png","title":"Battle of Ajan","alt":"Wikibabel page for Battle of Ajan","caption":"Wikibabel page for Battle of Ajan"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/wikibabel-4-1.png","title":"Dried Aggregate","alt":"Wikibabel page for Dried Aggregate","caption":"Wikibabel page for Dried Aggregate"}]}