{"post_id":583,"student_id":"94","student_name":"Ziyu He","student_slug":"ziyu-he","advisor_id":"129","advisor_name":"Nancy Hechinger","advisor_slug":"nh19","project_title":"It will be perfect from now on","project_question":"<i>it will be perfect from now on</i> is built with custom made mechanic arms, alabaster, aluminum, dc motor, micro-controller.\r\n<br />\r\n<br />\r\n<i>it will be perfect from now on</i> is a process of the artificial erosion of four stones by four identical steel files. Four alabaster stones are placed on one station, each occupying one corner. Over each stone, there is a steel file that glides back and forth on the surface of the stone. Four stations move in the same rhythm, the motion is slow yet constant, creating an identical imprint on the stones. The sculpture uses formation both as a physical process and as a metaphorical device to represent the effect of governmental policies on individuals. Is it reformation, is it laceration? Is there profit, is there loss?\r\n<br />\r\n<br />\r\n<i>it will be perfect from now on</i> is an abstract response from an only child to the one child policy in China. It is a reflection on being the subject of a policy that was implemented for the welfare of an overpopulated society. To paraphrase Michel Foucault, governments arrogate and justify their negligence and the right to pass off human unhappiness as mere abstract profit or loss, just because the decisions they exercise claim to be concerned with the welfare of whole societies. A policy as such is portrayed in the sculpture as a force, an act that remorselessly erodes and shapes anything underneath in a slow-motion whirlpool of time, that one can not simply say the beautiful totality of the individual is amputated or repressed. The irreversible effect of the policy becomes a new complex form of individuality that has yet to be understood. ","short_description":"A kinetic sculpture that visually portrays the intricate relations between the individual and the power structure they live under. Individuals, with their identities and characteristics, are the product of that power that is exercised over their bodies, their multiplicities, their movements and desires. It is an abstract response from an only child to the one child policy in China.","further_reading":"","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Untitled-2.002.jpeg","title":"it will be perfect from now on","alt":"it will be perfect from now on - thumbnail","caption":"it will be perfect from now on - thumbnail"},"topics":[{"name":"Installation","slug":"installation"},{"name":"Society","slug":"society"}],"video_presentation_url":"https://player.vimeo.com/video/270192261","video_documentation_url":"https://player.vimeo.com/ziyuhe/itwillbeperfectfromnowon","project_url":"https://www.ziyuhe.co","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Untitled-2.002.jpeg","title":"it will be perfect from now on","alt":"it will be perfect from now on - thumbnail","caption":"it will be perfect from now on - thumbnail"}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Untitled.001-1.jpeg","title":"it will be perfect from now on","alt":"it will be perfect from now on - prototype","caption":"it will be perfect from now on - prototype"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Untitled.002-1.jpeg","title":"it will be perfect from now on","alt":"it will be perfect from now on - prototype","caption":"it will be perfect from now on - prototype"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Untitled.003-1.jpeg","title":"it will be perfect from now on","alt":"it will be perfect from now on - prototype","caption":"it will be perfect from now on - prototype"},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/Untitled.004-1.jpeg","title":"it will be perfect from now on","alt":"it will be perfect from now on - prototype","caption":"it will be perfect from now on - prototype"}]}