{"post_id":395,"student_id":"97","student_name":"Dong Chan Kim","student_slug":"dong-chan-kim","advisor_id":"131","advisor_name":"Stefani Bardin","advisor_slug":"sb4840","project_title":"The Son's Drawer","project_question":"In virtual reality, my father is invited to my home in New York where he's never visited in person. He looks around the son's living room, which is hand-painted. Some of the things in there are distinguished from the surroundings because they're 3D scanned and colored. These objects are specifically associated with the memories from my personal history. \r\n<br />\r\n<br />\r\nWhen he touches or grab one of these, the story begins with my narration and the sketches are drawn around the object. After he puts all the things to the drawer, a photography pops up. It is the photo of him when he was in the hospital. And the experience ends with my message saying that I hope I can collect more memories with him in the future.\r\n<br />\r\n<br />\r\nThis project is to get my father who underwent cancer surgery last year to take care of himself. The way I chose to do it is a story. Because I believe that story can change one’s behavior.\r\n<br />\r\n<br />\r\nI have a drawer of my little things from last 20 years. They may be nothing special to look at, but for me, each one is a treasure with a precious story on it. By telling my father about these stories, I want to remind him that he has a family that cares about his health more than he does. And I expect this experience will inspire him.\r\n<br />\r\n<br />\r\nSince I'm in New York and my father is in Seoul, it's hard to demonstrate the actual things. Also, it can also be hard to focus on because it starts with small, nothing-special objects. So I chose virtual reality. Since it uses HMD (Head-Mounted Display), which blocks outside interference. I think it will help my father become more absorbed in the story.","short_description":"<i>The Son’s Drawer</i> uses immersive technology in order to tell the story of the artist’s bond with his father. It was created in response to his father’s recent illness and intends to communicate to his father the importance of his ongoing health to his family.","further_reading":"","portfolio_icon":{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/key-image_320x240.jpg","title":"key image_320x240","alt":"Main image of the project","caption":""},"topics":[{"name":"Narrative","slug":"narrative"},{"name":"VR\\AR","slug":"vr-ar"}],"video_presentation_url":"https://player.vimeo.com/video/269185807","video_documentation_url":"https://player.vimeo.com/video/265451858","project_url":"http://dongchankim.com/","description":"","featured_image":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/key-image_320x240.jpg","title":"key image_320x240","alt":"Main image of the project","caption":""}],"slide_show":[{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/slider02_title-1.png","title":"slider02_title","alt":"title page","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/slider01_play-2.png","title":"slider01_play","alt":"play concept image","caption":""},{"src":"https://itp.nyu.edu/thesis2018/wp-content/uploads/2018/04/3D-drawing.gif","title":"3D-drawing","alt":"3D drawing moving in VR","caption":""}]}